Repository: uzbek-net/dictionary
Catalog: gnome/circle/apostrophe.main.*.po
Languages: uz

source: Apostrophe
uz: Apostrof

source: Apostrophe, an elegant, distraction-free markdown editor
uz: Apostrof, chiroyli, chalgʻituvchi vositalarsiz markdown muharriri

source: New Window
uz: Yangi oyna

source: Edit Markdown in style
uz: Markdown uslubida tahrirlash

source: Focus on your writing with a clean, distraction-free markdown editor.
uz: Toza, chalgʻituvchi unsurlardan xoli markdown tahrirlagich orqali yozuvingizga diqqatingizni qarating.

source: Features:
uz: Xususiyatlar:

source: An UI tailored to comfortable writing
uz: Qulay yozishga moslashtirilgan foydalanuvchi interfeysi

source: A distraction-free mode
uz: Chalgʻimaslik rejimi

source: Dark, light and sepia themes
uz: Tungi, yorugʻ va sepia mavzulari

source: Everything you expect from a text editor, such as spellchecking or document statistics
uz: Matn muharriridan kutgan barcha xususiyatlar, masalan imlo tekshirish yoki hujjat statistikasi kabi funksiyalar mavjud

source: Live preview of what you write
uz: Yozayotganingizni jonli koʻrish imkoniyati

source: Export to all kind of formats: PDF, Word/Libreoffice, LaTeX, or even HTML slideshows
uz: PDF, Word/Libreoffice, LaTeX yoki hatto HTML slayd-shou formatlariga eksport qilish

source: Main window
uz: Asosiy oyna

source: Main window in dark mode
uz: Asosiy oyna tungi mavzuda

source: Inserting a table with the help of the toolbar
uz: Uskunalar paneli yordamida jadval qoʻyish

source: The preview lets you see a live rendered version of your document
uz: Oldindan koʻrish sizga hujjatingizning jonli taqdim etilgan versiyasini koʻrish imkonini beradi

source: The focus mode allow for a more distraction-free experience
uz: Diqqatni jamlash rejimi koʻproq chalgʻimaslik imkonini beradi

source: Color scheme
uz: Rang sxemasi

source: Use the color scheme in the application's UI and in the text area.
uz: Ilovaning foydalanuvchi interfeysida va matn maydonida rang sxemasidan foydalaning.

source: Check spelling while typing
uz: Yozayotgan paytda imloni tekshirish

source: Enable or disable spellchecking.
uz: Imlo tekshirishni yoqish yoki oʻchirish. oʻzbek

source: Synchronize editor/preview scrolling
uz: Tahrirchini sinxronlashtirish/oldindan koʻrib kezish

source: Keep the editor and preview scroll positions in sync.
uz: Tahrirchini saqlab, oldindan kezib koʻrish pozitsiyalarini sinxronlashtirish.

source: Input format
uz: Kiritish formati

source: Input format to use when previewing and exporting using Pandoc.
uz: Pandoc yordamida oldindan koʻrish va eksport qilishda qoʻqoʻllaniladigan kirish formati.

source: Autohide Headerbar
uz: Sarlavha panelini avtomatik yashirish

source: Hide the header and status bars when typing.
uz: Yozayotganda sarlavha va status panelini yashirish.

source: Default statistic
uz: Standart statistika

source: Which statistic is shown on the main window.
uz: Qaysi statistika asosiy oynada koʻkoʻrsatilgan.

source: Characters per line
uz: Har bir qatordagi belgilar

source: Maximum number of characters per line within the editor.
uz: Tahrirchidagi har bir qatordagi belgilarning maksimal soni.

source: Hemingway Mode
uz: Xeminguey uslubi

source: Whether the user can delete text or not.
uz: Foydalanuvchi matnni oʻchira oladimi yoki yoʻqmi.

source: Hemingway Toast Count
uz: Xeminguey toshlari soni

source: Number of times the Hemingway Toast has been shown
uz: Xeminguey toshi necha marta koʻrsatilgani soni

source: Preview mode
uz: Oldindan koʻrish rejimi

source: How to display the preview.
uz: Oldindan koʻrish qanday namoyish etiladi.

source: Preview Security
uz: Xavfsizlikni koʻrib chiqish

source: Security policy to apply when rendering files.
uz: Fayllarni qayta ishlashda qoʻllaniladigan xavfsizlik siyosati.

source: Preview active
uz: Oldindan koʻrish faol

source: Whether showing of preview is active when launching a new window.
uz: Yangi oyna ochilayotganda oldindan koʻrish faol ekanligini koʻrsatish.

source: Text size
uz: Matn oʻlchamini

source: Preferred relative size for the text.
uz: Matn uchun maqbul nisbiy oʻlcham.

source: Toolbar
uz: Uskunalar paneli

source: Whether the toolbar is shown or not.
uz: Asboblar paneli koʻrsatilishi yoki koʻrsatilmasligi.

source: Number of seconds between autosaves
uz: Avtomatik saqlash orasidagi soniyalar soni

source: Copyright (C) 2022, Manuel G., Wolf V.
uz: Mualliflik huquqi (C) 2022, Manuel G., Wolf V.

source: translator-credits
uz: Baxrom Raxmatov

source: The Hemingway Mode mimics the experience of writing on a typewriter, not allowing you to delete any text or doing any kind of editing. Only being able to move forward may be frustrating, but can be an interesting exercise for improving your writing skills, gaining focus or facing the task on hand with a different mindset.
uz: Hemingway rejimi yozuv mashinkasida yozish tajribasiga taqlid qiladi, hech qanday matnni oʻchirish yoki tahrirlash imkonini bermaydi. Faqat oldinga siljish hafsalangizni pir qilishi mumkin, ammo bu yozish koʻnikmalaringizni yaxshilash, diqqatni jamlash yoki qoʻlingizdagi vazifani boshqacha fikrlash bilan bajarish uchun qiziqarli mashq boʻlishi mumkin.

source: _Close
uz: Yopish

source: Error Details
uz: Xatolik tafsilotlari

source: Apostrophe experienced an error
uz: Tutuq belgisi xatoga yoʻl qoʻydi

source: Error Message
uz: Xato xabari

source: Copy Error Message
uz: Xato xabarini nusxalash

source: Report _Issue
uz: Muammo haqida xabar berish

source: Formats
uz: Formatlar

source: Export
uz: Eksport

source: Options
uz: Parametrlar

source: Standalone
uz: Alohida

source: Use a header and footer to include things like stylesheets and meta information
uz: Sarlavha va kolontituldan uslublar jadvali va meta-ma’lumotlar kabi elementlarni kiritish uchun foydalaning

source: Relative to Absolute
uz: Mutlaqga nisbatan

source: Replace relative path with absolute for images and links
uz: Rasmlar va havolalar uchun nisbiy yoʻlni mutlaq yoʻl bilan almashtiring

source: Table of Contents
uz: Mundarija

source: Number Sections
uz: Raqamlangan boʻlimlar

source: Page Size
uz: Sahifaning oʻlchami

source: HTML Options
uz: HTML parametrlari

source: Self-Contained
uz: Oʻz ichiga olgan

source: Produces an HTML file with no external dependencies
uz: Tashqi bogʻliqliklarsiz HTML faylni ishlab chiqaradi

source: Syntax Highlighting
uz: Sintaksisni ajratish

source: Use Syntax Highlighting
uz: Sintaksisni ajratib belgilashdan foydalanish

source: Highlight Style
uz: Ajratish uslubi

source: Presentation
uz: Taqdimot

source: Incremental Bullets
uz: Oʻsib boruvchi oʻqlar

source: Show one bullet point after another in a slideshow
uz: Taqdimotda oʻq nuqtalarni birin-ketin koʻrsatish

source: Main Menu
uz: Asosiy menyu

source: New File
uz: Yangi fayl

source: _Open
uz: Ochish

source: _Save
uz: Saqlash

source: _Save As...
uz: Boshqacha saqlash

source: Advanced _Export…
uz: Kengaytirilgan eksport

source: _Copy HTML
uz: HTMLʼdan nusxa olish

source: _Hemingway Mode
uz: Xeminguey uslubi

source: _Focus Mode
uz: Fokus rejimi

source: Search in the File
uz: Faylda qidirish

source: Find and _Replace
uz: Qidirish va almashtirish

source: _Preferences
uz: Afzalliklar

source: Open _Tutorial
uz: Qoʻllanmani ochish

source: _Keyboard Shortcuts
uz: Klaviatura yorliqlari

source: _About Apostrophe
uz: Tutuq belgisi haqida

source: Open Markdown File
uz: Markdaun faylini ochish

source: Save Markdown File
uz: Markdaun faylini saqlash

source: Not Found
uz: Topilmadi

source: Check Spelling
uz: Imloni tekshirish

source: Auto-Hide Header Bar
uz: Sarlavha panelini avtomatik berkitish

source: Auto-hide header and status bars while typing
uz: Yozish paytida sarlavha va status qatorlarini avtomatik berkitish

source: Large Text
uz: Katta matn

source: Reduce the margins width and increase the text size when possible
uz: Imkon qadar hoshiyalar kengligini kamaytiriladi va matn hajmini kattalashtiriladi

source: Restore Session
uz: Seansni tiklash

source: Return to your previous session when Apostrophe is started
uz: Tutuq belgisi boshlanganida oldingi seansga qaytish

source: Input Format
uz: Kiritish formati

source: Flavor of markdown Apostrophe will use
uz: Apostrof foydalanadigan markdaun uslubi

source: Markdown Flavor Documentation
uz: Markdaun koʻrinishi boʻyicha qoʻllanma

source: Desired level of security when rendering the preview
uz: Oldindan koʻrish vaqtida talab qilinadigan xavfsizlik darajasi

source: Preview
uz: Oldindan koʻrish

source: Screen Layout
uz: Ekran tuzilishi

source: No Recent Documents
uz: Oxirgi hujjatlar yoʻq

source: No Results Found
uz: Natija topilmadi

source: Previous Match
uz: Oldingi moslik

source: Next Match
uz: Keyingi moslik

source: Case Sensitive
uz: Harflar katta-kichikligiga sezgir

source: Regular Expression
uz: Muntazam ifoda (regex)

source: Replace
uz: Almashtiring

source: Replace All
uz: Hammasini almashtirish

# shortcut window
source: New
uz: Yangi

# shortcut window
source: Open
uz: Ochish

# shortcut window
source: Save
uz: Saqlash

# shortcut window
source: Save As
uz: Boshqacha saqlash

# shortcut window
source: Close Document
uz: Hujjatni yopish

# shortcut window
source: Show Preferences
uz: Afzalliklarni koʻrsatish

# shortcut window
source: Keyboard Shortcuts
uz: Klaviatura yorliqlari

# shortcut window
source: Quit Application
uz: Dasturdan chiqish

# shortcut window
source: Modes
uz: Rejimlar

# shortcut window
source: Focus Mode
uz: Fokus rejimi

# shortcut window
source: Hemingway Mode
uz: Xeminguey uslubi

# shortcut window
source: Preview
uz: Oldindan koʻrish

# shortcut window
source: Fullscreen
uz: Toʻliq ekran

# shortcut window
source: Find
uz: Qidirish

# shortcut window
source: Find and Replace
uz: Qidirish va almashtirish

# shortcut window
source: Markdown
uz: Markdaun

# shortcut window
source: Separator
uz: Ajratuvchi

# shortcut window
source: Header
uz: Sarlavha

# shortcut window
source: List Item
uz: Roʻyxat elementi

# shortcut window
source: Italic
uz: Kursiv

# shortcut window
source: Bold
uz: Qalin

# shortcut window
source: Copy and Paste
uz: Nusxalash va Qoʻyish

# shortcut window
source: Copy
uz: Nusxalash

# shortcut window
source: Cut
uz: Qirqish

# shortcut window
source: Paste
uz: Qoʻyish

# shortcut window
source: Undo and Redo
uz: Bekor qilish va qayta bajarish

# shortcut window
source: Undo Previous Command
uz: Oldingi buyruqni bekor qilish

# shortcut window
source: Redo Previous Command
uz: Oldingi buyruqni takrorlang

# shortcut window
source: Selection
uz: Tanlash

# shortcut window
source: Select All Text
uz: Barcha matnlarni tanlash

source: Show Statistics
uz: Statistikani koʻrsatish

source: 0 Words
uz: 0 ta soʻz

source: TexLive Required
uz: TexLive talab qilinadi

source: Apostrophe needs the TeXLive extension in order to export PDF or LaTeX files. Install it from Apostrophe's page in Software or by running the following command in a terminal:
uz: Apostrophe dasturi PDF yoki LaTeX fayllarini eksport qilish uchun TeXLive kengaytmasiga muhtoj. Uni Dasturiy ta’minot markazidagi Apostrophe sahifasidan oʻrnating yoki terminalda quyidagi buyruqni bajarish orqali:

source: Copy to Clipboard
uz: Buferga koʻchirish

source: Apostrophe needs TeXLive in order to export PDF or LaTeX files. Install it from your distribution repositories.
uz: Apostrophe uchun TeXLive kerak PDF yoki Latex fayllarni eksport qilish uchun. Uni distribyutor repositoriylardan yuklab oling.

source: Use System Colors
uz: Tizim ranglaridan foydalanish

source: Use Light Colors
uz: Och ranglardan foydalanish

source: Use Sepia Colors
uz: Sepia ranglaridan foydalanish

source: Use Dark Colors
uz: Toʻq ranglardan foydalanish

source: Bold
uz: Qalin

source: Italic
uz: Kursiv

source: Heading
uz: Sarlavha

source: List
uz: Roʻyxat

source: Insert
uz: Kiritish

source: Table
uz: Jadvalda

source: Unordered
uz: Tartibsiz

source: Ordered
uz: Tartibga solingan

source: Checklist
uz: Nazorat roʻyxati

source: Blockquote
uz: Ibora

source: Code
uz: Kod

source: Link
uz: Havola

source: Image
uz: Rasm

source: Unordered List
uz: Tartibsiz roʻyxat

source: Ordered List
uz: Tartibli roʻyxat

source: Check List
uz: Nazorat roʻyxati

source: This file may be insecure
uz: Bu fayl xavfli boʻlishi mumkin

source: Previewing files from untrusted sources can be dangerous. If you're unsure about the contents of this file, open it in the Restricted Preview where javascript and HTML are disabled.
uz: Ishonchsiz manbalardan olingan fayllarni koʻrib chiqish xavfli boʻlishi mumkin. Agar bu faylning tarkibi haqida ikkilansangiz, uni javascript va HTML oʻchirilgan cheklangan koʻrinishda oching.

source: Load Preview
uz: Oldindan koʻrishni yuklash

source: Load Restricted Preview
uz: Yuklash cheklangan holatida koʻrinish

source: Apostrophe closed unexpectedly. This file has been recovered from an autosave
uz: Apostrof kutilmaganda yopildi. Bu fayl avtomatik saqlash orqali qayta tiklandi.

source: File Has Changed on Disk
uz: Diskdagi fayl oʻzgardi

source: The file has been changed by another program
uz: Fayl boshqa dastur tomonidan oʻzgartirilgan

source: _Discard Changes and Reload
uz: Oʻzgarishlarni bekor qiling va qayta yuklang

source: Donate
uz: Xayriya qiling

source: Translations
uz: Tarjimalar

source: Hide Toolbar
uz: Uskunalar panelini berkitish

source: Show Toolbar
uz: Uskunalar panelini koʻrsatish

source: Export to %s
uz: %s ga eksport qilish

source: Cancel
uz: Bekor qilish

source: Apostrophe experienced an error while trying to export:
uz: Apostrop eksport qilishda xatolik yuz berdi:

source: Export to {}
uz: {} ga eksport qilish

source: An error happened while trying to export: {err_msg}
uz: Eksport qilishda xatolik yuz berdi: {err_msg}

source: Select folder
uz: Jild tanlash

source: Error
uz: Xatolik

source: Close
uz: Yopish

source: Unsaved documents
uz: Saqlanmagan hujjatlar

source: LaTeX not found
uz: Latex topilmadi

source: Formula looks incorrect:
uz: Formula notoʻgʻri koʻrinadi:

source: No matching footnote found
uz: Hech qanday mos izoh topilmadi

source: noun
uz: ot

source: verb
uz: feʼl

source: adjective
uz: sifat

source: adverb
uz: ravish

source: Text can't be deleted while on Hemingway mode
uz: Xeminguey rejimida matnni oʻchirish imkonsiz

source: Tell me more
uz: Batafsil aytib bering

source: Save your File
uz: Faylingizni saqlang

source: Save
uz: Saqlash

source: Markdown Files
uz: Belgilash fayllari

source: Plain Text Files
uz: Oddiy matn fayllari

source: Open a .md file
uz: .md faylni ochish

source: Open
uz: Ochish

source: Failed to detect encoding for file: {file} The error was: {err_msg}
uz: Fayl uchun kodlash aniqlanmadi: {file} Xatolik: {err_msg}

source: Save Changes?
uz: Oʻzgarishlar saqlansinmi?

source: “%s” contains unsaved changes. If you don’t save, all your changes will be permanently lost.
uz: "%s" faylida saqlanmagan oʻzgarishlar mavjud. Agar saqlamasangiz, barcha oʻzgarishlar butunlay oʻchib ketadi.

source: Discard
uz: Bekor qilish

source: Always Ask
uz: Har doim soʻralsin

source: Always Use Restricted Preview
uz: Doimo cheklangan koʻrib chiqish rejimidan foydalaning

source: Always Use Unrestricted Preview
uz: Doimo cheklanmagan koʻrib chiqish imkoniyatidan foydalaning

source: Full-Width
uz: Toʻliq kenglik

source: Half-Width
uz: Yarim kenglik

source: Half-Height
uz: Yarim balandlik

source: Windowed
uz: Oynali

source: {:n} of {:n} Characters
uz: {:n}/{:n} ta belgilar

source: {:n} Character
uz: {:n} ta belgilar

source: {:n} of {:n} Words
uz: {:n}/{:n} ta soʻzlar

source: {:n} Word
uz: {:n} ta soʻzlar

source: {:n} of {:n} Sentences
uz: {:n}/{:n} ta gaplar

source: {:n} Sentence
uz: {:n} ta gaplar

source: {:n} of {:n} Paragraphs
uz: {:n}/{:n} ta xatboshi

source: {:n} Paragraph
uz: {:n} ta xatboshi

source: {:d}:{:02d}:{:02d} of {:d}:{:02d}:{:02d} Read Time
uz: {:d}:{:02d}:{:02d} / {:d}:{:02d}:{:02d} Mutolaa vaqti

source: {:d}:{:02d}:{:02d} Read Time
uz: {:d}:{:02d}:{:02d} Mutolaa vaqti

source: italic text
uz: kursivli matn

source: bold text
uz: qalin matn

source: strikethrough text
uz: shtrixli matn

source: Item
uz: Narsa (Ashyo)

source: Header
uz: Sarlavha

source: Quote
uz: Iqtibos

source: code
uz: kod

source: https://www.example.com
uz: https://www.misol.uz

source: link text
uz: havolat matni

source: image caption
uz: rasm sarlavhasi

source: Select an image
uz: Rasimni tanlang

source: code
uz: kod

source: web page
uz: veb sahifa
