Repository: uzbek-net/dictionary
Catalog: gnome/circle/citations.master.*.po
Languages: uz

source: Article
uz: Maqola

source: Book
uz: Kitob

source: Misc
uz: Aralashtirish

source: In Proceedings
uz: Ish jarayonida

source: Unpublished
uz: Chop etilmagan

source: Online
uz: Onlayn

source: Other
uz: Boshqa

source: Booklet
uz: Buklet

source: Conference
uz: Konferensiya

source: In Book
uz: Kitobda

source: In Collection
uz: Toʻplamda

source: Manual
uz: Qoʻllanma

source: Master's Thesis
uz: Magistrlik dissertatsiyasi

source: PhD Thesis
uz: PhD dissertatsiyasi

source: Proceedings
uz: Ish yurituvi

source: Tech Report
uz: Texnik hisobot

source: Plain
uz: Oddiy matn

source: Citations
uz: Iqtiboslar

source: Manage your bibliography
uz: Bibliografiyangizni boshqaring

source: bibliography;citing;literature;BibTeX;LaTeX;TeX;
uz: bibliografiya;iqtibos;adabiyotlar;BibTeX;LaTeX;TeX;

source: New Window
uz: Yangi oyna

source: Window width
uz: Oyna kengligi

source: Window height
uz: Deraza balandligi

source: Window maximized state
uz: Oynaning kattalashtirilgan holati

source: List of paths of recent files
uz: Deraza balandligi

source: Default template for book citation
uz: Kitob iqtibosi uchun standart shablon

source: Default template kind for citations
uz: Iqtiboslar uchun standart shablon turi

source: Default template format for citations
uz: Iqtiboslar uchun standart shablon formati

source: Manage your bibliographies using the BibTeX format.
uz: Bibliografiyalaringizni BibTeX formatida boshqaring.

source: Main window
uz: Asosiy oyna

source: Maximiliano Sandoval
uz: Maksimiliano Sandoval

source: Add PDF
uz: PDF qoʻshish

source: Bibliography folder not set
uz: Bibliografiya jildi sozlanmagan

source: Creates a copy of the selected pdf and stores it in your Bibliography folder.
uz: Tanlangan pdf faylning nusxasini yaratadi va Bibliografiya jildida saqlaydi.

source: Add From URL
uz: URL manzilidan kiritish

source: Download…
uz: Yuklab olish…

source: Add From File…
uz: Fayldan kiritish…

source: Custom Citation Format
uz: Maxsus iqtibos formati

source: Citation
uz: Iqtibos

source: Copy
uz: Nusxalash

source: Custom Template
uz: Maxsus andoza

source: Example:
uz: Misol:

source: No Citations
uz: Iqtiboslar yoʻq

source: Create a new citation
uz: Yangi iqtibos yaratish

source: _Open PDF
uz: PDF faylini ochish

source: _Copy Key
uz: Kalitdan nusxa olish

source: _Delete
uz: Olib tashlash

source: No Citation Selected
uz: Iqtibos tanlanmagan

source: Citation _Type
uz: Iqtibos Turi

source: _Other Citation Type
uz: Boshqa iqtibos turi

source: _Citation Key
uz: Iqtibos kaliti

source: _Author
uz: Muallif

source: _Title
uz: Sarlavha

source: _Year
uz: Yil

source: Open in Browser
uz: Brauzerda ochish

source: Other Properties
uz: Boshqa xususiyatlar

source: Abstract
uz: Mavhum

source: Copy Abstract
uz: Annotatsiyadan nusxa olish

source: Notes
uz: Izohlar

source: Copy Notes
uz: Qaydlarni nusxalash

source: _Open
uz: Ochish

source: Delete PDF
uz: PDF faylni oʻchirish

source: Could not set PDF Preview
uz: PDFʼni oldindan koʻrish sozlanmadi

source: Add new Entry
uz: Yangi yozuv kiritish

source: _Cancel
uz: Bekor qilish

source: C_reate
uz: Yaratish

source: New
uz: Yangi

source: Citation Key
uz: Iqtibos kaliti

source: Citation Type
uz: Iqtibos turi

source: From BibTeX
uz: BibTeXʼdan

source: From DOI
uz: DOI xizmatidan

# shortcut window
source: General
uz: Umumiy

# shortcut window
source: Show Shortcuts
uz: Yorliqlarni koʻrsatish

# shortcut window
source: New Window
uz: Yangi oyna

# shortcut window
source: Close Window
uz: Oynani yopish

# shortcut window
source: Quit
uz: Chiqish

# shortcut window
source: Bibliography
uz: Bibliografiya

# shortcut window
source: Open
uz: Ochish

# shortcut window
source: Save
uz: Saqlash

# shortcut window
source: Search
uz: Qidirish

source: _Create New Bibliography
uz: Yangi adabiyotlar roʻyxatini yaratish

source: _Keyboard Shortcuts
uz: Klaviatura yorliqlari

source: _About Citations
uz: Iqtiboslar haqida

source: _Save
uz: Saqlash

source: New _Window
uz: Yangi oyna

source: _Search in Google Scholar
uz: Google Scholar orqali qidirish

source: _Search in arXiv
uz: arXiv ichidan qidirish

source: Main Menu
uz: Asosiy menyu

source: Open a BibTeX File
uz: BibTeX faylini ochish

source: Or drag-and-drop a file
uz: Yoki faylni tortib tashlash

source: Manage your Citations
uz: Iqtiboslarni boshqarish

source: Recent Files
uz: Soʻnggi fayllar

source: Sidebar
uz: Yon panel

source: Add New Citation
uz: Yangi iqtibos kiritish

source: Search
uz: Qidirish

source: Search…
uz: Qidirish…

source: Content
uz: Tarkibi

source: Secondary Menu
uz: Ikkilamchi menyu

source: Could not set PDF
uz: PDF sozlanmadi

source: Could not download PDF
uz: PDF yuklab olinmadi

source: Make sure that {path} exists
uz: {path} mavjudligini tekshiring

source: PDF Files
uz: PDF fayllar

source: Select a PDF
uz: PDF faylni tanlash

source: Open a new window
uz: Yangi oyna oching

source: Enable debug messages
uz: Nosozliklarni tuzatish xabarlarini yoqish

source: Chicago
uz: Chikago

source: Harvard
uz: Garvard

source: Vancouver
uz: Vankuver

source: Custom
uz: Maxsus

source: Copied
uz: Nusxalangan

source: Custom…
uz: Maxsus…

source: Author not set
uz: Muallif koʻrsatilmagan

source: Title not set
uz: Sarlavha belgilanmagan

source: Other…
uz: Boshqa…

source: Citation Key already exists
uz: Havola kaliti allaqachon mavjud

source: Insert a BibTeX citation here
uz: Bu yerga BibTeX iqtibosini joylang

source: Author
uz: Muallif

source: Year
uz: Yil

source: Title
uz: Sarlavha

source: Volume
uz: Tovush

source: Number
uz: Raqam

source: Pages
uz: Sahifalar

source: Publisher
uz: Nashriyot

source: Journal
uz: Jurnal

source: Address
uz: Manzil

source: How Published
uz: Qanday chop etilgan

source: Note
uz: Eslatma

source: Book Title
uz: Kitob nomi

source: Series
uz: Seriya

source: Archive Prefix
uz: Arxivlash prefiksi

source: ePrint
uz: elektron bosma

source: Primary Class
uz: Boshlangʻich sinf

source: Month
uz: Oy

source: Editor
uz: Muharrir

source: Organization
uz: Tashkilot

source: School
uz: Maktab

source: Institution
uz: Muassasa

source: Could not add entry
uz: Yozuv kiritilmadi

source: BibTeX Files
uz: BibTeX fayllari

source: Create New Bibliography
uz: Yangi bibliografiya yaratish

source: _Create
uz: Yaratish

source: bibliography
uz: bibliografiya

source: An entry with the given citation key already exists
uz: Berilgan iqtibos kaliti bilan yozuv allaqachon mavjud

source: Bibliography saved
uz: Bibliografiya saqlandi

source: Citation Deleted
uz: Iqtibos oʻchirildi

source: Undo
uz: Bekor qilish

source: translator-credits
uz: BeMeritus <bemerituss@gmail.com> Baxrom Raxmatov

source: Unsaved Changes
uz: Saqlanmagan oʻzgarishlar

source: Do you want to write all changes to the safe?
uz: Barcha oʻzgarishlarni xavfsiz joyga yozishni xohlaysizmi?

source: _Quit Without Saving
uz: Saqlamasdan chiqish

source: _Don't Quit
uz: Chiqilmasin

source: _Save and Quit
uz: Saqlash va tark etish

source: Remove From Recent Files
uz: Oxirgi fayllardan olib tashlash
