Repository: uzbek-net/dictionary
Catalog: gnome/circle/Curtail.main.*.po
Languages: uz

source: Compress your images
uz: Rasmlaringizni zichlang

source: Optimize your images with Curtail, a useful image compressor that supports PNG, JPEG, WebP and SVG file types.
uz: Rasmlaringizni PNG, JPEG, WebP va SVG fayl turlarini qoʻllab-quvvatlaydigan Curtail yordamida optimallashtiring.

source: It supports both lossless and lossy compression modes with an option to whether keep or not metadata of images.
uz: Dastur tasvirlarning metama’lumotlarini saqlash yoki saqlamaslik tanlovini taqdim etgan holda, ma’lumot yoʻqotishsiz va ma’lumot yoʻqotish bilan zichlash rejimlarini qoʻllab-quvvatlaydi.

source: compress;optimize;image;photo;
uz: zichlash;optimallash;tasvir;foto;

source: Save into a new file
uz: Yangi faylga saqlash

source: Save the compressed image into a new file.
uz: Zichlangan rasmni yangi faylga saqlang.

source: Select the mode to append text for a new file
uz: Yangi faylga matn qoʻshish rejimini tanlang

source: Set how to append the additional text (as suffix or prefix) for a new file.
uz: Yangi fayl uchun qoʻshimcha matnni (soʻz boshi yoki soʻz oxiri sifatida) qanday qoʻshish kerakligini belgilang.

source: Enable recursive compression in folders
uz: Jildlarda rekursiv zichlashni yoqish

source: This setting enable compression in a recursive way in folders.
uz: Bu sozlama jildlarni rekursiv usulda zichlash imkonini beradi.

source: Preserve metadata
uz: Meta-axborotni saqlash

source: This setting preserves metadata of images.
uz: Bu sozlama rasmlarning metama’lumotlarini saqlaydi.

source: Preserve file permissions and timestamps if possible
uz: Imkon qadar fayl ruxsatlari va vaqt belgilarini saqlang

source: This setting file permissions and timestamps of images if possible.
uz: Bu sozlama imkon qadar fayl ruxsatlari va rasmlarning vaqt belgilarini beradi.

source: Enable lossy mode
uz: Yoʻqotishlar rejimini yoqish

source: Use lossy mode to compress images.
uz: Rasmlarni zichlash uchun yoʻqotish rejimidan foydalaning.

source: Suffix/Prefix to append at new file
uz: Yangi faylga qoʻshish uchun soʻz boshi/soʻz oxiri

source: Suffix/Prefix to append at new file.
uz: Yangi faylga qoʻshish uchun soʻz boshi/soʻz oxiri.

source: PNG Lossy Compression Level
uz: PNG yoʻqotishli zichlash darajasi

source: Lossy compression level to use for PNG images.
uz: PNG rasmlar uchun zichlash darajasini yoʻqotish.

source: PNG Lossless Compression Level
uz: PNG yoʻqotishlarsiz zichlash darajasi

source: Lossless compression level to use for PNG images.
uz: PNG rasmlar uchun foydalanish maqsadida zichlash darajasi yoʻqotishlarsiz.

source: JPG Lossy Compression Level
uz: JPG Yoʻqotilgan zichlash darajasi

source: Lossy compression level to use for JPG images.
uz: JPG rasmlar ustida foydalanish uchun zichlash darajasi past.

source: WebP Lossy Compression Level
uz: WebP ni zichlash darajasi

source: Lossy compression level to use for WebP images.
uz: WebP rasmlar uchun ishlatiladigan zichlash darajasi.

source: WebP Lossless Compression Level
uz: WebP yoʻqotishsiz zichlash darajasi

source: Lossless compression level to use for WebP images.
uz: WebP tasvirlar uchun zichlash darajasi yoʻqotishsiz.

source: Enable progressive encoding for JPEG images
uz: JPEG tasvirlar uchun progressiv kodlashni yoqish

source: Optionally encode jpeg images progressively.
uz: Ixtiyoriy ravishda jpeg rasmlarni progressiv kodlang.

source: Enable maximum compression for SVG images
uz: SVG rasmlarni maksimal zichlash funksiyasini yoqish

source: Enable maximum cleaning of SVG images.
uz: SVG rasmlarni maksimal tozalash funksiyasini yoqing.

source: Compression Timeout
uz: Zichlash vaqti tugadi

source: Compression timeout for each image.
uz: Har bir rasm uchun zichlash vaqti tugadi.

source: Preferences
uz: Afzalliklar

source: General
uz: Umumiy

source: Safe Mode
uz: Xavfsiz rejim

source: Save the compressed image in a new file
uz: Zichlangan rasmni yangi faylda saqlang

source: Naming Mode
uz: Nomlash rejimi

source: Select between suffix and prefix
uz: Soʻz boshi va soʻz oxiri qoʻshimchadan birini tanlang

source: Suffix
uz: Soʻz boshi

source: Prefix
uz: Soʻz oxiri

source: New File Suffix/Prefix
uz: Yangi fayl soʻz boshi/soʻz oxiri

source: Recursive Compression
uz: Rekursiv zichlash

source: Enable or disable compression through subdirectories
uz: Ichki kataloglar orqali zichlashni yoqish yoki faolsizlantirish

source: Keep Metadata
uz: Meta-axborotni saqlash

source: Keep metadata chunks that do not affect rendering
uz: Renderlashda ta’sir qilmaydigan meta-axborot boʻlaklarini saqlang

source: Keep File Attributes When Possible
uz: Imkon qadar fayl xususiyatlarini saqlang

source: Ensure the new file has the same permissions and timestamps as the original file
uz: Yangi fayl asl fayl bilan bir xil ruxsat va vaqt belgilariga ega boʻlishini tekshiring

source: Set the timeout between images
uz: Rasmlar orasidagi tanaffusni belgilang

source: Formats
uz: Formatlar

source: Lossy Compression
uz: Yoʻqotilgan zichlanish

source: Set the quality of the generated image, 100 is the best quality
uz: Yaratilgan tasvir sifatini oʻrnating, 100 - eng yaxshi sifat

source: Lossless Compression Level
uz: Yoʻqotishlarsiz zichlash darajasi

source: Set the level of the compression, 6 is the highest but slowest level
uz: Zichlash darajasini oʻrnating, 6 eng yuqori, lekin eng sekin darajadir

source: Progressive Encode
uz: Progressiv shifrlash

source: Enable incremental image rendering, going from blurry to clear
uz: Rasmni xiralashtirishdan tiniqlashtirishga oʻtish uchun qoʻshimcha renderlashni yoqing

source: Maximum Compression Level
uz: Eng yuqori zichlik darajasi

source: This can be more destructive for the image
uz: Bu tasvir uchun yanada halokatli boʻlishi mumkin

source: Bulk Compress Directory
uz: Hajmiy zichlangan direktoriya

source: Keyboard Shortcuts
uz: Tezkor tugmalar

source: About Curtail
uz: Curtail haqida

source: Browse Files
uz: Fayllarni koʻrish

source: Clear Results
uz: Natijalarni tozalash

source: Main Menu
uz: Asosiy menyu

source: _Change Mode
uz: Rejimni oʻzgartirish

source: Images will be overwritten, proceed carefully
uz: Eski rasmlar ustidan yangisi qoʻyiladi, ehtiyot boʻling

source: Drop images here to compress them
uz: Rasmlarni zichlash uchun ularni shu yerga tashlang

source: _Browse Files
uz: Fayllarni koʻrish

source: Lossless
uz: Zararsiz

source: Lossy
uz: Yoʻqotilgan

source: Compression has reached the configured timeout of {} seconds.
uz: Zichlash vaqti belgilangan {} soniyaga yetdi.

source: An unknown error has occurred
uz: Noma’lum xatolik yuz berdi

source: Can't find the compressed file
uz: Zichlangan fayl topilmadi

source: All images
uz: Barcha rasmlar

source: PNG images
uz: PNG rasmlar

source: JPEG images
uz: JPEG rasmlar

source: WebP images
uz: WebP rasmlar

source: SVG images
uz: SVG rasmlar

source: Version not found
uz: Versiya topilmadi

source: Skipped
uz: Tashlab ketildi

source: More Information
uz: Batafsil

source: Compression was skipped because compressing the file would have resulted in a larger file size.
uz: Faylni zichlash tashlab ketildi, chunki faylni zichlash natijasida fayl hajmi kattalashgan boʻlar edi.

source: Open Image
uz: Rasmni ochish

source: Show in Folder
uz: Jildda koʻrsatish

source: Overwrite mode
uz: Ustidan yozish usuli

source: Browse Directories
uz: Direktoriyalarni koʻrish

source: Are you sure you want to compress images in these directories?
uz: Haqiqatan ham bu kataloglardagi rasmlarni zichlamoqchimisiz?

source: All of the images in the directories selected and their subdirectories will be compressed. The original images will not be modified.
uz: Belgilangan direktoriyalar va ularning quyi direktoriyalaridagi barcha rasmlar zichlashtiriladi. Asl rasmlar oʻzgarmaydi.

source: All of the images in the directories selected and their subdirectories will be compressed and overwritten!
uz: Tanlangan direktoriyalar va ularning quyi direktoriyalaridagi barcha rasmlar zichlanadi va ustidan yoziladi!

source: Cancel
uz: Bekor qilish

source: Compress
uz: Zichlamoq

source: Format of this file is not supported.
uz: Bu fayl formati qoʻllab-quvvatlanmaydi.

source: No files found
uz: Hech qanday fayllar topilmadi

source: translator-credits
uz: Hamidulloh Toʻxtayev <toxtayevhamidulloh6997@gmail.com>

source: Contributors
uz: Hissa qoʻshuvchilar
