Repository: uzbek-net/dictionary
Catalog: gnome/circle/elastic.main.*.po
Languages: uz

source: Elastic
uz: Elastik

source: Design spring animations
uz: Prujina animatsiyalarini loyihalash

source: spring;animation;animations;GNOME;GTK;Adwaita;
uz: prujina;animatsiya;animatsiyalar;GNOME;GTK;Adwaita;

source: Use Damping
uz: Amortizatsiyalashdan foydalanish

source: Whether to use damping instead of damping ratio.
uz: Amortizatsiya koeffitsiyentidan foydalanish oʻrniga toʻgʻridan-toʻgʻri amortizatsiyadan foydalanish.

source: Last Language
uz: Oxirgi til

source: Last selected language.
uz: Oxirgi tanlangan til.

source: Elastic allows to design and export spring physics-based animations to use with libadwaita.
uz: Elastic libadwaita bilan foydalanish uchun prujina fizikasiga asoslangan animatsiyalarni loyihalash va eksport qilish imkonini beradi.

source: Features:
uz: Xususiyatlar:

source: Preview translation, rotation and scaling transformations.
uz: Tarjima, aylanish va masshtab oʻzgartirishlari.

source: See the animation curve and duration on a graph.
uz: Grafikdagi animatsiya egri chizigʻi va davomiyligini koʻring.

source: Drag a handle to see it return back with the spring physics.
uz: Tutqichni torting va u prujina qonuniyatlari asosida oʻz holatiga qaytayotganini kuzating.

source: Export C, JavaScript, Python, Vala or Rust code.
uz: C, JavaScript, Python, Vala yoki Rust kodini eksport qilish.

source: Initial screen
uz: Dastlabki ekran

source: Animation graph
uz: Animatsiya grafigi

source: Interactive preview
uz: Interaktiv oldindan koʻrish

source: Code export
uz: Kodni eksport qilish

source: translator-credits
uz: Hamidulloh Toʻxtayev <toxtayevhamidulloh6997@gmail.com>

source: Initial Velocity
uz: Boshlangʻich tezlik

source: Information About Initial Velocity
uz: Boshlangʻich tezlik haqida ma’lumot

source: Initial velocity affects the beginning of the animation curve without changing duration. This is useful when finishing gestures with an animation, or to make it bounce more in either direction.
uz: Boshlangʻich tezlik animatsiya egri chizigʻining boshlanishiga ta’sir koʻrsatadi, lekin uning davomiyligini oʻzgartirmaydi. Bu xususiyat imo-ishoralarni animatsiya bilan yakunlashda yoki harakatni har ikki yoʻnalishda koʻproq sakratishda foydali hisoblanadi.

source: Toggle Graph
uz: Grafikni yoqish/oʻchirish

source: Run Animation
uz: Animatsiyani ishga tushirish

source: _Copy Snippet
uz: Parchani nusxalash

source: Min: %.2lf
uz: Minimum: %.2lf

source: Max: %.2lf
uz: Maksimum: %.2lf

source: Duration: %.0lf ms
uz: Davomiyligi: %.0lf ms

source: Damping determines how much the spring oscillates. Damping ratio is a more convenient parameter adjusted to behave the same way regardless of mass and stiffness, and most of the time it’s easier to work with. If you need to import values from another framework that uses damping, you can switch to damping instead.
uz: Amortizatsiya prujinaning qanchalik tebranishini belgilaydi. Amortizatsiyalash koeffitsiyenti massa va qattiqlikdan qat’i nazar, oʻzini bir xil tutish uchun sozlangan qulayroq parametr boʻlib, koʻpincha u bilan ishlash osonroq boʻladi. Agar siz amortizatsiyalashdan foydalanadigan boshqa freymvorkdan qiymatlarni import qilishingiz kerak boʻlsa, uning oʻrniga amortizatsiyalashga oʻtishingiz mumkin.

source: Prefer damping instead of damping ratio
uz: Amortizatsiya koeffitsiyenti oʻrniga amortizatsiyani afzal koʻring

source: Damping
uz: Amortizatsiyalash

source: Information About Damping
uz: Amortizatsiya haqida ma’lumot

source: How much the spring oscillates. Set it to the marked value to bring the spring to rest as soon as possible with no oscillation, lower values to create oscillation, higher values to slow the spring down.
uz: Prujina qanchalar tebranadi. Prujinani iloji boricha tezroq tebranishsiz tinch holatga keltirish uchun belgilangan qiymatga, tebranish hosil qilish uchun pastroq qiymatlarga, prujinani sekinlashtirish uchun yuqori qiymatlarga qoʻying.

source: Damping Ratio
uz: Amortizatsiya koeffitsiyenti

source: Information About Damping Ratio
uz: Amortizatsiya darajasi haqida ma’lumot

source: How much the spring oscillates. Set it to 1 to bring the spring to rest as soon as possible with no oscillation, lower values to create oscillation, higher values to slow the spring down.
uz: Prujina qanchalar tebranadi. Prujinani hech qanday tebranishlarsiz iloji boricha tezroq tinch holatga keltirish uchun uni 1 ga, tebranish hosil qilish uchun kichik qiymatlarni, prujinani sekinlashtirish uchun yuqori qiymatlarni oʻrnating.

source: Mass
uz: Massa

source: Information About Mass
uz: Massa haqida ma’lumot

source: The mass of the attached object. The higher the mass is, the longer the spring takes to stop.
uz: Biriktirilgan jismning massasi. Massa qancha yuqori boʻlsa, prujinaning toʻxtashi shuncha uzoq davom etadi.

source: Stiffness
uz: Qattiqlik

source: Information About Stiffness
uz: Qattiqlik haqida ma’lumot

source: The stiffness of the spring. The higher the stiffness is, the faster the spring contracts.
uz: Prujinaning qattiqligi. Qattiqlik qanchalik yuqori boʻlsa, prujina shuncha tezroq qisqaradi.

source: Information About Epsilon
uz: Epsilon haqida ma’lumot

source: Determines when to stop the simulation. This value should be large enough that the animation doesn’t last too long, but small enough that there’s no visible jump at the end.
uz: Simulyatsiyani qachon toʻxtatishni aniqlaydi. Bu qiymat animatsiya juda uzoq davom etmasligi uchun yetarlicha katta, lekin oxirida koʻrinadigan sakrash boʻlmasligi uchun yetarlicha kichik boʻlishi kerak.

source: General
uz: Umumiy

source: Open Menu
uz: Menyuni ochish

source: Show Preferences
uz: Afzalliklarni koʻrsatish

source: Show Shortcuts
uz: Yorliqlarni koʻrsatish

source: Close Current Window
uz: Joriy oynani yopish

source: Quit App
uz: Ilovadan chiqish

source: Editor
uz: Tahrirchi

source: Basic View
uz: Asosiy koʻrinish

source: Interactive View
uz: Interaktiv koʻrinish

source: Copy Snippet
uz: Parchani nusxalash

source: Reset to Defaults
uz: Asliga qaytarish

source: _Reset
uz: Asliga qaytarish

source: Main Menu
uz: Asosiy menyu

source: Basic
uz: Asosiy

source: Interactive
uz: Interaktiv

source: _Preferences
uz: Afzalliklar

source: _Keyboard Shortcuts
uz: Klaviatura yorliqlari

source: _About Elastic
uz: Elastik haqida

source: Copied to clipboard
uz: Buferga nusxalandi
