Repository: uzbek-net/dictionary
Catalog: gnome/circle/emblem.master.*.po
Languages: uz

source: Generate project avatars
uz: Loyiha avatarlarini yaratish

source: logo;
uz: logotip;

source: Generate projects avatars for your Matrix rooms and git forges from a symbolic icon.
uz: Matrix xonalaringiz va git platformalaringiz uchun ramziy belgilardan loyiha avatarlarini yarating.

source: Main window
uz: Asosiy oyna

source: Preview
uz: Oldindan koʻrish

source: Export as PNG
uz: PNG sifatida eksport qilish

source: Export as SVG
uz: SVG sifatida eksport qilish

source: _Save Favicons…
uz: Favikonlarni saqlash…

source: _Keyboard Shortcuts
uz: Klaviatura yorliqlari

source: _About Emblem
uz: Emblema haqida

source: Main Menu
uz: Asosiy menyu

source: _Auto
uz: Avtomatik

source: _Light
uz: Yorugʻ

source: _Dark
uz: Qorongʻi

source: C_ircle
uz: Aylana

source: S_quare
uz: Kvadrat

source: Choose _Symbolic…
uz: Ramziy belgini tanlang

source: _Color
uz: Rang

source: Set Color
uz: Rangni sozlash

source: Set Top Gradient Color
uz: Yuqori gradiyent rangini sozlash

source: Set Bottom Gradient Color
uz: Pastki gradiyent rangini sozlash

# shortcut window
source: General
uz: Umumiy

# shortcut window
source: Show Shortcuts
uz: Yorliqlarni koʻrsatish

# shortcut window
source: Close Window
uz: Oynani yopish

# shortcut window
source: Quit
uz: Chiqish

# shortcut window
source: Main Menu
uz: Asosiy menyu

# shortcut window
source: Save PNG
uz: PNGʼni saqlash

# shortcut window
source: Save SVG
uz: SVGʼni saqlash

# shortcut window
source: Generate Favicons
uz: Favikonlar yaratish

source: translator-credits
uz: BeMeritus <bemerituss@gmail.com> Baxrom Raxmatov

source: Save PNG
uz: PNGʼni saqlash

source: logo.png
uz: logotip.png

source: Save SVG
uz: SVGʼni saqlash

source: logo.svg
uz: logotip.svg

source: SVG images
uz: SVG rasmlar

source: Select Symbolic
uz: Ramziy belgini tanlang
