Repository: uzbek-net/dictionary
Catalog: gnome/circle/fragments.main.*.po
Languages: uz

source: Manage torrents
uz: Torrentlarni boshqarish

source: An easy to use BitTorrent client. Fragments can be used to transfer files via the BitTorrent peer-to-peer file-sharing protocol, such as videos, music or installation images for Linux distributions.
uz: Foydalanish oson boʻlgan BitTorrent dasturi. Fragment dasturi yordamida BitTorrent peer-to-peer fayl almashish protokoli orqali videolar, musiqa yoki Linux tizimlarining oʻrnatish tasvirlari kabi fayllarni uzatish mumkin.

source: Overview of all torrents grouped by status
uz: Status asosida guruhlangan barcha torrentlar haqida umumiy ma’lumot

source: Schedule the order of downloads with a queue
uz: Yuklab olishlar tartibini navbat bilan rejalashtirish

source: Automatic detection of torrent or magnet links from the clipboard
uz: Buferdan torrent yoki magnet havolalarini avtomatik aniqlash

source: Manage and access individual files of a torrent
uz: Torrentning alohida fayllarini boshqarish va ularga kirish

source: Connect to remote Fragments or Transmission sessions
uz: Masofaviy Fragments yoki Transmission seanslariga ulanish

source: Fragments uses the Transmission BitTorrent project under the hood.
uz: Fragments kapot ostida Transmission BitTorrent loyihasidan foydalanadi.

source: Add Remote Connection
uz: Masofaviy ulanishni qoʻshish

source: Cancel
uz: Bekor qilish

source: _Connect
uz: Ulanish

source: Enter the address of a remote Fragments or Transmission session to connect to.
uz: Ulanish uchun masofaviy Fragments yoki Transmission seansi manzilini kiriting.

source: Name
uz: Ism

source: Host
uz: Xost

source: Advanced Settings
uz: Kengaytirilgan sozlamalar

source: URL Path
uz: URL manzili

source: Preferences
uz: Afzalliklar

source: Resume Torrents
uz: Torrentlarni davom ettirish

source: Get Some Torrents
uz: Ba’zi torrentlarni olish

source: Click a torrent link on a website
uz: Veb sahifadagi torrent linklarini bosish

source: Copy a torrent link to the clipboard
uz: Torrent havolasini bufer nusxalash

source: Choose a torrent file
uz: Torrent faylini tanlang

source: Drag and drop a torrent
uz: Torrentni torting va tashlang

source: Authentication required
uz: Autentifikatsiya talab qilinadi

source: Username
uz: Foydalanuvchi ismi

source: Password
uz: Parol

source: Authenticate
uz: Haqiqiylikni tasdiqlash

source: Connection error
uz: Ulanish xatosi

source: Try Again
uz: Qayta urining

source: Remove connection
uz: Ulanishni olib tashlash

source: Open
uz: Oching

source: Open Containing Folder
uz: Oʻz ichiga olgan jildni oching

source: Download
uz: Yuklash

source: File progress
uz: Fayl jarayoni

source: Sorting
uz: Saralash

source: Search
uz: Qidirish

source: Search for files…
uz: Fayllarni qidirish…

source: Search files
uz: Fayllarni qidirish

source: Select A_ll
uz: Hammasini tanlash

source: D_eselect All
uz: Hammasini bekor qilish

source: _Default
uz: Standart

source: _Name
uz: Ism

source: _Size
uz: Hajmi

source: _Ascending
uz: Koʻpayishi boʻyicha

source: _Descending
uz: Kamayishi boʻyicha

source: _Folders Before Files
uz: Fayldan oldingi jildlar

source: General
uz: Umumiy

source: Behavior
uz: Xulq-atvor

source: Inhibit _Suspend
uz: Toʻxtatish

source: Prevent the computer from suspending while torrents are being downloaded
uz: Torrentlar yuklab olinayotganda kompyuterning pauza qilinishiga yoʻl qoʻymang

source: _Trash Torrent Files
uz: Chiqindi torrent fayllari

source: Automatically moves torrent files to the trash after adding them
uz: Torrent fayllarini qoʻshgandan keyin ularni avtomatik ravishda chiqindiga tashlaydi

source: Notifications
uz: Bildirishnomalar

source: _New Torrent Added
uz: Yangi torrent qoʻshildi

source: _Torrent Completely Downloaded
uz: Torrent toʻliq yuklab olindi

source: Remote Control
uz: Masofadan boshqarish

source: Remote Access
uz: Masofadan kirish

source: Allow other devices on the local network to access the local Fragments session
uz: Mahalliy tarmoqdagi boshqa qurilmalarga mahalliy Fragments seansiga kirishga ruxsat berish

source: Open Web Interface
uz: Ochiq veb interfeys

# A page title of the preferences dialog
source: Downloading
uz: Yuklab olinmoqda

source: These settings apply to the remote connection
uz: Bu sozlamalar masofaviy ulanish uchun amal qiladi

source: Location
uz: Joylashuv

source: _Download Directory
uz: Yuklab olish katalogi

source: Where to store downloaded torrents
uz: Yuklab olingan torrentlarni qayerda saqlash mumkin

source: _Incomplete Torrents
uz: Toʻliq boʻlmagan torrentlar

source: Store incomplete torrents in a different directory
uz: Toʻliq boʻlmagan torrentlarni boshqa katalogda saqlash

source: _Incomplete Directory
uz: Toʻliq boʻlmagan katalog

source: Where to store incomplete torrents
uz: Toʻliq boʻlmagan oqimlarni qayerda saqlash mumkin

source: Queue
uz: Navbat

source: Download Queue
uz: Yuklab olish navbati

source: You can decide which torrents should be downloaded first
uz: Qaysi torrentlarni birinchi yuklab olishni oʻzingiz hal qilishingiz mumkin

source: Maximum _Active Downloads
uz: Maksimal faol yuklanmalar

source: Number of maximum parallel downloads at the same time
uz: Bir vaqtda maksimal parallel yuklab olishlar soni

source: Automatically _Start Torrents
uz: Torrentlarni avtomatik ishga tushirish

source: Automatically start downloading torrents after adding them
uz: Torrentlarni qoʻshganingizdan soʻng ularni avtomatik ravishda yuklab olishni boshlash

source: Network
uz: Tarmoq

source: Listening Port
uz: Tinglash porti

source: This port gets used by peers on the internet to connect to you. It's important that the communication works, otherwise you will have a limited ability to connect to other peers and suffer from slower download speeds.
uz: Bu port internetdagi tengdoshlaringiz tomonidan sizga ulanish uchun ishlatiladi. Aloqa ishlashi muhim, aks holda siz boshqa tengdoshlar bilan bogʻlanish uchun cheklangan imkoniyatga ega boʻlasiz va pastroq yuklab olish tezligidan aziyat chekasiz.

source: Used for incoming connections
uz: Kiruvchi ulanishlar uchun ishlatiladi

source: _Random Port
uz: Tasodifiy port

source: Select a random port on each session startup, can improve privacy
uz: Har bir seans boshlanishida tasodifiy port tanlash maxfiylikni oshirishi mumkin

source: Port _Forwarding
uz: Port yoʻnaltirish

source: Try using UPnP/NAT-PMP for automatic port forwarding on your router
uz: Routeringizda portni avtomatik uzatish uchun UPnP/NAT-PMP ishlating

source: Computer
uz: Kompyuter

source: You can verify your connection by asking <a href="https://transmissionbt.com">transmissionbt.com</a> to test connecting to your computer as peers would.
uz: Kompyuterga ulanishni tengdoshlar kabi tekshirish uchun <a href="https://transmissionbt.com">transmissionbt.com</a> yuborish orqali ulanishingizni tasdiqlashingiz mumkin.

source: Peer Limits
uz: Tengdoshlar uchun cheklovlar

source: You may have to lower the limits if your router can't keep up with the demands of P2P.
uz: Agar router P2P talablariga javob bermasa, cheklovlarni pasaytirishingiz kerak boʻlishi mumkin.

source: Maximum Peers per _Torrent
uz: Har bir torrent uchun maksimal tengdoshlar

source: Maximum Peers _Overall
uz: Jami maksimal tengdoshlar

source: Connection Encryption Mode
uz: Ulanishni shifrlash rejimi

source: <a href="https://en.wikipedia.org/wiki/BitTorrent_protocol_encryption">BitTorrent Protocol Encryption</a> can be used to improve privacy. It also can help to bypass ISP filters.
uz: Maxfiylikni yaxshilash uchun <a href="https://en.wikipedia.org/wiki/BitTorrent_protocol_encryption">BitTorrent protokolini shifrlash</a> ishlatilishi mumkin. Shuningdek, u ISP filtrlarini chetlab oʻtishga yordam beradi.

source: _Encryption
uz: Shifrlash

source: Force
uz: Kuch

source: Prefer
uz: Afzal koʻrmoq

source: Allow
uz: Ruxsat berish

# shortcut window
source: General
uz: Umumiy

# shortcut window
source: Show Shortcuts
uz: Yorliqlarni koʻrsatish

# shortcut window
source: Preferences
uz: Afzalliklar

# shortcut window
source: Quit
uz: Chiqish

# shortcut window
source: Torrents
uz: Torrentlar

# shortcut window
source: Add New Torrent
uz: Yangi torrent qoʻshish

# shortcut window
source: Search
uz: Qidirish

source: Statistics
uz: Statistika

source: These statistics are from the remote connection
uz: Bu statistika masofaviy ulanishdan olingan

source: Transmission Daemon
uz: Uzatish demoni

source: Version
uz: Versiya

source: Current Network Speed
uz: Joriy tarmoq tezligi

source: Download Speed
uz: Yuklab olish tezligi

source: Upload Speed
uz: Yuklash tezligi

source: Torrent Count
uz: Torrentlar soni

source: Total
uz: Jami

source: Active
uz: Aktiv

source: Paused
uz: Toʻxtatildi

source: Downloaded
uz: Yuklab olindi

source: Usage
uz: Foydalanish

source: This Session
uz: Bu seans

source: Time Active
uz: Faol vaqt

source: Uploaded
uz: Yuklandi

source: Added Files
uz: Qoʻshilgan fayllar

source: Started
uz: Boshlandi

source: Torrent Details
uz: Torrent tafsilotlari

source: Overview
uz: Qisqacha

source: Pause
uz: Pauza

source: Continue
uz: Davom etish

source: Remove
uz: Olib tashlang

source: More
uz: Koʻproq

source: A Problem Has Occurred
uz: Muammo yuz berdi

source: Peers
uz: Tengdoshlar

source: Receiving Files Metadata…
uz: Fayllar meta-axboroti olinmoqda…

source: _Pause
uz: Pauza

source: _Continue
uz: Davom etish

source: Queue Move _Up
uz: Navbat yuqoriga

source: Queue Move _Down
uz: Navbatni pastga

source: _Open
uz: Oching

source: _Remove
uz: Olib tashlash

source: _More
uz: Koʻproq

source: Set _Location…
uz: Joylashuvni belgilash…

source: _Verify Local Data
uz: Mahalliy ma’lumotlarni tasdiqlash

source: _Ask Tracker for More Peers
uz: Koʻproq tengdoshlar uchun Trekerdan soʻrash

source: _Properties
uz: Xususiyatlar

# The title of a group of torrents (downloading/queued/seeding)
source: Downloading
uz: Yuklab olinmoqda

# The title of a group of torrents (downloading/queued/seeding)
source: Queued
uz: Navbatda

source: Stopped
uz: Toʻxtatildi

source: Downloading
uz: Yuklab olinmoqda

source: Uploading
uz: Yuklanmoqda

source: Torrent progress
uz: Torrent jarayoni

source: Delete
uz: Oʻchirish

source: Queue – Move up
uz: Navbat yuqoriga

source: Queue – Move down
uz: Navbatni pastga

source: Add New Torrent
uz: Yangi torrent qoʻshish

source: Main Menu
uz: Asosiy menyu

source: Remote Connection Menu
uz: Masofaviy ulanish menyusi

source: Search torrents…
uz: Torrentlarni qidirish…

source: Search torrents
uz: Torrentlarni qidirish

source: _Resume All
uz: Hammasini davom ettirish

source: _Pause All
uz: Hammasini toʻxtatish

source: _Remove Completed Torrents
uz: Tugallangan torrentlarni olib tashlash

source: _Statistics…
uz: Statistika…

source: _Add Remote Connection…
uz: Masofaviy ulanishni qoʻshish…

source: _Preferences
uz: Afzalliklar

source: _Keyboard Shortcuts
uz: Klaviatura yorliqlari

source: _About Fragments
uz: Fragmentlar haqida

source: Unable to copy magnet link to clipboard
uz: Magnit havolasidan vaqtinchalik xotiraga nusxa olinmadi

source: Copied magnet link to clipboard
uz: Vaqtincha xotiraga magnit havolasi nusxalandi

source: Remove Torrent?
uz: Torrent olib tashlansinmi?

source: Once removed, continuing the transfer will require the torrent file or magnet link.
uz: Olib tashlangach, uzatishni davom ettirish uchun torrent fayli yoki magnit ulanish kerak boʻladi.

source: _Cancel
uz: Bekor qilish

source: Remove downloaded data as well
uz: Yuklab olingan ma’lumotlarni ham olib tashlash

source: Set Torrent Location
uz: Torrent joylashuvini belgilash

source: _Select
uz: Tanlash

source: Move Data?
uz: Ma’lumotlar koʻchirilsinmi?

source: In order to continue using the torrent, the data must be available at the new location.
uz: Torrentdan foydalanishni davom ettirish uchun ma’lumotlar yangi joyda mavjud boʻlishi kerak.

source: _Only Change Location
uz: Faqat joylashuvni oʻzgartirish

source: _Move Data to New Location
uz: Ma’lumotlarni yangi joyga koʻchirish

source: Unable to open file / folder
uz: Fayl / jild ochilmadi

source: Could not open file
uz: Fayl ochilmadi

source: Downloading data…
uz: Ma’lumotlar yuklab olinmoqda…

source: Unsupported file format
uz: Fayl formati qabul qilinmaydi

source: Open Torrents
uz: Torrentlarni ochish

source: Torrent files
uz: Torrent fayllari

source: All files
uz: Barcha fayllar

source: Remove all Downloaded Torrents?
uz: Barcha yuklab olingan torrentlar olib tashlansinmi?

source: This will only remove torrents from Fragments, but will keep the downloaded content.
uz: Bunda faqat Fragmentsdan torrentlar olib tashlanadi, lekin yuklab olingan kontent saqlanadi.

source: Local Fragments session
uz: Lokal fragmentlar seansi

source: Unable to stop transmission-daemon
uz: Demon translatsiyasini toʻxtatib boʻlmadi

source: Unable to start transmission-daemon
uz: Demon translatsiyasini ishga tushirib boʻlmadi

source: translator-credits
uz: BeMeritus <bemerituss@gmail.com> Baxrom Raxmatov

source: Donate
uz: Xayriya qilmoq

source: Could not connect with “{}”: {}
uz: "{}" bilan ulanilmadi: {}

source: The configured download directory cannot be accessed.
uz: Sozlangan yuklab olish katalogiga kirish imkonsiz.

source: The configured incomplete directory cannot be accessed.
uz: Sozlangan toʻliq boʻlmagan katalogga kirish imkonsiz.

source: Connection with {} was lost.
uz: {} bilan aloqa uzildi.

source: Credentials could not be saved
uz: Hisob ma’lumotlari saqlanmadi

source: No connection found with UUID "{}"
uz: UUID "{}" bilan hech qanday aloqa topilmadi

source: Failed to establish a connection with the Transmission service (“{}”).
uz: Uzatish xizmati ("{}") bilan aloqa oʻrnatib boʻlmadi.

source: This computer
uz: Bu kompyuter

source: {} / {}, {} item
uz: {} / {}, {} ta element

source: {}, {} item
uz: {}, {} ta element

source: Unable to restart Transmission daemon
uz: Uzatish demoni qayta ishga tushmadi

source: Testing…
uz: Tekshirilmoqda…

source: Port is open. You can communicate with other peers.
uz: Port ochiq. Boshqa tengdoshlaringiz bilan muloqot qilishingiz mumkin.

source: Port is closed. Communication with other peers is limited. Check your router or firewall if port forwarding is enabled for your computer.
uz: Port yopiq. Boshqa tengdoshlar bilan muloqot qilish cheklangan. Kompyuteringizda portni uzatish funksiyasi yoqilgan boʻlsa, marshrutizator yoki tarmoqlararo ekranni tekshiring.

source: Test failed. Make sure you are connected to the internet.
uz: Tekshirilmadi. Internetga ulanganingizga ishonch hosil qiling.

source: You are connected with “{}”
uz: Siz "{}" bilan bogʻlangansiz

source: {} time
uz: {} marta

source: {} ({} active)
uz: {} ({} ta faol)

source: {} uploaded · {}
uz: {} yuklandi · {}

source: Remote control "{}"
uz: Masofaviy boshqaruv paneli "{}"

source: New torrent added
uz: Yangi torrent kiritildi

source: Torrent completely downloaded
uz: Torrent toʻliq yuklab olindi

source: Add magnet link “{}” from clipboard?
uz: Vaqtincha xotiradan "{}" magnit havolasi kiritilsinmi?

source: Add magnet link from clipboard?
uz: Vaqtincha xotiradan magnit havolasi kiritilsinmi?

source: _Add
uz: Qoʻshish

source: Add torrent from “{}”?
uz: "{}" tormenti qoʻshilsinmi?

source: Add “{}” from clipboard?
uz: Vaqtincha xotiradan "{}" qoʻshilsinmi?

source: more than a day
uz: bir kundan ortiq

source: {} day
uz: {} kun

source: {} minute
uz: {} daqiqa

source: {} second
uz: {} soniya

source: Queued
uz: Navbatda turgan

source: Checking…
uz: Tekshirilmoqda…

source: Select Download Directory
uz: Yuklab olish katalogini tanlang

source: Select Incomplete Directory
uz: Toʻliq boʻlmagan katalogni tanlang
