Repository: uzbek-net/dictionary
Catalog: gnome/circle/hieroglyphic.main.*.po
Languages: uz

source: Hieroglyphic
uz: Iyeroglifik

source: Search through over 1000 different LaTeX symbols by sketching
uz: Chizma orqali 1000 dan ortiq turli Latex belgilarini eskizlash

source: GTK;Tools;LaTeX;TeX;Symbols;
uz: GTK;Asboblar;LaTeX;TeX;Belgilar;

source: Whether to contribute recognized strokes
uz: Aniqlangan shtrixlarga hissa qoʻshish/qoʻshmaslik

source: Placeholder
uz: Toʻldirgich

source: Improve Hieroglyphic
uz: Iyeroglifni yaxshilash

source: Help make Hieroglyphic better at identifying symbols for everyone
uz: Iyeroglifik yozish uslubini aniqlash qobiliyatini hamma uchun yaxshilashga oʻz hissangizni qoʻshing

source: Contribute Symbols
uz: Hissa qoʻshish belgilari

source: Submit recognized drawings to Hieroglyphic’s dataset
uz: Tanilgan chizmalarni Iyeroglifik ma’lumotlar toʻplamiga yuborish

source: No personal identifiable information is collected. <a href="https://github.com/FineFindus/Hieroglyphic/blob/main/PRIVACY_POLICY.md">Privacy policy</a>
uz: Shaxsni tasdiqlovchi ma’lumotlar olinmaydi. <a href="https://github.com/FineFindus/Hieroglyphic/blob/main/PRIVACY_POLICY.md">Maxfiylik siyosati</a>

source: Copy
uz: Nusxalash

source: About Hieroglyphic
uz: Iyeroglif haqida

source: No Symbols
uz: Hech qanday belgi topilmadi

source: Start by drawing a symbol
uz: Belgi chizishdan boshlang

source: All Symbols
uz: Barcha belgilar

source: _Clear
uz: Tozalash

source: translator-credits
uz: Hamidulloh Toʻxtayev <toxtayevhamidulloh6997@gmail.com>

source: Copied “{}”
uz: Nusxalangan "{}"
