Repository: uzbek-net/dictionary
Catalog: gnome/circle/obfuscate.master.*.po
Languages: uz

source: Censor private information
uz: Maxfiy axborotni senzura qilish

source: Censor;Private;Image;Obfuscate;
uz: Senzor;Shaxsiy;Rasm;Xiralashtirish;

source: New Window
uz: Yangi oyna

source: Default window maximized behaviour
uz: Oynaning standart maksimal holatdagi xususiyati

source: Obfuscate lets you redact your private information from any image.
uz: Obfuscate sizga har qanday rasmdan shaxsiy ma’lumotlaringizni tahrirlash imkonini beradi.

source: Main Window
uz: Asosiy oyna

# shortcut window
source: General
uz: Umumiy

# shortcut window
source: Open a New Window
uz: Yangi oyna ochish

# shortcut window
source: Open a File
uz: Fayl ochish

# shortcut window
source: Load Image from Clipboard
uz: Rasmni buferdan yuklash

# shortcut window
source: Copy Image to Clipboard
uz: Rasmni buferga nusxalash

# shortcut window
source: Save As
uz: Saqlash

# shortcut window
source: Show Shortcuts
uz: Yorliqlarni koʻrsatish

# shortcut window
source: Close the Active Window
uz: Faol oynani yopish

# shortcut window
source: Editor
uz: Tahrirchi

# shortcut window
source: Undo
uz: Bekor qilish

# shortcut window
source: Zoom In
uz: Yaqinlashtirish

# shortcut window
source: Zoom Out
uz: Uzoqlashtirish

source: _Copy
uz: Nusxa olish

source: _Save
uz: Saqlash

source: _Open File
uz: Fayl ochish

source: _New Window
uz: Yangi oyna

source: _Keyboard Shortcuts
uz: Klaviatura yorliqlari

source: _About Obfuscate
uz: Obfuscate haqida

source: Zoom out
uz: Uzoqlashtirish

source: Reset Zoom
uz: Masshtabni asliga qaytarish

source: Zoom in
uz: Yaqinlashtirish

source: Select a File
uz: Fayl tanlash

source: Open
uz: Ochish

source: Main Menu
uz: Asosiy menyu

source: Drop an Image Here
uz: Rasmni shu yerga tashlash

source: Undo
uz: Bekor qilish

source: Redo
uz: Qayta qilish

source: Fill
uz: Toʻldirish

source: Blur
uz: Xiralashtirish

source: Open a new window
uz: Yangi oyna ochish

source: translator-credits
uz: Maftuna Vahidjanova

source: Save Changes?
uz: Oʻzgarishlarni saqlash?

source: Open image contain unsaved changes. Changes which are not saved will be permanently lost
uz: Ochiq rasmda saqlanmagan oʻzgarishlar mavjud. Saqlanmagan oʻzgarishlar butunlay oʻchib ketadi

source: Cancel
uz: Bekor qilish

source: Discard
uz: Tashlash

source: Save
uz: Saqlash

source: The blur tool is not secure. Please do not use it to share sensitive information in a public forum
uz: Xiralashtirish vositasi xavfsiz emas. Undan ommaviy forumda maxfiy axborotlarni ulashish uchun foydalanmang

source: Save File
uz: Fayl saqlash

source: All Images
uz: Barcha rasmlar

source: Open File
uz: Fayl ochish
