Repository: uzbek-net/dictionary
Catalog: gnome/circle/podcasts.main.*.po
Languages: uz

source: Episodes:
uz: Epizodlar:

source: Last publication
uz: Oxirgi nashr

source: _Subscribe
uz: Obuna boʻlish

source: Subscribing to feed…
uz: Tasmaga obuna qilinmoqda...

source: Add Podcasts
uz: Podkastlar qoʻshish

source: Search
uz: Qidirish

source: Enter a feed URL or search the selected platforms.
uz: Tasma URL manzilini kiriting yoki tanlangan platformalarni qidiring.

source: Submit search
uz: Qidiruvni joʻnatish

source: Loading…
uz: Yuklanmoqda…

source: Please enable a Search Platform below, or enter a http(s) feed URL.
uz: Quyida Qidiruv platformasini yoqing yoki http(s) tasmasi URL manzilini kiriting.

source: Search Platforms
uz: Qidiruv platformalari

source: Search queries will be sent to these platforms.
uz: Qidiruv soʻrovlari ushbu platformalarga yuboriladi.

source: Search results
uz: Qidiruv natijalari

source: No results found.
uz: Hech qanday natija topilmadi.

source: This show does not have episodes yet
uz: Bu shouda hali hech qanday qism yoʻq

source: If you think this is an error, please consider writing a bug report.
uz: Agar buni xato deb hisoblasangiz, xatolik haqida hisobot yozing.

source: Get Some Shows
uz: Ayrim koʻrsatuvlarni olish

source: Add new shows via feed URL
uz: Tasma URL manzili orqali yangi shou qoʻshish

source: Import shows from another device
uz: Boshqa qurilmadan koʻrsatuvlarni import qilish

source: Episode Details
uz: Epizod tafsilotlari

source: Episode Menu
uz: Epizod menyusi

source: Podcast Title
uz: Podkast sarlavhasi

source: Duration - Date
uz: Davomiyligi - Sana

source: _Stream
uz: Oqim

source: _Play
uz: Ijro etish

source: _Pause
uz: Pauza

source: _Download
uz: Yuklab olish

source: Cancel
uz: Bekor qilish

source: Delete
uz: Oʻchirish

source: Episode Description
uz: Epizod tavsifi

source: Episode Cover
uz: Epizod muqovasi

source: Copy Episode URL
uz: Epizod URL manzilini nusxalash

source: Mark as Played
uz: Ijro etilgan deb belgilash

source: You’ve already listened to this episode.
uz: Bu qismni allaqachon tinglagansiz.

source: Calculating episode size…
uz: Epizod hajmi hisoblanmoqda…

source: Play this episode
uz: Bu epizodni ijro qilish

source: Pause playback
uz: Ijroni toʻxtatib turish

source: Cancel the download process
uz: Yuklab olish jarayonini bekor qilish

source: Download this episode
uz: Ushbu epizodni yuklab olish

source: Episode without audio
uz: Ovozsiz epizod

source: Today
uz: Bugun

source: Yesterday
uz: Kecha

source: This Week
uz: Bu hafta

source: This Month
uz: Bu oy

source: Older
uz: Eskiroq

source: Change the playback speed
uz: Ijro tezligini oʻzgartirish

source: Rewind 10 seconds
uz: 10 soniya aylantiring

source: Play
uz: Ijro

source: Pause
uz: Pauza

source: Fast forward 10 seconds
uz: Oldinga tezkor 10 soniya

source: Go to the description for this episode.
uz: Ushbu epizod tavsifiga kiring.

source: Go to the Chapters list.
uz: Boblar roʻyxatiga kiring.

source: _Mark All Episodes as Played
uz: Barcha epizodlarni ijro etilgan deb belgilash

source: _Website
uz: Vebsayt

source: _Unsubscribe
uz: Obunani bekor qilish

source: Player
uz: Pleyer

source: Description
uz: Taʼrif

source: Chapters
uz: Boblar

source: Rewind
uz: Qayta aylantirish

source: Forward
uz: Oldinga oʻtish

# shortcut window
source: Navigation
uz: Navigatsiya

# shortcut window
source: Go to Home Page
uz: Bosh sahifaga oʻtish

# shortcut window
source: Go to Shows Page
uz: Shows sahifasiga oʻtish

# shortcut window
source: Go To Discovery Page
uz: Discovery sahifasiga oʻtish

# shortcut window
source: Player
uz: Pleyer

# shortcut window
source: Toggle Pause
uz: Toʻxtatib turish

# shortcut window
source: Seek Forwards
uz: Oldinga intilish

# shortcut window
source: Seek Backwards
uz: Orqaga qaytish

# shortcut window
source: Raise Playback Speed
uz: Ijro tezligini oshirish

# shortcut window
source: Lower Playback Speed
uz: Ijro tezligini pasaytirish

# shortcut window
source: General
uz: Umumiy

# shortcut window
source: Check for new episodes
uz: Yangi epizodlarni tekshirish

# shortcut window
source: Quit the application
uz: Ilovadan chiqish

# shortcut window
source: Import Subscriptions
uz: Obunalarni import qilish

# shortcut window
source: Export Subscriptions
uz: Obunalarni eksport qilish

source: Open Website
uz: Vebsaytni ochish

source: Mark All as Played
uz: Hammasi oʻynalgan deb belgilash

source: Unsubscribe
uz: Obunani bekor qilish

source: Podcast Menu
uz: Podkast menyusi

source: Episodes
uz: Epizodlar

source: _Check for New Episodes
uz: Yangi qismlarni tekshirish

source: _Import Shows
uz: Koʻrsatuvlarni import qilish

source: _Export Shows
uz: Koʻrsatuvlarni eksport qilish

source: _Keyboard Shortcuts
uz: Klaviatura yorliqlari

source: _About Podcasts
uz: Podkastlar haqida

source: Podcasts
uz: Podkastlar

source: Add a New Feed
uz: Yangi tasma qoʻshish

source: Main Menu
uz: Asosiy Menyu

source: Show
uz: Koʻrsatish

source: Listen to your favorite podcasts, right from your desktop.
uz: Sevimli podkastlaringizni toʻgʻridan-toʻgʻri kompyuteringizdan tinglang.

source: Podcast;RSS;
uz: Podkast;RSS;

source: Height of the last open main window
uz: Oxirgi ochiq asosiy oynaning balandligi

source: Width of the last open main window
uz: Oxirgi ochiq asosiy oynaning kengligi

source: Maximized state of the last open main window
uz: Oxirgi ochiq asosiy oynaning maksimal holati

source: Whether to periodically refresh content
uz: Kontentni vaqti-vaqti bilan yangilash

source: How many periods of time to wait between automatic refreshes
uz: Avtomatik yangilashlar orasida qancha vaqt kutish kerak

source: What period of time to wait between automatic refreshes
uz: Avtomatik yangilashlar orasida qancha vaqt kutish kerak

source: Whether to refresh content after startup
uz: Ishga tushirilgandan keyin kontent yangilanadimi

source: How many periods of time to wait between automatic cleanups
uz: Avtomatik tozalashlar orasida qancha vaqt kutish kerakligi

source: What period of time to wait between automatic cleanups
uz: Avtomatik tozalashlar orasida qancha vaqt kutish kerakligi

source: Listen to your favorite shows
uz: Sevimli shoularingizni tinglang

source: Play, update, and manage your podcasts from a lightweight interface that seamlessly integrates with GNOME. Podcasts can play various audio formats and remember where you stopped listening. You can subscribe to shows via RSS/Atom, iTunes, and Soundcloud links. Subscriptions from other apps can be imported via OPML files.
uz: Podkastlaringizni GNOME bilan uzluksiz integratsiyalashgan yengil interfeysdan tinglang, yangilang va boshqaring. Podkastlar turli audio formatlarni ijro etishi va qayerda tinglashni toʻxtatganingizni eslab qolishi mumkin. Koʻrsatuvlarga RSS/Atom, iTunes va Soundcloud havolalari orqali obuna boʻlishingiz mumkin. Boshqa ilovalardan obunalarni OPML fayllari orqali import qilish mumkin.

source: The home view displaying the newest episodes of your podcasts
uz: Podkastlaringizning eng yangi qismlari aks etgan bosh sahifa

source: The shows view displaying the covers of your podcasts
uz: Podkastlaringiz muqovalarini koʻrsatadigan koʻrinish

source: The show widget displaying the cover and the latest episodes of a specific podcast
uz: Muqova va ma’lum bir podkastning soʻnggi epizodlarni aks ettiruvchi shou vidjeti

source: The chapters available in an episode
uz: Bir epizodda mavjud boʻlgan boblar

source: The view where one can add a new podcast
uz: Yangi podkast qoʻshish mumkin boʻlgan joy

source: The Podcasts developers
uz: Podkastlar ishlab chiquvchilari

source: Copied URL to clipboard!
uz: URL manzili vaqtinchalik xotiraga nusxalandi!

source: Download failed: {}
uz: Yuklab olinmadi: {}

source: Failed to subscribe to feed: {}
uz: Tasmaga obuna qilinmadi: {}

source: OPML file
uz: OPML fayli

source: Select the file from which to you want to import shows.
uz: Koʻrsatuvlarni import qilmoqchi boʻlgan faylni tanlang.

source: _Import
uz: Import qilish

source: Failed to parse the imported file {}
uz: Import qilingan fayl {} tahlil qilinmadi

source: Export shows to…
uz: Koʻrsatuvlarni eksport qilish…

source: _Export
uz: Eksport

source: GNOME Podcasts Subscriptions
uz: GNOME Podkastlar obunalari

source: Failed to export podcasts
uz: Podkastlar eksport qilinmadi

source: Podcast Client for the GNOME Desktop.
uz: GNOME ish stoli uchun podkast dasturi.

source: translator-credits
uz: BeMeritus <bemerituss@gmail.com>

source: Currently playing chapter
uz: Hozirda bob ijro etilmoqda

source: Fetching feeds…
uz: Tasmalar olinmoqda…

source: New
uz: Yangi

source: Shows
uz: Koʻrsatuvlar

source: Download progress
uz: Yuklab olish jarayoni

source: {} min
uz: {} daq

source: The media player was unable to execute an action.
uz: Media pleyer amalni bajara olmadi.

source: Visually expands this description
uz: Bu tavsifni vizual kengaytiradi

source: Read More
uz: Batafsil

source: Marked all episodes as listened
uz: Barcha qismlarni tinglangan deb belgiladi

source: Undo
uz: Bekor qilish

source: Unsubscribed from {}
uz: {} obunasini bekor qildi
