Repository: uzbek-net/dictionary
Catalog: gnome/circle/video-trimmer.main.*.po
Languages: uz

source: Output file path
uz: Faylni chiqarish yoʻli

source: PATH
uz: YOʻL

source: Video Trimmer
uz: Videoni qirqish vositasi

# shortcut window
source: General
uz: Umumiy

# shortcut window
source: Trim
uz: Qirqish

# shortcut window
source: Set Start at current postion
uz: Joriy joylashuvdan boshlashni belgilash

# shortcut window
source: Set End at current position
uz: Joriy joylashuvda tugashni belgilash

# shortcut window
source: New window
uz: Yangi oyna

# shortcut window
source: Close window
uz: Oynani yopish

# shortcut window
source: Keyboard shortcuts
uz: Klaviatura yorliqlari

# shortcut window
source: Quit
uz: Chiqish

# shortcut window
source: Playback
uz: Qayta ijro

# shortcut window
source: Play / Pause
uz: Tinglash / Toʻxtatish

# shortcut window
source: Step forward
uz: Oldinga qadam tashlash

# shortcut window
source: Step back
uz: Orqaga qadam tashlash

source: Could Not Load Video Track
uz: Video trekini yuklab boʻlmadi

source: Maybe the file only has an audio track, or maybe the necessary video codec is missing.
uz: Ehtimol, faylda faqat audio trek mavjud yoki kerakli video kodek oʻrnatilmagan boʻlishi mumkin.

source: Video files
uz: Video fayllar

source: Open video
uz: Videoni ochish

source: Error
uz: Xatolik

source: Video Trimmer can only operate on local files. Please choose another file.
uz: Video Trimmer faqat mahalliy fayllarda ishlashi mumkin. Boshqa faylni tanlang.

source: _OK
uz: Hop

source: (trimmed)
uz: (qirqilgan)

source: Trimming…
uz: Qirqilmoqda…

source: _Cancel
uz: Bekor qilish

source: {} has been saved
uz: {} saqlandi

source: Show in Files
uz: Fayllar ichida koʻrsatish

source: Error trimming video
uz: Videoni qirqishda xatolik yuz berdi

source: Please attach the following information when reporting an issue.
uz: Muammo haqida xabar berishda quyidagi ma’lumotlarni biriktiring.

source: Could not communicate with the ffmpeg subprocess
uz: FFmpeg ichki jarayoni bilan aloqa oʻrnatib boʻlmadi

source: Could not create the ffmpeg subprocess
uz: FFmpeg ichki jarayoni yaratib boʻlmadi

source: translator-credits
uz: Hamidulloh Toʻxtayev <toxtayevhamidulloh6997@gmail.com>

source: Contribute Translations
uz: Tarjimalarga hissa qoʻshish

source: Identity
uz: Identifikatsiya

source: Compare images and videos
uz: Rasm va videolarni solishtirish

source: This release makes the trimming options more discoverable.
uz: Bu versiya qirqish variantlarini yanada aniqroq qiladi.

source: Changed the versioning scheme to year.month.
uz: Versiyalash tizimi yil.oy koʻrinishiga oʻzgartirildi.

source: Moved the accurate trimming and remove audio options from the save dialog to the main window.
uz: Aniq qirqish va audioni olib tashlash variantlari saqlash oynasidan asosiy oynaga koʻchirildi.

source: Added , and . shortcuts for short video stepping.
uz: Qisqa video qadami uchun , (vergul) va . (nuqta) yorliqlari qoʻshildi.

source: Updated to the GNOME 48 platform.
uz: GNOME 48 platformasiga yangilandi.

source: Updated translations.
uz: Yangilangan tarjimalar.

source: _New Window
uz: Yangi oyna

source: _Keyboard Shortcuts
uz: Klaviatura yorliqlari

source: _About Video Trimmer
uz: Video Trimmer haqida

source: Precise Trim
uz: Aniq qirqish

source: Slower and may lose quality due to re-encoding
uz: Sekinroq ishlashi va qayta kodlash natijasida sifat yoʻqotilishi mumkin

source: Remove Audio
uz: Audioni olib tashlash

source: Main Menu
uz: Asosiy menyu

source: Trim Videos
uz: Videolarni qirqish

source: Drag and drop a video here
uz: Videoni bu yerga ushlab torting va tashlang

source: Open Video…
uz: Videoni ochish…

source: Select a Video
uz: Videoni tanlash

source: Trim
uz: Qirqish

source: Trim Video
uz: Videoni qirqish

source: Video Preview Failed to Load
uz: Video oldindan koʻrishni yuklashda xatolik yuz berdi

source: Please enter the start and end timestamps manually. If you're running Video Trimmer under Flatpak, note that opening files by drag-and-drop may not work.
uz: Boshlash va tugatish vaqt belgilarini oddiy usulda kiriting. Agar Flatpak ostida Video Trimmerʼni ishga tushirayotgan boʻlsangiz, fayllarni tortish va tashlash orqali ochish ishlamasligi mumkin.

source: Start
uz: Boshlash

source: End
uz: Tugatish

source: Trim videos quickly
uz: Videolarni tezda qirqish

source: Cut;Movie;Film;Clip;
uz: Qirqish;Kino;Film;Klip;

source: Video Trimmer cuts out a fragment of a video given the start and end timestamps. The video is never re-encoded, so the process is very fast and does not reduce the video quality.
uz: Video Trimmer berilgan boshlanish va tugash vaqtlariga koʻra videoning ma’lum bir qismini qirqib oladi. Video hech qachon qayta kodlanmagani sababli, bu jarayon juda tez amalga oshadi va video sifatiga ta’sir qilmaydi.

source: Main Window
uz: Asosiy oyna
