Repository: uzbek-net/dictionary
Catalog: gnome/circle/warp.main.*.po
Languages: uz

source: Fast and secure file transfer
uz: Fayllarni tez va xavfsiz uzatish

source: Warp allows you to securely send files to each other via the internet or local network by exchanging a word-based code.
uz: Warp soʻzga asoslangan maxsus kod orqali fayllarni internet yoki mahalliy tarmoq boʻylab bir-biringizga xavfsiz yuborish imkonini beradi.

source: The best transfer method will be determined using the “Magic Wormhole” protocol which includes local network transfer if possible.
uz: Eng yaxshi uzatish usuli iloji boricha mahalliy tarmoqni uzatishni oʻz ichiga olgan “Magic Wormhole” protokoli yordamida aniqlanadi.

source: Features
uz: Funksiyalar

source: Send files between multiple devices
uz: Fayllarni bir nechta qurilmalar orasida yuborish

source: Every file transfer is encrypted
uz: Har bir fayl uzatilishi shifrlangan

source: Directly transfer files on the local network if possible
uz: Iloji boʻlsa, fayllarni mahalliy tarmoqqa bevosita uzatish

source: An internet connection is required
uz: Internetga ulanish talab etiladi

source: QR Code support
uz: QR kod qoʻllab-quvvatlash

source: Main Window
uz: Asosiy oyna

source: Transmit Code
uz: Kodni uzatish

source: Accept File Transfer
uz: Fayl uzatishni qabul qilish

source: Receiving File
uz: Faylni qabul qilish

source: File Transfer Complete
uz: Fayl uzatish yakunlandi

source: General
uz: Umumiy

source: Show Help
uz: Yordamni koʻrsatish

source: Show Shortcuts
uz: Yorliqlarni koʻrsatish

source: Show Preferences
uz: Afzalliklarni koʻrsatish

source: Quit
uz: Chiqish

source: File Transfer
uz: Fayl uzatish

source: Send File
uz: Fayl joʻnatish

source: Send Folder
uz: Jild joʻnatish

source: Receive File
uz: Faylni qabul qilish

source: One second left
uz: {} soniya qoldi

source: One minute left
uz: {} daqiqa qoldi

source: One hour left
uz: {} soat qoldi

source: One day left
uz: {} kun qoldi

source: Copied Code to Clipboard
uz: Kod vaqtinchalik xotiraga nusxalandi

source: Copied Link to Clipboard
uz: Vaqtincha xotiraga havola nusxalandi

source: Copied Error to Clipboard
uz: Xatolik vaqtinchalik xotiraga nusxalandi

source: No error available
uz: Xato topilmadi

source: Creating Archive
uz: Arxiv yaratish

source: Compressing folder “{}”
uz: "{}" jildi zichlanmoqda

source: Connecting
uz: Ulanmoqda

source: Requesting file transfer
uz: Fayl uzatish soʻralmoqda

source: Ready to send “{}”.
uz: “{}” yuborishga tayyor.

source: The receiver needs to enter or scan this code to begin the file transfer.
uz: Qabul qiluvchi fayl uzatishni boshlash uchun ushbu kodni kiritishi yoki skanerdan oʻtkazishi kerak.

source: The QR code is compatible with the following apps: {}.
uz: QR kod quyidagi ilovalar bilan mos keladi: {}.

source: You have entered a custom rendezvous server URL in preferences. Please verify the receiver also uses the same rendezvous server.
uz: Sozlamalarda maxsus uchrashuv serveri URL manzilini kiritgansiz. Iltimos, qabul qiluvchi ham xuddi shu uchrashuv serveridan foydalanayotganini tekshirib koʻring.

source: Click the QR code to copy the link to the clipboard.
uz: Havolani bufer nusxalash uchun QR kodni bosing.

source: Connecting to peer with code “{}”
uz: “{}” kodi bilan sherigingizga ulanilmoqda

source: Connected to Peer
uz: Teng huquqli foydalanuvchiga ulanildi

source: Preparing to send file
uz: Fayl yuborishga tayyorgarlik koʻrilmoqda

source: Preparing to receive file
uz: Faylni qabul qilishga tayyorlanmoqda

source: Your peer wants to send you “{0}” (Size: {1}). Do you want to download this file? The default action will save the file to your Downloads folder.
uz: Sizga “{0}” nomli, hajmi {1} fayl yubormoqchi. Ushbu faylni yuklab olmoqchimisiz? Odatda fayl "Yuklanmalar" jildida saqlanadi.

source: Ready to Receive File
uz: Faylni qabul qilishga tayyor

source: A file is ready to be transferred. The transfer needs to be acknowledged.
uz: Fayl uzatishga tayyor. Uzatish tasdiqlashi kerak.

source: File “{}” via local network direct transfer
uz: “{}” faylini mahalliy tarmoq orqali toʻgʻridan-toʻgʻri uzatish

source: File “{}” via direct transfer
uz: "{}" faylini toʻgʻridan-toʻgʻri uzatish usuli bilan

source: File “{0}” via relay {1}
uz: "{0}" faylini {1} orqali uzatish

source: File “{}” via relay
uz: “{}” faylini uzatish

source: File “{}” via Unknown connection method
uz: “{}” fayli orqali noma’lum ulanish usuli

source: Sending File
uz: Fayl yuborilmoqda

source: Successfully sent file “{}”
uz: “{}” fayli muvaffaqiyatli yuborildi

source: File has been saved to the selected folder as “{}”
uz: Fayl tanlangan jildga “{}” sifatida saqlandi

source: File has been saved to the Downloads folder as “{}”
uz: Fayl Yuklanmalar jildiga “{}” sifatida saqlandi

source: File Transfer Failed
uz: Fayl uzatish amalga oshmadi

source: The file transfer failed: {}
uz: Fayl uzatish amalga oshmadi: {}

source: Specified file / directory does not exist
uz: Koʻrsatilgan fayl / katalog mavjud emas

source: Error parsing rendezvous server URL. An invalid URL was entered in the settings.
uz: Uchrashuv serveri URL manzilini tahlil qilishda xatolik yuz berdi. Sozlamalarga notoʻgʻri URL kiritilgan.

source: Error parsing transit URL. An invalid URL was entered in the settings.
uz: Oʻtkazish URL manzilini tahlil qilishda xatolik yuz berdi. Sozlamalarga notoʻgʻri URL kiritilgan.

source: Invalid path selected: {}
uz: Yaroqsiz yoʻnalish tanlandi: {}

source: {} File - Size: {}
uz: {} ta fayl - Hajmi: {}

source: Save As
uz: Boshqacha saqlash

source: Copy Transmit Link
uz: Uzatish havolasini nusxalash

source: Your Transmit Code
uz: Uzatish kodingiz

source: Copy Transmit Code
uz: Uzatish kodini nusxalash

source: Accept File Transfer?
uz: Fayl uzatish qabul qilinsinmi?

source: Save to Downloads Folder
uz: Yuklanmalar jildiga saqlash

source: _Accept
uz: Qabul qilish

source: Sa_ve As…
uz: Sifatida saqlash…

source: File Transfer Successful
uz: Fayl muvaffaqiyatli uzatildi

source: _Open File
uz: Faylni ochish

source: _Show in Folder
uz: Jildda koʻrsatish

source: Co_py Error Message
uz: Xato xabarini nusxalash

source: _Cancel
uz: Bekor qilish

source: Unable to use transfer link: another transfer already in progress
uz: Uzatish havolasidan foydalanib boʻlmadi: boshqa uzatish jarayoni allaqachon amalga oshirilmoqda

source: Sending a File
uz: Fayl yuborilmoqda

source: Receiving a File
uz: Fayl olinmoqda

source: Camera access denied. Open Settings and allow Warp to access the camera.
uz: Kamera ruxsati rad etildi. Sozlamalarni oching va Warp ilovasiga kameradan foydalanishga ruxsat bering.

source: Failed to start the camera: {}
uz: Kamerani ishga tushirib boʻlmadi: {}

source: Error
uz: Xatolik

source: Could not use the camera portal: {}
uz: Kamera portalidan foydalanilmadi: {}

source: Could not start the device provider: {}
uz: Qurilma ta’minotchisi ishga tushirilmadi: {}

source: No Camera Found
uz: Hech qanday kamera topilmadi

source: Connect a camera to scan QR codes
uz: QR kodlarni skanerlash uchun kamerani ulang

source: Scan QR Code
uz: QR kodni skanerlash

source: _Retry
uz: Qayta urinish

source: _Troubleshooting
uz: Muammoni bartaraf etish

source: Downloads dir missing. Please set XDG_DOWNLOAD_DIR
uz: Yuklab olish jildi topilmadi. Iltimos, XDG_DOWNLOAD_DIRʼni sozlang

source: Licensed under the <a href="{}">{}</a>.
uz: <a href="{}">{}</a> bilan litsenziyalangan.

source: Licensed under the {}.
uz: {} bilan litsenziyalangan.

source: Changing the rendezvous server URL needs to be done on both sides of the transfer. Only enter a server URL you can trust. Leaving these entries empty will use the app defaults: Rendezvous Server: “{0}” Transit Server: “{1}”
uz: Uchrashuv serveri URL manzilini oʻzgartirish uzatishning har ikki tomonida ham amalga oshirilishi lozim. Faqat ishonchli server URL manzilini kiriting. Agar ushbu maydonlar boʻsh qoldirilsa, ilova standart sozlamalaridan foydalaniladi: Uchrashuv serveri: "{0}" Tranzit serveri: "{1}"

source: Preferences
uz: Afzalliklar

source: Network
uz: Tarmoq

source: Code Words
uz: Kod soʻzlari

source: The code word count determines the security of the transfer. A short code is easy to remember but increases the risk of someone else guessing the code. As a code may only be guessed once, the risk is very small even with short codes. A length of 4 is very secure.
uz: Koddagi soʻzlar soni uzatishning xavfsizligini belgilaydi. Qisqa kodni eslab qolish oson, lekin bu kodni boshqa birov topib olish xavfini oshiradi. Kodni faqat bir marta taxmin qilish mumkinligi sababli, hatto qisqa kodlar bilan ham xavf juda kichik. 4 ga teng uzunlik juda xavfsiz.

source: Code Word Count
uz: Koddagi soʻzlar soni

source: Server URLs
uz: Server URL manzillari

source: Rendezvous Server URL
uz: Uchrashuv serveri URL manzili

source: Transit Server URL
uz: Tranzit serveri URL manzili

source: Welcome
uz: Xush kelibsiz

source: Welcome to Warp
uz: Warp dasturiga xush kelibsiz

source: Next
uz: Keyingi

source: Introduction
uz: Kirish

source: Warp makes file transfer simple. To get started, both parties need to install Warp on their devices. After selecting a file to transmit, the sender needs to tell the receiver the displayed transmit code. This is preferably done via a secure communication channel. When the receiver has entered the code, the file transfer can begin. For more information about Warp, open the Help section from the Main Menu.
uz: Warp fayllarni uzatishni osonlashtiradi. Ishni boshlash uchun ikkala tomon ham oʻz qurilmalariga Warp ilovasini oʻrnatishi kerak. Uzatish uchun fayl tanlangandan soʻng, joʻnatuvchi qabul qiluvchiga koʻrsatilgan uzatish kodini aytishi kerak. Buni himoyalangan aloqa kanali orqali amalga oshirgan ma’qul. Qabul qiluvchi kodni kiritgach, fayl uzatishni boshlash mumkin. Warp haqida koʻproq ma’lumot olish uchun Asosiy menyudan Yordam boʻlimini oching.

source: Get Started Using Warp
uz: Warp ishlatishni boshlang

source: Error loading config file “{0}”, using default config. Error: {1}
uz: "{0}" sozlama faylini yuklashda xatolik yuz berdi, odatiy sozlama ishlatilmoqda. Xato: {1}

source: Error saving configuration file: {}
uz: Konfiguratsiya faylini saqlashda xatolik yuz berdi: {}

source: translator-credits
uz: Hamidulloh Toʻxtayev <toxtayevhamidulloh6997@gmail.com>

source: Pika Backup
uz: Pika zaxirasi

source: Keep your data safe
uz: Ma’lumotlaringizni xavfsiz saqlang

source: Select File to Send
uz: Yuborish uchun faylni tanlang

source: Select Folder to Send
uz: Yuborish uchun jildni tanlang

source: “{}” appears to be an invalid Transmit Code. Please try again.
uz: “{}” notoʻgʻri uzatish kodi boʻlishi mumkin. Iltimos, qaytadan urinib koʻring.

source: Sending files with a preconfigured code is not yet supported
uz: Oldindan sozlangan kodli fayllarni yuborish hozircha qoʻllab-quvvatlanmaydi

source: _Preferences
uz: Afzalliklar

source: _Keyboard Shortcuts
uz: Klaviatura yorliqlari

source: _Help
uz: Yordam

source: _About Warp
uz: Warp haqida

source: Inserted code from clipboard
uz: Vaqtinchalik xotiradan kiritilgan kod

source: Abort File Transfer?
uz: Fayl uzatilishi bekor qilinsinmi?

source: Do you want to abort the current file transfer?
uz: Joriy fayl uzatishni toʻxtatmoqchimisiz?

source: _Continue
uz: Davom etish

source: _Abort
uz: Bekor qilish

source: Unable to Open File
uz: Faylni ochish imkonsiz

source: _Close
uz: Yopish

source: Main Menu
uz: Asosiy menyu

source: _Send
uz: Yuborish

source: Select or drop the file or directory to send
uz: Yuborish uchun fayl yoki katalogni tanlang yoki tashlang

source: Select _File…
uz: Faylni tanlang…

source: Select F_older…
uz: Jildni tanlang…

source: _Receive
uz: Qabul qilmoq

source: Enter the transmit code from the sender
uz: Yuboruvchidan uzatish kodini kiriting

source: Receive _File
uz: Faylni qabul qilish

source: Failed to open downloads folder.
uz: Yuklamalar jildini ochishda xatolik yuz berdi.

source: The URI format is invalid
uz: URI formati yaroqsiz

source: The code does not match the required format
uz: Kod talab qilingan formatga mos kelmaydi

source: Unknown URI version: {}
uz: Notanish URI versiyasi: {}

source: The URI parameter “rendezvous” contains an invalid URL: “{}”
uz: "Uchrashuv" URI parametri yaroqsiz URL manzilini oʻz ichiga oladi: "{}"

source: The URI parameter “role” must be “follower” or “leader” (was: “{}”)
uz: URI "rol" parametri "kuzatuvchi" yoki "yetakchi" boʻlishi kerak (edi: "{}")

source: Unknown URI parameter “{}”
uz: Noma’lum URI parametri "{}"

source: An error occurred
uz: Xatolik yuz berdi

source: Corrupt or unexpected message received
uz: Buzilgan yoki kutilmagan xabar olindi

source: The rendezvous server will not allow further connections for this code. A new code needs to be generated.
uz: Uchrashuv serveri ushbu kod uchun qoʻshimcha ulanishlarga ruxsat bermaydi. Yangi kodni generatsiya qilish kerak.

source: The rendezvous server removed the code due to inactivity. A new code needs to be generated.
uz: Uchrashuvlar serveri faolsizlik tufayli kodni oʻchirib tashladi. Yangi kod yaratish zarur.

source: The rendezvous server responded with an unknown message: {}
uz: Uchrashuv serveri noma’lum xabar bilan javob berdi: {}

source: Error connecting to the rendezvous server. You have entered a custom rendezvous server URL in preferences. Please verify the URL is correct and the server is working.
uz: Uchrashuv serveriga ulanishda xatolik yuz berdi. Sozlamalarda maxsus uchrashuv serveri URL manzilini kiritdingiz. URL toʻgʻriligini va server ishlayotganini tekshiring.

source: Error connecting to the rendezvous server. Please try again later / verify you are connected to the internet.
uz: Uchrashuv serveriga ulanishda xatolik yuz berdi. Keyinroq qayta urining / internetga ulanganingizni tekshiring.

source: Encryption key confirmation failed. If you or your peer didn't mistype the code, this is a sign of an attacker guessing passwords. Please try again some time later.
uz: Shifrlash kaliti tasdiqlanmadi. Agar siz yoki sherigingiz kodni notoʻgʻri yozmagan boʻlsa, bu hujumchi parollarni taxmin qilayotganining belgisidir. Birozdan keyin qayta urining.

source: Cannot decrypt a received message
uz: Qabul qilingan xabarni shifrdan ochib boʻlmadi

source: An unknown error occurred
uz: Nomaʼlum muammo yuzaga keldi

source: The specified code must not be empty
uz: Koʻrsatilgan kod boʻsh boʻlmasligi kerak

source: The code must contain at least one “-”
uz: Kodda kamida bitta “-” boʻlishi kerak

source: The first segment of a code must be a number
uz: Kodning birinchi boʻlagi albatta raqam boʻlishi shart

source: Code too weak. It can be guessed with an average of {} try.
uz: Kod juda zaif. Buni o‘rtacha {} ta urinish bilan taxmin qilish mumkin.

source: Code too short. The text after the “-” must be at least {} character long.
uz: Kod juda qisqa. “-” belgisidan keyingi matn kamida {} ta belgidan iborat bo‘lishi kerak.

source: Code too weak
uz: Kod juda zaif

source: File / Directory not found
uz: Fayl / Jild topilmadi

source: Permission denied
uz: Ruxsat berilmadi

source: Canceled
uz: Bekor qilingan

source: Portal service response: Permission denied
uz: Portal xizmati javobi: Ruxsat berilmadi

source: The portal service has failed: {}
uz: Portal xizmati ishlamay qoldi: {}

source: Error communicating with the portal service via zbus: {}
uz: Zbus orqali portal xizmati bilan aloqa oʻrnatishda xatolik yuz berdi: {}

source: Portal error: {}
uz: Portalda xatolik: {}

source: Transfer was not acknowledged by peer
uz: Uzatish sherigingiz tomonidan tasdiqlanmadi

source: The received file is corrupted
uz: Qabul qilingan fayl buzilgan

source: The file contained a different amount of bytes than advertised! Sent {} bytes, but should have been {}
uz: Fayl e’lon qilingan hajmdan farqli miqdordagi baytlarni oʻz ichiga oldi! {} bayt yuborildi, ammo aslida {} bayt boʻlishi kerak edi

source: The other side has cancelled the transfer
uz: Narigi tomon uzatishni bekor qildi

source: The other side has rejected the transfer
uz: Narigi tomon uzatishni rad etdi

source: Something went wrong on the other side: {}
uz: Boshqa tomonda xatolik yuz berdi: {}

source: Error while establishing file transfer connection
uz: Fayl uzatish aloqasini oʻrnatishda xatolik yuz berdi

source: Unknown file transfer error
uz: Noma’lum fayl uzatish xatosi

source: An unknown error occurred while creating a zip file: {}
uz: Zip faylini yaratishda noma’lum xatolik yuz berdi: {}

source: An unexpected error occurred. Please report an issue with the error message.
uz: Kutilmagan xato sodir boʻldi. Iltimos, xato xabari bilan birga muammo haqida ma’lum qiling.
