Repository: uzbek-net/dictionary
Catalog: gnome/49/gsettings-desktop-schemas.gnome-49.*.po
Languages: uz

source: On-screen keyboard
uz: Ekran klaviaturasi

source: Whether the on-screen keyboard is turned on.
uz: Ekran klaviaturasi yoqilganmi.

source: Screen magnifier
uz: Ekran kattalashtirgich

source: Whether the screen magnifier is turned on.
uz: Ekran kattalashtirgich yoqilganmi.

source: Screen reader
uz: Ovozli oʻquvchi

source: Whether the screen reader is turned on.
uz: Erkan oʻquvchi yoqilganmi.

source: Always show the Universal Access status icon
uz: Universal Kirish belgisi har doim koʻrinsin

source: This key overrides the automatic hiding of the Universal Access status icon when no accessibility features are enabled.
uz: Maxsus imkoniyatlar yoqilmaganda, bu kalit Universal Kirish holati belgisini avtomatik yashirishni bekor qiladi.

source: Always show the text caret
uz: Matn kursori doimiy koʻrinsin

source: This key overrides the hiding of the text caret in noneditable text in applications.
uz: Ushbu kalit, dasturlarda tahrir qilib boʻlmaydigan matnda matn kursorini yashirishni bekor qiladi.

source: High contrast
uz: Yuqori kontrast

source: Whether to use the high contrast style.
uz: Yuqori kontrast uslubi qoʻllashni tanlash.

source: Show status shapes
uz: Holat shakllarini koʻrsatilsin

source: Whether to use shapes to indicate status in addition or instead of color.
uz: Holatni koʻrsatishda rang oʻrniga yoki qoʻshimcha ravishda shakllardan foydalanishni tanlash.

source: Enable accessibility keyboard shortcuts
uz: Maxsus imkoniyatlar uchun klaviatura tezkor tugmalarini yoqish

source: Beep when a keyboard accessibility feature changes
uz: Klaviatura maxsus imkoniyatlari oʻzgarganda tovush chiqarish

source: Whether to beep when a keyboard accessibility feature is enabled or disabled.
uz: Klaviatura maxsus imkoniyatlari yoqilganda yoki oʻchirilganda tovush chiqarish.

source: Disable keyboard accessibility after a timeout
uz: Vaqt oʻtgach klaviatura maxsus imkoniyatlarini oʻchirish

source: Whether to disable keyboard accessibility after a timeout, useful for shared machines.
uz: Vaqt oʻtgach klaviatura maxsus imkoniyatlarini oʻchirishni tanlash, ulashilgan kompyuterlarda uchun foydali.

source: Duration of the disabling timeout
uz: Oʻchirish vaqtining davomiyligi

source: Duration of the timeout before disabling the keyboard accessibility.
uz: Klaviatura maxsus imkoniyatlarini oʻchirishdan oldingi kutish vaqti davomiyligi.

source: Enable “Bounce Keys”
uz: Tugma cheklovini yoqish

source: Whether the “Bounce Keys” keyboard accessibility feature is turned on.
uz: "Tugma cheklovi" klaviatura maxsus imkoniyati yoqilgan yoki yoʻqligini tekshirish.

source: Minimum interval in milliseconds
uz: Har millisekundlarda minimum interval

source: Ignore multiple presses of the same key within this many milliseconds.
uz: Bir tugma ketma-ket bosilganda, shu millisekund ichida takroriy bosishlar qabul qilinmasin.

source: Beep when a key is rejected
uz: Tugma rad etilganda tovush chiqarsin

source: Whether to beep when a key is rejected.
uz: Tugma rad etilganda tovush chiqarilsinmi.

source: Enable “Mouse Keys”
uz: Klaviatura bilan sichqonchani boshqarish

source: Whether the “Mouse Keys” accessibility feature is turned on.
uz: Klaviatura bilan sichqonchani boshqarish yoqilganmi.

source: Pixels per seconds
uz: Harakat tezligi (sekundiga piksel)

source: How many pixels per second to move at the maximum speed.
uz: Maksimal tezlik: sekundiga nechta piksel.

source: How long to accelerate in milliseconds
uz: Tezlashish davomiyligi millisekundlarda

source: How many milliseconds it takes to go from 0 to maximum speed.
uz: 0 dan maksimal tezlikkacha qancha millisekund ketadi.

source: Initial delay in milliseconds
uz: Dastlabki kutish vaqti millisekundlarda

source: How many milliseconds to wait before mouse movement keys start to operate.
uz: Sichqoncha harakat tugmalari ishga tushishi uchun boshlangʻich kechikish millisekundlarda.

source: Enable “Slow Keys”
uz: "Tugmalardagi kechikish"ni yoqish

source: Whether the “Slow Keys” accessibility feature is turned on.
uz: "Tugmalardagi kechikish" imkoniyati yoqilganmi.

source: Do not accept a key as being pressed unless held for this many milliseconds.
uz: Tugma shu millisekund davomida bosilib turilmasa, uni bosilgan deb hisoblamang.

source: Beep when a key is first pressed
uz: Tugma birinchi marta bosilganda tovush chiqarish

source: Whether to beep when a key is first pressed.
uz: Tugma birinchi marta bosilganda tovush chiqarilsinmi.

source: Beep when a key is accepted
uz: Tugma qabul qilnganda tovush chiqarish

source: Whether to beep when a key is accepted.
uz: Tugma qabul qilinganda tovush chiqarilsinmi.

source: Enable sticky keys
uz: Tugmalarni ketma-ket bosishni yoqish

source: Whether the sticky keys accessibility feature is turned on.
uz: Tugmalarni ketma-ket bosib ishlatish imkoniyati yoqilganmi.

source: Disable when two keys are pressed at the same time
uz: Ikki tugma birga bosilganda oʻchirish

source: Whether to disable sticky keys if two keys are pressed at the same time.
uz: Ikki tugma bir vaqtda bosilganda Tugmalarni ketma-ket bosib ishlatishni oʻchirish.

source: Beep when a modifier is pressed.
uz: Modifikator tugmasi bosilganda tovush chiqishi.

source: Whether to beep when a modifier key is pressed.
uz: Modifikator tugma bosilganda tovush chiqarilsinmi.

source: Enable “Toggle Keys”
uz: "Toggle tugmalarini" yoqish

source: Whether the “Toggle Keys” accessibility feature is turned on.
uz: "Toggle tugmalari" imkoniyati yoqilganmi.

source: Mouse Tracking Mode
uz: Sichqoncha kuzatuv rejimi

source: Determines the position of the magnified mouse image within the magnified view and how it reacts to system mouse movement. The values are • none: no mouse tracking; • centered: the mouse image is displayed at the center of the zoom region (which also represents the point under the system mouse) and the magnified contents are scrolled as the system mouse moves; • proportional: the position of the magnified mouse in the zoom region is proportionally the same as the position of the system mouse on screen; • push: when the magnified mouse intersects a boundary of the zoom region, the contents are scrolled into view.
uz: Kattalashtirilgan sichqoncha tasvirining kattalashtirilgan koʻrinishdagi oʻrnini va tizim sichqoncha harakatiga qanday javob beradi. Qiymatlar quyidagilar: • yoʻq: sichqoncha kuzatilmaydi; • markazlashtirilgan: sichqoncha tasviri kattalashtirilgan hududning markazida koʻrsatiladi (bu tizim sichqonchasi ostidagi nuqtani ham ifodalaydi) va tizim sichqonchasi harakatlanganda kattalashtirilgan kontent scroll qilinadi; • mutanosib: kattalashtirilgan sichqonchaning masshtab hududidagi joylashuvi tizim sichqonchasining ekrandagi holati bilan mutanosib ravishda bir xil; • surish: kattalashtirilgan sichqoncha kattalashtirilgan hududning chegarasiga yetganda, kontent koʻrinadigan qilib scroll qilinadi.

source: Focus Tracking Mode
uz: Fokusni kuzatish rejimi

source: Determines the position of the focused widget within magnified view. The values are: • none: no focus tracking • centered: the focused image is displayed at the center of the zoom region (which also represents the point under the system focus) and the magnified contents are scrolled as the system focus moves • proportional: the position of the magnified focus in the zoom region is proportionally the same as the position of the system focus on screen • push: when the magnified focus intersects a boundary of the zoom region, the contents are scrolled into view
uz: Fokuslangan vidjetning kattalashtirilgan koʻrinishdagi joylashuvini aniqlaydi. Qiymatlar: • yoʻq: fokus kuzatilmaydi • markazda: fokuslangan tasvir kattalashtirilgan hududning markazida koʻrsatiladi (bu tizim fokusining ostidagi nuqtani ham bildiradi) va kengaytirilgan kontent tizim fokusi harakatlanganda siljitiladi • proportsional: kengaytirilgan fokusing zoom mintaqasidagi joylashuvi ekran boʻyicha tizim fokusi joylashuvi bilan proportsional boʻladi • surish: agar kengaytirilgan fokus kattalashtirilgan hududning chegarasiga yetsa, kontent koʻrinadigan qilib siljitiladi

source: Caret Tracking Mode
uz: Kursorni kuzatish rejimi

source: Determines the position of the caret within magnified view. The values are: • none: no caret tracking • centered: the image of the caret is displayed at the center of the zoom region (which also represents the point under the system caret) and the magnified contents are scrolled as the system caret moves • proportional: the position of the magnified caret in the zoom region is proportionally the same as the position of the system caret on screen • push: when the magnified caret intersects a boundary of the zoom region, the contents are scrolled into view
uz: Kattalashtirilgan koʻrinish ichida matn kursorining joylashuvini aniqlaydi. Qiymatlar: • yoʻq: kursor kuzatilmaydi • markazda: kursor tasviri kattalashtirilgan hududning markazida koʻrsatiladi (bu tizim kursorining ostidagi nuqtani ham bildiradi) va kattalashtirilgan kontent tizim kursori harakatlanganda siljitiladi • proportsional: kattalashtirilgan kursorning kattalashtirilgan hududdagu joylashuvi ekrandagi tizim kursori joylashuvi bilan proportsional boʻladi • surish: agar kattalashtirilgan kursor kattalashtirilgan hududning chegarasiga yetsa, kontent koʻrinadigan qilib siljitiladi

source: Screen position
uz: Ekrandagi joylashuv

source: The magnified view either fills the entire screen, or occupies the top-half, bottom-half, left-half, or right-half of the screen.
uz: Kengaytirilgan koʻrish oynasi butun ekranni toʻldirishi yoki ekraning yuqori yarmi, pastki yarmi, chap yarmi yoki oʻng yarmida joylashishi mumkin.

source: Magnification factor
uz: Kengaytirish koʻrsatkichi

source: The power of the magnification. A value of 1.0 means no magnification. A value of 2.0 doubles the size.
uz: Kattalashtirish kuchi. 1.0 qiymati kattalashtirilmaganini bildiradi. 2.0 qiymati oʻlchamni ikki baravarga kattalashtiradi.

source: Enable lens mode
uz: Linza rejimini yoqish

source: Whether the magnified view should be centered over the location of the system mouse and move with it.
uz: Kattalashtirilgan koʻrish tizim sichqonchasining joylashuvi ustida markazlashtirilishi va u bilan harakatlanishi kerakligini aniqlaydi.

source: Scroll magnified contents beyond the edges of the desktop
uz: Kattalashtirilgan kontentni ish stoli chetlaridan tashqariga siljitish

source: For centered mouse tracking, when the system pointer is at or near the edge of the screen, the magnified contents continue to scroll such that the screen edge moves into the magnified view.
uz: Markazlashtirilgan sichqoncha kuzatuvi uchun, tizim koʻrsatkichi ekran chetiga yetganda yoki yaqinlashganda, kattalashtirilgan kontent davom etib scroll qilinadi, shunday qilib, ekran chetini kattalashtirilgan koʻrish oynasiga kiritadi.

source: Show or hide crosshairs
uz: Kesishmalarni koʻrsatish yoki yashirish

source: Enables/disables display of crosshairs centered on the magnified mouse sprite.
uz: Kattalashtirilgan sichqoncha tasvirida markazlashtirilgan kesishmalarni koʻrsatish/yashirishni yoqadi/oʻchiradi.

source: Thickness of the crosshairs in pixels
uz: Kesishmalarning qalinligini piksellarda

source: Width in pixels of the vertical and horizontal lines that make up the crosshairs.
uz: Kesishmalarni tashkil etuvchi vertikal va gorizontal chiziqlarning pikseldagi kengligi.

source: Color of the crosshairs
uz: Kesishmaning rangi

source: The color of the the vertical and horizontal lines that make up the crosshairs.
uz: Kesishmalardagi vertikal va gorizontal chiziqlarning rangi.

source: Opacity of the crosshairs
uz: Kesishmalarning shaffofligi

source: Determines the transparency of the crosshairs, from fully opaque to fully transparent.
uz: Kesishmalarning shaffofligini belgilaydi, toʻliq shaffof boʻlmagan holatdan toʻliq shaffoflikgacha.

source: Length of the crosshairs in pixels
uz: Kesishma uzunligi piksellarda

source: Determines the length in pixels of the vertical and horizontal lines that make up the crosshairs.
uz: Kesishmalarning vertikal va gorizontal chiziqlari uzunligini pikselda aniqlaydi.

source: Clip the crosshairs at the center
uz: Kesishmalarni markazda cheklash

source: Determines whether the crosshairs intersect the magnified mouse sprite, or are clipped such that the ends of the horizontal and vertical lines surround the mouse image.
uz: Kesishmalar kattalashtirilgan sichqoncha tasviriga tegishli boʻlishi yoki chiziqlarning oxirlarini sichqoncha tasvirini oʻrab turadigan tarzda cheklanishi kerakligini belgilaydi.

source: Inverse lightness
uz: Teskari yoritish

source: Determines whether the lightness values are inverted: darker colors become lighter and vice versa, and white and black are interchanged.
uz: Yoritilish qiymatlari teskari boʻlishini aniqlaydi: qorongʻi ranglar yorqinroq boʻladi va aksincha, oq va qora ranglar oʻrnini almashtiradi.

source: Color Saturation
uz: Ranglar toʻyinganligi

source: Represents a change to the color saturation, from 0.0 (grayscale) to 1.0 (full color).
uz: Rangning toʻyinganligini oʻzgartirishni bildiradi, 0.0 (grayscale) dan 1.0 (toʻliq rang) gacha.

source: Change brightness of red
uz: Qizil rang yorqinligini oʻzgartirish

source: Represents a change to the default brightness of the red component. Zero indicates no change, values less than zero indicate a decrease, and values greater than zero indicate an increase.
uz: Qizil komponentning standart yorqinligini oʻzgartirishni bildiradi. Nol qiymati oʻzgarmasligini, noldan kichik qiymatlar kamayishini, nolga katta qiymatlar esa oshishini anglatadi.

source: Change brightness of green
uz: Yashil rang yorqinligini oʻzgartirish

source: Represents a change to the default brightness for the green component. Zero indicates no change, values less than zero indicate a decrease, and values greater than zero indicate an increase.
uz: Yashil komponentning standart yorqinligini oʻzgartirishni bildiradi. Nol qiymati oʻzgarmasligini, noldan kichik qiymatlar kamayishini, nolga katta qiymatlar esa oshishini anglatadi.

source: Change brightness of blue
uz: Koʻk rang yorqinligini oʻzgartirish

source: Represents a change to the default brightness for the blue component. Zero indicates no change, values less than zero indicate a decrease, and values greater than zero indicate an increase.
uz: Koʻk komponentning standart yorqinligini oʻzgartirishni bildiradi. Nol qiymati oʻzgarmasligini, noldan kichik qiymatlar kamayishini, nolga katta qiymatlar esa oshishini anglatadi.

source: Change contrast of red
uz: Qizil rang kontrastini oʻzgartirish

source: Represents a change to the default contrast of the red component. Zero indicates no change in contrast, values less than zero indicate a decrease, and values greater than zero indicate an increase.
uz: Qizil komponentning standart kontrastini oʻzgartirishni bildiradi. Nol qiymati kontrastning oʻzgarmasligini, noldan kichik qiymatlar kamayishini, nolga katta qiymatlar esa oshishini anglatadi.

source: Change contrast of green
uz: Yashil rang kontrastini oʻzgartirish

source: Represents a change to the default contrast of the green component. Zero indicates no change in contrast, values less than zero indicate a decrease, and values greater than zero indicate an increase.
uz: Yashil komponentning standart kontrastini oʻzgartirishni bildiradi. Nol qiymati kontrastning oʻzgarmasligini, noldan kichik qiymatlar kamayishini, nolga katta qiymatlar esa oshishini anglatadi.

source: Change contrast of blue
uz: Koʻk rang kontrastini oʻzgartirish

source: Represents a change to the default contrast of the blue component. Zero indicates no change in contrast, values less than zero indicate a decrease, and values greater than zero indicate an increase.
uz: Koʻk komponentning standart kontrastini oʻzgartirishni bildiradi. Nol qiymati kontrastning oʻzgarmasligini, noldan kichik qiymatlar kamayishini, nolga katta qiymatlar esa oshishini anglatadi.

source: Dwell click time
uz: Bosish uchun kutish vaqti (uzoq bosish)

source: Time in seconds before a click is triggered.
uz: Bosish amalga oshirilishidan oldin kutish uchun vaqt (soniyalarda).

source: Movement threshold
uz: Harakat chegarasi

source: Distance in pixels before movement will be recognized.
uz: Harakat tan olinishi uchun zarur boʻlgan masofa piksellarda.

source: Gesture single click
uz: Yagona bosish harakati

source: Direction to perform a single click (“left”, “right”, “up”, “down”).
uz: Bitta bosishni amalga oshirish yoʻnalishi (“chapga”, “oʻngga”, “yuqoriga”, “pastga”).

source: Gesture double click
uz: Ikki marta bosish harakati

source: Direction to perform a double click (“left”, “right”, “up”, “down”).
uz: Ikki martalik bosishni amalga oshirish yoʻnalishi (“chapga”, “oʻngga”, “yuqoriga”, “pastga”).

source: Gesture drag click
uz: Bosib siljitish harakati

source: Direction to perform dragging (“left”, “right”, “up”, “down”).
uz: Siljitish harakatini amalga oshirish yoʻnalishi (“chapga”, “oʻngga”, “yuqoriga”, “pastga”).

source: Gesture secondary click
uz: Ikkinchi darajali bosish harakati

source: Direction to perform a secondary click (“left”, “right”, “up”, “down”).
uz: Ikkinchi darajali bosishni amalga oshirish yoʻnalishi (“chapga”, “oʻngga”, “yuqoriga”, “pastga”).

source: Dwell click mode
uz: Bosish rejimi (uzoq bosish)

source: The active dwell click mode. Possible values are “window” and “gesture”.
uz: Faol bosish rejimi (uzoq bosish). Mumkin boʻlgan qiymatlar: “oyna” va “harakat”.

source: Show click type window
uz: Klik turi oynasini koʻrsatish

source: Show click type window.
uz: Klik turi oynasini koʻrsatish.

source: Enable dwell clicks
uz: Uzoq bosishlarni yoqish

source: Enable dwell clicks.
uz: Uzoq bosishlarni yoqish.

source: Secondary click enabled
uz: Ikkinchi darajali bosish yoqilgan

source: Enable simulated secondary clicks
uz: Ikkinchi darajali bosishlarni simulyatsiya qilishni yoqish

source: Secondary click time
uz: Ikkinchi darajali bosish vaqti

source: Time in seconds before a simulated secondary click is triggered.
uz: Simulyatsiya qilingan ikkinchi darajali bosish amalga oshirilishidan oldin kutish uchun kerak boʻlgan vaqt (soniyalarda).

source: Folder children
uz: Ichki jildlar

source: List of relative settings paths at which app-folders are stored. Each folder uses the org.gnome.desktop.app-folders.folder schema.
uz: Ilovalar jildlari saqlanadigan aloqador sozlamalar joylashuvi roʻyxati. Har bir jild org.gnome.desktop.app-folders.folder sxemasidan foydalanadi.

source: Folder name
uz: Jild nomi

source: The name of the application folder.
uz: Ilovi jildi nomi.

source: Translate the name
uz: Nomni tarjima qilish

source: Whether the name key is a filename to be looked up in /usr/share/desktop-directories.
uz: "Name" kaliti /usr/share/desktop-directories ichida topilishi kerak boʻlgan fayl nomi yoki yoʻqligi.

source: Applications
uz: Ilovalar

source: The list of IDs of applications that are explicitly included in this folder.
uz: Bu papkaga aniq kiritilgan ilovalarning ID'lari roʻyxati.

source: Categories
uz: Boʻlimlar

source: A list of categories for which apps will be placed into this folder by default, in addition to the apps that are listed in the apps key.
uz: Ilovalar boʻlimida sanab oʻtilgan dasturlardan tashqari, bu jildga avtomatik ravishda joylashtiriladigan boʻlimlar roʻyxati.

source: Excluded applications
uz: Istisno qilinga ilovalar

source: A list of IDs of applications that are excluded from this folder. This can be used to remove applications that would otherwise be included by category.
uz: Agar boʻlimi boʻyicha avtomatik ravishda qoʻshilishi kerak boʻlgan ilovalarni olib tashlash zarur boʻlsa, unda bu ilovalar ID'lari roʻyxati ishlatiladi.

source: Picture Options
uz: Tasvir Sozlamalari

source: Determines how the image set by wallpaper_filename is rendered. Possible values are “none”, “wallpaper”, “centered”, “scaled”, “stretched”, “zoom”, “spanned”.
uz: Bu "wallpaper_filename" orqali oʻrnatilgan rasmning qanday koʻrinishda aks etishini belgilaydi. Mumkin boʻlgan qiymatlar: “yoʻq”, “fon rasmi sifatida”, “markazga joylashgan”, “masshtablangan”, “choʻzilgan”, “yaqinlashtirilgan”, “butun ekranga yoyilgan”.

source: Picture URI
uz: Rasmning URL manzili

source: URI to use for the background image. Note that the backend only supports local (file://) URIs.
uz: Orqa fon rasmi sifatida ishlatiladigan URI manzili. Diqqat qiling: dasturiy ta'minot faqat mahalliy (file://) URI manzillarini qoʻllaydi.

source: Picture URI (dark)
uz: Qorongʻi rejim uchun rasmning URI manzili

source: Picture Opacity
uz: Rasmning shaffofligi

source: Opacity with which to draw the background picture.
uz: Orqa fon rasmi qanday shaffoflikda koʻrsatilishini belgilaydi.

source: Primary Color
uz: Asosiy rang

source: Left or Top color when drawing gradients, or the solid color.
uz: Gradient chizishda ishlatiladigan chap yoki ustki rang, yoxud yagona rang.

source: Secondary Color
uz: Ikkilamchi Rang

source: Right or Bottom color when drawing gradients, not used for solid color.
uz: Gradient chizishda ishlatiladigan oʻng yoki pastki rang, yoxud yagona rang.

source: Color Shading Type
uz: Rang berish turi

source: How to shade the background color. Possible values are “horizontal”, “vertical”, and “solid”.
uz: Fon rangini qanday soyalash kerak. Mumkin boʻlgan qiymatlar: “gorizontal”, “vertikal” va “tekis”.

source: Have file manager handle the desktop
uz: Ish stolini fayl menejeri boshqarsin

source: If set to true, then file manager will draw the icons on the desktop.
uz: Agar bu parametr yoqilsa, fayl boshqaruvchisi ish stolida belgilarni (ikonkalarni) aks ettiradi.

source: List of breaks that are currently enabled
uz: Hozirda yoqilgan tanaffuslar roʻyxati

source: Time between breaks
uz: Tanaffuslar oraliq vaqti

source: The time between rest breaks, in seconds.
uz: Tanaffuslar oraligʻidagi vaqt, sekundlarda.

source: Duration of each break
uz: Har bir tanaffusning davomiyligi

source: The duration of each rest break, in seconds.
uz: Har bir tanaffusning davomiyligi, sekundlarda.

source: Amount to delay break if requested
uz: Agar soʻralsa, tanaffusni qanchaga kechiktirish vaqti

source: The amount to delay taking the break by, if the user requests a delay, in seconds.
uz: Agar foydalanuvchi tanaffusni kechiktirishni soʻrasa, uni necha sekundga surish mumkin boʻlgan vaqt miqdori.

source: Fade screen during breaks
uz: Tanaffuslar vaqtida ekran yorugʻligini pasaytirish

source: True to fade the screen during rest breaks.
uz: Dam olish paytida ekranning asta-sekin qorayishini yoqish uchun "true' qiymatini bering.

source: Lock screen during breaks
uz: Tanaffuslar vaqtida ekranni qulflash

source: True to lock the screen during rest breaks.
uz: Dam olish paytida ekranni qulflash uchun "true" qiymatini bering.

source: Play sound when a break finishes
uz: Tanaffus tugagach ovoz chiqarish

source: True to play a sound when a break finishes.
uz: Tanaffus tugagach signal berilishini faollashtirish uchun "true" (rost) qiymatini bering.

source: Notify when a break is due
uz: Tanaffus vaqti kelganini bildirish

source: True to emit a notification when a break is due to start.
uz: Tanaffus boshlanishidan oldin ogohlantirish berishni faollashtirish uchun "true" (rost) qiymatini kiriting.

source: Notify when a break is upcoming
uz: Tanaffus vaqti yaqinlashayotganida ogohlantirish

source: True to emit a notification a few minutes before a break is due.
uz: Tanaffusdan bir necha daqiqa oldin ogohlantirish uchun "true" (rost) qiymatini qoʻllang.

source: Notify when a break is overdue
uz: Tanaffus kechiksa ogohlantirish

source: True to emit a notification when a break is overdue.
uz: Dam olish vaqti oʻtib ketganida bildirishnoma koʻrsatish uchun "true" (rost) qiymatini qoʻllang.
