Repository: uzbek-net/dictionary
Catalog: gnome/49/gsettings-desktop-schemas.gnome-49.*.po
Languages: uz

source: True to show a prominent countdown shortly before a break is due.
uz: Tanaffus yaqinlashganda taymerni koʻrsatish uchun "true" (rost) qiymatini qoʻllang.

source: Show the week date in the calendar
uz: Taqvimda hafta sanasini koʻrsatish

source: If true, display the ISO week date in the calendar.
uz: Agar "true" (rost) qoʻllansa, taqvim ichida ISO hafta sanasi koʻrsatilsin.

source: Automatically update timezone
uz: Vaqt mintaqasini avtomatik yangilash

source: Whether to automatically update the timezone using geolocation.
uz: Vaqt mintaqasini joylashuv orqali avtomatik yangilash kerakmi.

source: Default calendar
uz: Standart taqvim

source: Default calendar application DEPRECATED: This key is deprecated and ignored. The preferred calendar application is the application handling the text/calendar mime type.
uz: Standart taqvim ilovasi ESKIRGAN: Ushbu kalit eskirgan va e'tiborga olinmaydi. Tavsiya etilgan taqvim ilovasi esa text/calendar mime turini boshqaradigan ilovadir.

source: Calendar needs terminal
uz: Taqvim terminalni talab qiladi

source: Whether the default calendar application needs a terminal to run. DEPRECATED: This key is deprecated and ignored. The preferred calendar application is the application handling the text/calendar mime type, whether it needs a terminal is taken from its desktop file.
uz: Standart taqvim ilovasi ishga tushishi uchun terminalga ehtiyoj bormi. ESKIRGAN: Ushbu kalit eskirgan va e'tiborga olinmaydi. Tavsiya etilgan taqvim ilovasi text/calendar mime turini boshqaradigan ilova, terminalga ehtiyoj bor-yoʻqligi esa uning desktop faylidan olinadi.

source: Default tasks
uz: Standart vazifalar

source: Default tasks application.
uz: Standart vazifalar ilovasi.

source: Tasks needs terminal
uz: Vazifalar terminalni talab qiladi

source: Whether the default tasks application needs a terminal to run.
uz: Standart vazifalar ilovasi ishga tushishi uchun terminalga ehtiyoj bormi.

source: Terminal application
uz: Terminal ilovasi

source: Terminal program to use when starting applications that require one. DEPRECATED: This key is deprecated and ignored. The default terminal is handled in GIO.
uz: Terminal talab qiladigan ilovalarni ishga tushirishda foydalaniladigan terminal dasturi. ESKIRGAN: Bu kalit eskirgan va e'tiborga olinmaydi. Standart terminal GIO tomonidan boshqariladi.

source: Exec Arguments
uz: Ishga tushirish argumentlari

source: Argument used to execute programs in the terminal defined by the “exec” key. DEPRECATED: This key is deprecated and ignored. The default terminal and how to invoke it is handled in GIO.
uz: “Exec” kaliti orqali belgilangan terminalda dasturlarni ishga tushirish uchun ishlatiladigan argument. ESKIRGAN: Bu kalit eskirgan va e'tiborga olinmaydi. Standart terminal va uni qanday ishga tushirish GIO tomonidan boshqariladi.

source: Current input source
uz: Hozirgi kiritish manbai

source: The zero-based index into the input sources list specifying the current one in effect. The value is automatically capped to remain in the range [0, sources_length) as long as the sources list isn’t empty. DEPRECATED: This key is deprecated and ignored.
uz: Joriy tanlangan kiritish manbasining nolga asoslangan indeksi. Qiymat avtomatik ravishda [0, sources_length) oraliqda qolish uchun cheklab qoʻyiladi, agar manbalar roʻyxati boʻsh boʻlmasa. ESKIRGAN: Bu kalit eskirgan va e’tiborga olinmaydi.

source: List of input sources
uz: Kiritish qurilmalari roʻyxati

source: List of input source identifiers available. Each source is specified as a tuple of 2 strings. The first string is the type and can be one of “xkb” or “ibus”. For “xkb” sources the second string is “xkb_layout+xkb_variant” or just “xkb_layout” if a XKB variant isn’t needed. For “ibus” sources the second string is the IBus engine name. An empty list means that the X server’s current XKB layout and variant won’t be touched and IBus won’t be used.
uz: Mavjud kiritish manbalari identifikatorlarining roʻyxati. Har bir manba 2 ta satrdan iborat tuple (oʻzgarmas roʻyxat) sifatida koʻrsatilgan. Birinchi satr tur boʻlib, "xkb" yoki "ibus" dan biri boʻlishi mumkin. "xkb" manbalari uchun ikkinchi satr "xkb_layout+xkb_variant" yoki agar XKB varianti kerak boʻlmasa faqat "xkb_layout" boʻladi. "ibus" manbalari uchun ikkinchi satr IBus dvigatelining nomi. Boʻsh roʻyxat X serverning joriy XKB tartibi va variantiga tegmaslikni va IBus ishlatilmasligini bildiradi.

source: List of most recently used input sources
uz: Eng soʻnggi ishlatilgan kiritish manbalari roʻyxati

source: List of most recently used input sources. The value is in the same format as the available sources list.
uz: Eng soʻnggi ishlatilgan kiritish manbalari roʻyxati. Qiymat mavjud manbalar roʻyxati bilan bir xil formatda.

source: List of XKB options
uz: XKB parametrlari roʻyxati

source: List of XKB options. Each option is an XKB option string as defined by xkeyboard-config’s rules files.
uz: XKB parametrlar roʻyxati. Har bir parametr — bu xkeyboard-config qoidalar faylida belgilangan XKB parametr satridir.

source: XKB model to use
uz: Foydalaniladigan XKB modeli

source: The XKB model to use. The value is the same identifier as defined by xkeyboard-config’s geometry files.
uz: Foydalaniladigan XKB modeli. Qiymat xkeyboard-configʻning geometriya fayllarida belgilangan identifikator bilan bir xil boʻladi.

source: Show all installed input sources
uz: Barcha oʻrnatilgan kiritish manbalarini koʻrsatish

source: Makes all installed input sources available for choosing in System Settings.
uz: Oʻrnatilgan barcha kiritish usullarini Tizim Sozlamalarida tanlash imkoniyatini yaratadi.

source: Use different input sources for each window
uz: Har bir oyna uchun alohida kiritish usullarini ishlatish

source: When enabled, input sources get attached to the currently focused window when activated.
uz: Agar yoqilgan boʻlsa, kiritish usullari ishga tushirilganda hozirgi aktiv oynaga bogʻlanadi.

source: Enable Toolkit Accessibility
uz: Toolkitning maxsus imkoniyatlarini yoqish

source: Whether toolkits should load accessibility related modules.
uz: Toolkitlar maxsus imkoniyatlarga oid modullarni yuklash kerakmi.

source: Enable Animations
uz: Animatsiyani yoqish

source: Whether animations should be displayed. Note: This is a global key, it changes the behaviour of the window manager, the panel etc.
uz: Animatsiyalarni namoyish qoʻllansinmi. Diqqat: Bu global sozlama, u oyna menejeri va panel kabi elementlarning ishlashini oʻzgartiradi.

source: Menus Have Tearoff
uz: Menyularni alohida oynalarga aylantirish mumkin boʻlsin

source: Whether menus should have a tearoff.
uz: Menyularni alohida oynalarga aylantirish mumkin boʻlsinmi.

source: Can Change Accels
uz: Accelsni oʻzgartirish imkoni bor

source: Whether the user can dynamically type a new accelerator when positioned over an active menuitem.
uz: Foydalanuvchi faol menyu punktining ustida boʻlganida yangi tezlashtirilgan tugmani dinamik ravishda yozishi mumkinmi.

source: Toolbar Style
uz: Asboblar paneli (ToolBar) koʻrinishi

source: Toolbar Style. Valid values are “both”, “both-horiz”, “icons”, and “text”.
uz: Asboblar paneli uslubi. Yaroqli qiymatlar: “both” (ikkalasi), “both-horiz” (ikkalasi gorizontal), “icons” (belgilar) va “text” (matn).

source: Menubar Detachable
uz: Menyular panelini ajratib olish imkoniyati

source: Whether the user can detach menubars and move them around.
uz: Foydalanuvchi menyu panellarini ajratib boshqa joyga oʻtkaza oladimi.

source: Toolbar Detachable
uz: Asboblar panelini ajratib olish imkoniyati

source: Whether the user can detach toolbars and move them around.
uz: Foydalanuvchi asboblar panellarini ajratib boshqa joyga oʻtkaza oladimi.

source: Toolbar Icon Size
uz: Asboblar paneli belgilarining oʻlchami

source: Size of icons in toolbars, either “small” or “large”.
uz: Asboblar panellaridagi belgilar oʻlchami, “small” yoki “large”.

source: Cursor Blink
uz: Kurson Miltillashi

source: Whether the cursor should blink.
uz: Kurson miltillashi kerakmi.

source: Cursor Blink Time
uz: Kursorning Miltillash Vaqti

source: Length of the cursor blink cycle, in milliseconds.
uz: Kursor miltillash davrining davomiyligi, millisekundlarda.

source: Cursor Blink Timeout
uz: Kursor miltillash taym-auti

source: Time after which the cursor stops blinking, in seconds.
uz: Kursor miltillashdan toʻxtaydigan vaqt, sekundlarda.

source: Icon Theme
uz: Belgi Mavzusi

source: Icon theme to use for the panel, nautilus etc.
uz: Panel, Nautilus kabi dasturlar uchun qoʻllaniladigan belgilar mavzusi.

source: Gtk+ Theme
uz: Gtk+ Mavzusi

source: Basename of the default theme used by gtk+.
uz: Bu gtk+ tomonidan ishlatiladigan standart mavzuning asosiy nomi.

source: Gtk+ Keybinding Theme
uz: Gtk+ Klaviatura Kombinatsiyalari Mavzusi

source: Basename of the default keybinding theme used by gtk+.
uz: Bu gtk+ tomonidan qoʻllaniladigan standart klaviatura kombinatsiyalari mavzusining asosiy nomi.

source: Default font
uz: Standart shrift

source: Name of the default font used by gtk+.
uz: Standart shriftning nomi, gtk+ uni ishlatadi.

source: Directories with avatar faces
uz: Avatar rasmlari boʻlgan jildlar

source: Directories to override the default avatar faces installed by gnome-control-center.
uz: Jildlar gnome-control-center oʻrnatgan standart avatar suratlari oʻrniga ishlatiladi.

source: Text scaling factor
uz: Matnni masshtablash koeffitsiyenti

source: Factor used to enlarge or reduce text display, without changing font size.
uz: Shriftning kattaligini oʻzgartirmasdan, matnning aks etishini kattalashtirish yoki kichraytirish uchun ishlatiladigan faktor.

source: Window scaling factor
uz: Oyna oʻlchamini kattalashtirish omili

source: Integer factor used to scale windows by. For use on high-dpi screens. 0 means pick automatically based on monitor.
uz: Oynalarni masshtablash uchun ishlatiladigan butun son koeffitsienti. Bu yuqori aniqlikdagi (hiDPI) ekranlar uchun ishlatiladi. 0 boʻlsa, monitor asosida avtomatik tanlanadi.

source: GTK IM Preedit Style
uz: GTK matn kiritish uslubini oldindan koʻrsatish uslubi

source: Name of the GTK+ input method Preedit Style used by gtk+.
uz: GTK+ tomonidan ishlatiladigan Preedit uslubining nomi.

source: GTK IM Status Style
uz: GTK IM holat uslubi

source: Name of the GTK+ input method Status Style used by gtk+.
uz: GTK+ kirish usuli nomi va GTK+ tomonidan ishlatiladigan holat uslubi.

source: GTK IM Module
uz: GTK IM moduli

source: Name of the input method module used by GTK+.
uz: GTK+ tomonidan ishlatiladigan kirish usuli moduli nomi.

source: Document font
uz: Hujjat shrifti

source: Name of the default font used for reading documents.
uz: Hujjatlarni oʻqish uchun ishlatiladigan standart shrift nomi.

source: Monospace font
uz: Monospace shrift

source: Name of a monospaced (fixed-width) font for use in locations like terminals.
uz: Terminal kabi joylarda ishlatish uchun moʻljallangan monospace shrifti nomi.

source: Menubar accelerator
uz: Menyular panelining klaviatura kombinatsiyasi

source: Keyboard shortcut to open the menu bars.
uz: Menyular panelini ochish uchun tugmalar kombinatsiyasi.

source: Cursor theme
uz: Kursor mavzusi

source: Cursor theme name. Used only by Xservers that support the Xcursor extension.
uz: Kursor mavzusining nomi. Faqat Xcursor kengaytmasini qoʻllab-quvvatlaydigan Xserverlar tomonidan ishlatiladi.

source: Cursor size
uz: Kurson oʻlchami

source: Size of the cursor used as cursor theme.
uz: Kursor mavzusi sifatida ishlatiladigan kursorning oʻlchami.

source: Timeout before click repeat
uz: Bosish takrorlanishidan oldingi taym-aut

source: Timeout in milliseconds before a click starts repeating (on spinner buttons for example).
uz: Bosish takrorlanishi boshlanishidan oldingi taym-aut, millisekundlarda (masalan, spinner tugmalarida).

source: Timeout between click repeats
uz: Bosish takrorlanishlari orasidagi taym-aut

source: Timeout in milliseconds between repeated clicks when a button is left pressed.
uz: Tugma chapga bosib turilganda takroriy bosishlar orasidagi taym-aut, millisekundlarda.

source: Palette used in the color selector
uz: Rang tanlashda ishlatiladigan palitra

source: Palette used in the color selector as defined by the “gtk-color-palette” setting
uz: Rang tanlagichda ishlatiladigan palitra, “gtk-color-palette” sozlamasi orqali belgilangan

source: List of symbolic names and color equivalents
uz: Ramziy nomlar va rang ekvivalentlari roʻyxati

source: A “\n” separated list of “name:color” as defined by the “gtk-color-scheme” setting
uz: gtk-color-scheme” sozlamasi boʻyicha aniqlangan “name:color” formatidagi “\n” bilan ajratilgan roʻyxat

source: '24h'
uz: '24h' (24 soat)

source: Whether the clock displays in 24h or 12h format
uz: Soatning 24 yoki 12 soatlik formatda koʻrsatilishini tanlash

source: Whether the clock shows seconds
uz: Soatda soniyalar ham koʻrsatilsinmi

source: If true, display seconds in the clock.
uz: Agar bu sozlama yoqilgan boʻlsa, soatda soniyalar ham koʻrsatiladi.

source: Show date in clock
uz: Soat bilan sanani ham koʻrsatish

source: If true, display date in the clock, in addition to time.
uz: Agar bu sozlama yoqilgan boʻlsa, soatda vaqt bilan birga sana ham aks ettirilsin.

source: Show weekday in clock
uz: Soat bilan hafta kunlarini ham koʻrsatish

source: If true, display weekday in the clock, in addition to time.
uz: Agar bu sozlama yoqilgan boʻlsa, soatda vaqt bilan birga hafta kuni ham aks ettirilsin.

source: Enable hot corners
uz: Faol burchaklarni yoqish

source: If true, the activities overview can be accessed by moving the mouse to the top-left corner.
uz: Agar bu sozlama yoqilgan boʻlsa, sichqonchani ekraning yuqori chap qismiga surish orqali faolliklar menyusi ochiladi.

source: Show battery percentage
uz: Batareya foizini koʻrsatish

source: If true, display battery percentage in the status menu, in addition to the icon.
uz: Agar bu sozlama yoqilgan boʻlsa, holat panelida ikonka bilan birga batareya zaryadining foizini ham aks ettirish.

source: Enable the primary paste selection
uz: Birlamchi joylashtirish tanlovini faollashtirish

source: If true, gtk+ uses the primary paste selection, usually triggered by a middle mouse button click.
uz: Agar bu sozlama yoqilgan boʻlsa, gtk+ birlamchi joylashtirishni ishlatadi, uni koʻpincha sichqonchaning oʻrtadagi tugmasini bosish faollashtiradi.

source: Allow overlay scrolling
uz: Ustki qatlamni scroll qilishga ruxsat berish

source: Whether scrollbars should be overlayed as indicators. Depending on input devices in use, permanent scrollbars may still be displayed.
uz: Scroll chiziqlari indikator sifatida ustma-ust (qoplangan) koʻrsatilishi kerakmi-yoʻqmi. Foydalanilayotgan kiritish qurilmalariga qarab, doimiy scroll chiziqlari ham koʻrinishi mumkin.

source: Highlights the current location of the pointer.
uz: Kursorni hozirgi turgan oʻrnini ajratib koʻrsatadi.

source: If true, pressing a key will highlight the current pointer location on screen.
uz: Agar bu sozlama yoqilgan boʻlsa, klaviaturadagi tugmani bosish sichqoncha kursorining hozirgi turgan oʻrnini ekranda ajratib koʻrsatadi.

source: The type of antialiasing to use when rendering fonts. Possible values are: “none” for no antialiasing, “grayscale” for standard grayscale antialiasing, and “rgba” for subpixel antialiasing (LCD screens only).
uz: Shriftlarni renderlashda ishlatiladigan antialiasing turi. Mumkin boʻlgan qiymatlar: “none” antialiasing ishlatilmaydi, “grayscale” standart grayscale antialiasing, va “rgba” subpixel antialiasing (faqat LCD ekranlar uchun).

source: The type of hinting to use when rendering fonts. Possible values are: “none” for no hinting and “slight” for fitting only to the Y-axis like Microsoft’s ClearType, DirectWrite and Adobe’s proprietary font rendering engine. Ignores native hinting within the font, generates hints algorithmically. Used on Ubuntu by default. Recommended. The meaning of “medium” and “full” depends on the font format (.ttf, .otf, .pfa/.pfb) and the installed version of FreeType. They usually try to fit glyphs to both the X and the Y axis (except for .otf: Y-only). This can lead to distortion and/or inconsistent rendering depending on the quality of the font, the font format and the state of FreeType’s font engines.
uz: Shriftlarni renderlashda ishlatiladigan hinting turi. Mumkin boʻlgan qiymatlar: “none” — hinting ishlatilmaydi va “slight” — faqat Y-oʻqi boʻyicha moslashtirish, bu Microsoft’ning ClearType, DirectWrite va Adobe’ning oʻziga xos shrift renderlash tizimi kabi ishlaydi. Bu shriftning oʻzidagi hintingni e'tiborsiz qoldiradi va hintlarni algoritmik tarzda yaratadi. Ubuntu’da standart tarzda ishlatiladi. Tavsiya etiladi. “Medium” va “full”ning ma'nosi shrift formati (.ttf, .otf, .pfa/.pfb) va oʻrnatilgan FreeType versiyasiga bogʻliq. Ular odatda belgilarga X va Y oʻqlariga moslashtirishga harakat qiladi (lekin .otf formatida: faqat Y-oʻqi). Bu shriftning sifati, shrift formati va FreeType shrift dvigatelining holatiga qarab, deformatsiya va/yoki tutarsiz renderlashga olib kelishi mumkin.

source: RGBA order
uz: RGBA tartibi

source: The order of subpixel elements on an LCD screen; only used when antialiasing is set to “rgba”. Possible values are: “rgb” for red on left (most common), “bgr” for blue on left, “vrgb” for red on top, “vbgr” for red on bottom.
uz: LCD ekrandagi subpiksel elementlarining joylashuvi; faqat antialiasing “rgba” holatida boʻlganda qoʻllaniladi. Quyidagi qiymatlar mavjud: chap tomonda qizil uchun “rgb” (eng keng tarqalgan), chap tomonda koʻk uchun “bgr”, yuqori qismda qizil uchun “vrgb”, pastki qismda qizil uchun “vbgr”.

source: Color scheme
uz: Rang sxemasi

source: The preferred color scheme for the user interface. Valid values are “default”, “prefer-dark”, “prefer-light”.
uz: Foydalanuvchi interfeysi uchun tanlangan ranglar mavzusi. Mumkin boʻlgan qiymatlar: “default” (standart), “prefer-dark” (qorongʻu), “prefer-light” (yorugʻ).

source: Font rendering
uz: Shriftni renderlash

source: Preference to indicate whether font rendering should follow the low-level `font-hinting` and `font-antialiasing` and `font-rgba-order` settings, or take environmental factors such as screen resolution and scaling into account. Possible values are: "manual" for respecting the low-level settings, or "automatic" for letting the toolkit make its own decisions.
uz: Shriftlarni renderlashda past darajadagi font-hinting, font-antialiasing va font-rgba-order sozlamalariga rioya qilish yoki ekranning rezolyutsiyasi va oʻlchamini hisobga olish kerakligini belgilaydigan afzallik. Mumkin boʻlgan qiymatlar: "manual" past darajadagi sozlamalarga rioya qilish, yoki "automatic" vositaning oʻz qarorlarini qabul qilishiga ruxsat berish.

source: Accent color
uz: Aksent rangi

source: The preferred accent color for the user interface. Valid values are "blue", "teal", "green", "yellow", "orange", "red", "pink", "purple", "slate".
uz: Foydalanuvchi interfeysi uchun tanlangan asosiy rang. Mumkin boʻlgan qiymatlar: "blue", "teal", "green", "yellow", "orange", "red", "pink", "purple", "slate".

source: Disable command line
uz: Buyruq satrini oʻchirish

source: Prevent the user from accessing the terminal or specifying a command line to be executed. For example, this would disable access to the panel’s “Run Application” dialog.
uz: Foydalanuvchining terminalga kirishiga yoki bajarilishi kerak boʻlgan buyruq satrini koʻrsatishiga yoʻl qoʻymaslik. Masalan, bu paneldagi “Dastur ishga tushurish” oynasiga kirishni ham oʻchiradi.

source: Disable saving files to disk
uz: Fayllarni diskka saqlashni oʻchirish

source: Prevent the user from saving files to disk. For example, this would disable access to all applications’ “Save as” dialogs.
uz: Foydalanuvchiga fayllarni diskka saqlashni oldini olish. Masalan, bu barcha ilovalarning “Saqlash” oynalariga kirishni oʻchirishni anglatadi.

source: Disable printing
uz: Chop etishni oʻchirish

source: Prevent the user from printing. For example, this would disable access to all applications’ “Print” dialogs.
uz: Foydalanuvchining chop etish imkoniyatini cheklash. Masalan, bu barcha ilovalar uchun "Chop etish" dialoglariga kirishni oʻchiradi.

source: Disable print setup
uz: Chop etishni sozlash imkoniyatini bekor qilish

source: Prevent the user from modifying print settings. For example, this would disable access to all applications’ “Print Setup” dialogs.
uz: Foydalanuvchining chop etish sozlamalarini oʻzgartirish imkoniyatini cheklash. Masalan, bu barcha ilovalar uchun "Chop etish sozlamalari" dialoglariga kirishni oʻchiradi.

source: Disable user switching
uz: Foydalanuvchi hisobini almashtirishni oʻchirish

source: Prevent the user from switching to another account while their session is active.
uz: Foydalanuvchining oʻz sessiyasi faol boʻlgan vaqtda boshqa foydalanuvchi hisobiga oʻtishiga yoʻl qoʻymaslik.

source: Disable lock screen
uz: Ekran qulflashini oʻchirish

source: Prevent the user from locking their screen.
uz: Foydalanuvchiga oʻz ekranini qulflashni taqiqlash.

source: Disable URL and MIME type handlers
uz: URL va MIME turidagi ishlovchilarni oʻchirish

source: Prevent running any URL or MIME type handler applications.
uz: Har qanday URL yoki MIME turidagi ishlovchilarni ishga tushirishni oldini olish.

source: Disable log out
uz: Foydalanuvchi hisobidan chiqishni oʻchirish

source: Prevent the user from logging out.
uz: Foydalanuvchini hisobdan chiqishini oldini olish.

source: Disable user administration
uz: Foydalanuvchi boshqaruvini faolsizlantirish

source: Stop the user from modifying user accounts. By default, we allow adding and removing users, as well as changing other users settings.
uz: Foydalanuvchiga oʻz hisobidan tashqari boshqa foydalanuvchi hisoblarini tahrirlashga yoʻl qoʻymaslik. Odatda, biz foydalanuvchilarni qoʻshish, oʻchirish va boshqa foydalanuvchi hisoblari parametrlarini oʻzgartirishga imkon beramiz.

source: Mount removable storage devices as read-only
uz: Koʻchma xotira qurilmalarini faqat oʻqish (read-only) rejimida ulash

source: Prevent users from writing or modifying files on removable storage devices (i.e. flash disks, mobile phones, cameras).
uz: Foydalanuvchilarga tashqi xotira qurilmalarida (masalan, fleshkalar, mobil telefonlar, fotoapparatlar) fayllarni yozish yoki tahrirlashni taqiqlash.

source: Disable the "Show Password" menu item in password entries.
uz: Parol kiritish maydonlaridagi "Parolni koʻrsatish" menyu elementini oʻchirish.

source: Whether to automatically mount media
uz: Mediani avtomatik ravishda ulash kerakmi

source: If set to true, then Nautilus will automatically mount media such as user-visible hard disks and removable media on start-up and media insertion.
uz: Agar bu sozlama yoqilgan boʻlsa, Nautilus dasturi ishga tushganda va yangi media (masalan, flesh disk) ulanganida foydalanuvchi koʻra oladigan qattiq disklar va olinadigan qurilmalarni oʻz-oʻzidan ulab qoʻyadi.

source: Whether to automatically open a folder for automounted media
uz: Avtomatik ravishda ulangan media uchun papkani avtomatik ravishda ochish kerakmi

source: If set to true, then Nautilus will automatically open a folder when media is automounted. This only applies to media where no known x-content/* type was detected; for media where a known x-content type is detected, the user configurable action will be taken instead.
uz: Agar bu sozlama yoqilgan boʻlsa, Nautilus media avtomatik tarzda ulanganida papkani oʻz-oʻzidan ochadi. Bu faqat aniqlanmagan x-content/* turdagi mediaga taalluqli; agar ma'lum x-content turi aniqlansa, foydalanuvchi belgilagan harakat bajariladi.
