Repository: uzbek-net/dictionary
Catalog: gnome/49/gsettings-desktop-schemas.gnome-49.*.po
Languages: uz

source: Never prompt or autorun/autostart programs when media are inserted
uz: Qurilma ulanganda hech qanday soʻrov chiqarmaslik va dasturlarni avtomatik ravishda ishga tushirmaslik/avtomatik boshlamaslik

source: If set to true, then Nautilus will never prompt nor autorun/autostart programs when a medium is inserted.
uz: Agar bu sozlama yoqilgan boʻlsa, Nautilus dasturi media (masalan, flesh disk) ulanganida hech qanday soʻrov chiqarmaydi va dasturlarni avtomatik ravishda ishga tushirmaydi/avtomatik boshlamaydi.

source: List of x-content/* types where the preferred application will be launched
uz: Qaysi x-content/* turlari uchun tanlangan dastur avtomatik ravishda ochilishining roʻyxati

source: List of x-content/* types for which the user have chosen to start an application in the preference capplet. The preferred application for the given type will be started on insertion on media matching these types.
uz: Foydalanuvchi sozlamalar panelida dasturni avtomatik ravishda ochishni belgilagan x-content/* turlarining roʻyxati. Agar shunday turdagi media (masalan, flesh diskda rasm boʻlsa) ulansa, shu tur uchun tanlangan dastur avtomatik ravishda ishga tushiriladi.

source: List of x-content/* types set to “Do Nothing”
uz: Qaysi x-content/* turlari uchun "Hech narsa qilmaslik" amali tanlanganining roʻyxati

source: List of x-content/* types for which the user have chosen “Do Nothing” in the preference capplet. No prompt will be shown nor will any matching application be started on insertion of media matching these types.
uz: Foydalanuvchi sozlamalar panelida “Hech narsa qilmaslik” amalini belgilagan x-content/* turlarining roʻyxati. Agar shunday turdagi media (masalan, ma'lum bir formatdagi video) ulansa, hech qanday soʻrov chiqmaydi va shu turga mos keladigan dastur avtomatik ravishda ochilmaydi.

source: List of x-content/* types set to “Open Folder”
uz: Qaysi x-content/* turlari uchun "Jildni ochish" amali tanlanganining roʻyxati.

source: List of x-content/* types for which the user have chosen “Open Folder” in the preferences capplet. A folder window will be opened on insertion of media matching these types.
uz: Foydalanuvchi sozlamalar panelida “Papkani ochish” amalini belgilagan x-content/* turlarining roʻyxati. Agar shunday turdagi media (masalan, turli xil hujjatlar saqlangan flesh disk) ulansa, uning ichidagi fayllarni koʻrsatadigan papka oynasi avtomatik ravishda ochiladi.

source: Show notification banners
uz: Bildirishnoma bannerlarini koʻrsatish

source: Whether notification banners are visible for application notifications.
uz: Dastur bildirishnomalari uchun xabarnoma bannerlari koʻrinib turishi kerakmi.

source: Show notifications in the lock screen
uz: Qulflangan ekranda xabarnomalarni koʻrsatish

source: Whether notifications are shown in the lock screen or not.
uz: Bildirishnomalar qulflangan ekranda koʻrsatilsinmi.

source: Application ID
uz: Ilova ID'si

source: The application that this policy is for.
uz: Bu qoida qaysi ilova uchun.

source: Enable notifications
uz: Bildirishnomalarni yoqish

source: Whether notifications are globally enabled for this application.
uz: Ushbu ilova uchun xabarnomalar butun tizim boʻylab faollashtirilganmi.

source: Enable sound alerts
uz: Tovushli bildirishnomalarni faollashtirish

source: Whether notifications should be accompanied by sound alerts.
uz: Bildirishnomalar ovozli ogohlantirishlar bilan birga boʻlishi kerakmi.

source: Whether notification banners for this application are shown or not. Does not affect clicking on message tray buttons.
uz: Ushbu ilova uchun xabarnoma bannerlari namoyish qilinsinmi yoki yoʻqmi. Bu xabar qutisi tugmalarini bosishga aloqador emas.

source: Force automatic expanding of banners
uz: Bannerlarni avtomatik ravishda yoyishga majbur qilish

source: Whether notifications from this application are expanded automatically when in banner mode.
uz: Bu dasturdan kelgan bildirishnomalar banner rejimida boʻlganda avtomatik ravishda kengaytirilishi kerakmi.

source: Show in the lock screen
uz: Qulflangan ekranda koʻrsatish

source: Whether notifications from this application are shown when the screen is locked.
uz: Ushbu ilovadan kelgan bildirishnomalar ekran qulflanganda koʻrsatilsinmi.

source: Show details in the lock screen
uz: Qulflangan ekranda tafsilotlarni koʻrsatish

source: Whether the summary and body of notifications from this application will be visible in the locked screen.
uz: Bu ilovadan kelgan bildirishnomalarning qisqacha mazmuni va asosiy qismi qulflangan ekranda koʻrinib turadimi.

source: Whether edge scrolling is enabled
uz: Scroll bar bilan scroll qilish yoqilganmi

source: When enabled, touchpads that support edge scrolling will have that feature enabled.
uz: Agar faollashtirilsa, scroll bar gʻildiratish imkoniyatiga ega boʻlgan touchpadlar bu funksiyani ishlatishi mumkin boʻladi.

source: Whether two-finger scrolling is enabled
uz: Ikki barmoq bilan gʻildiratish yoqilganmi

source: When enabled, touchpads that support two-finger scrolling will have that feature enabled.
uz: Yoqilganda, ikki barmoq bilan aylantirishni qoʻllab-quvvatlaydigan touchpadlar bu funksiyaga ega boʻladi.

source: Whether to disable the touchpad while typing
uz: Yozish vaqtida touchpadni oʻchirish kerakmi

source: When enabled, touchpads will be disabled while typing on the keyboard.
uz: Yoqilganda, klaviaturada yozish vaqtida touchpadlar oʻchiriladi.

source: Enable mouse clicks with touchpad
uz: Touchpad orqali sichqoncha bosishlarini yoqish

source: Set this to TRUE to be able to send mouse clicks by tapping on the touchpad.
uz: Touchpadga teginish orqali sichqoncha bosishlarini bajarish uchun bu sozlamaga TRUE qiymatni qoʻllang.

source: Tap Button Map
uz: Teginish orqali bosish tugmalarining moslashuvi

source: Defines the mapping between the number of fingers and touchpad buttons. The default is to have a 1, 2 and 3 finger tap to map to the left, right and middle button ("lrm"), respectively.
uz: Bu sozlama barmoqlar soni va touchpadning qaysi tugmasi bosilishiga mos kelishini aniqlaydi. Odatda, bir barmoq bilan teginish chap tugma, ikki barmoq bilan teginish oʻng tugma va uch barmoq bilan teginish oʻrta tugma vazifasini bajaradi ("lrm" qisqartmasi bilan belgilanadi).

source: Enable tap-and-drag with touchpad
uz: Touchpad yordamida teginib sudrash imkoniyatini ishga tushirish

source: Set this to TRUE to be able to start a drag by tapping and immediately moving the finger that’s now pressed on the touchpad.
uz: Touchpadga teginib, keyin bosib turgan barmoqni darhol siljitish orqali sudrab olib oʻtishni boshlash uchun buni TRUE ga oʻzgartiring.

source: Enable tap-and-drag-lock with touchpad
uz: Touchpad yordamida teginib sudrashni qulflash imkoniyatini ishga tushirish

source: Set this to TRUE to lock the dragging process within a short timeout when the finger is lifted on the touchpad and the tap-and-drag setting is enabled.
uz: Agar teginish va sudrash funksiyasi faol boʻlsa, touchpaddan barmoq olingandan keyin qisqa vaqt ichida sudrashni qulflash uchun buni TRUE ga oʻzgartiring.

source: Touchpad enabled
uz: Touchpad yoqilgan

source: Defines the situations in which the touchpad is enabled.
uz: Touchpadning qaysi vaziyatlarda faol boʻlishini aniqlaydi.

source: Touchpad button orientation
uz: Touchpad tugmalarining joylashuvi

source: Swap left and right mouse buttons for left-handed mice with “left”, “right” for right-handed, “mouse” to follow the mouse setting.
uz: Sichqoncha tugmalarini almashtirish: chapqoʻl foydalanuvchilar uchun “left”, oʻngqoʻl foydalanuvchilar uchun “right”, yoki sichqoncha sozlamasi asosida “mouse”.

source: Acceleration profile
uz: Tezlanish profili

source: Acceleration profile used for connected touchpads. The acceleration profile can be set to either default (“default”) which uses the default acceleration profile for each device, flat (“flat”), which accelerates by a device specific constant factor derived from the configured pointer speed, or adaptive (“adaptive”) which adapts the acceleration depending on the mouse movement. If a touchpad doesn’t support the configured profile, “default” will be used.
uz: Ulangan touchpadlar uchun ishlatiladigan tezlanish profili. Tezlanish profilini quyidagi qiymatlarga oʻrnatish mumkin: “default” (har bir qurilma uchun standart tezlanish profilini qoʻllaydi), “flat” (sozlangan koʻrsatkich tezligidan kelib chiqqan qurilmaga xos doimiy omilga koʻpaytirib tezlashtiradi) yoki “adaptive” (sichqoncha harakatiga moslashuvchan tezlanish). Agar sensorli panel sozlangan profilni qoʻllab-quvvatlamasa, “default” ishlatiladi.

source: Pointer speed
uz: Koʻrsatkich tezligi

source: Pointer speed for the touchpad. Accepted values are in the [-1..1] range (from “unaccelerated” to “fast”). A value of 0 is the system default.
uz: Touchpad uchun koʻrsatkich tezligi. Qabul qilinadigan qiymatlar [-1..1] oraliqda (eng sekindan “tez”gacha). 0 qiymati tizim standartidir.

source: Natural scrolling
uz: Tabiiy ravishda gʻildiratish

source: Set this to TRUE to enable natural (reverse) scrolling for touchpads.
uz: Touchpadlar uchun tabiiy (teskari) aylantirishni yoqish uchun buni TRUE qilib oʻrnating.

source: Click method
uz: Bosish usuli

source: How to generate software-emulated buttons, either disabled (“none”), through specific areas (“areas”), number of fingers (“fingers”) or left as hardware default (“default”).
uz: Dasturiy ta'minot yordamida yaratilgan tugmalarni qanday sozlash mumkin: ularni oʻchirish (“none”), touchpadning ma'lum joylaridan foydalanish (“areas”), barmoqlar soniga qarab (“fingers”) yoki qurilma sozlamalarini saqlab qolish (“default”).

source: Emulate middle click
uz: Oʻrta tugmani emulyatsiya qilish

source: Set this to TRUE to enable middle click during simultaneous left and right click.
uz: Chap va oʻng tugmalarni bir vaqtda bosish vaqtida oʻrta tugmani yoqish uchun buni TRUE qilib oʻrnating.

source: Keyboard repeat
uz: Klaviatura takrori

source: Set this to TRUE to enable keyboard repeat.
uz: Klaviatura takrorini yoqish uchun buni TRUE qilib oʻrnating.

source: Key Repeat Interval
uz: Tugmani takrorlash oraliq vaqti

source: Delay between repeats in milliseconds.
uz: Takrorlashlar orasidagi kechikish millisekundlarda.

source: Initial Key Repeat Delay
uz: Tugma takrorlashining dastlabki kechikish vaqti

source: Initial key repeat delay in milliseconds.
uz: Tugma takrorlashining dastlabki kechikish vaqti millisekundlarda.

source: Remember NumLock state
uz: NumLock holatini eslab qolish

source: When set to true, GNOME will remember the state of the NumLock LED between sessions.
uz: Agar bu sozlama TRUE qilib belgilansa, GNOME NumLock chiroqchasining holatini (yoqilgan yoki oʻchirilganligini) har safar tizimga kirganingizda saqlab qoladi.

source: NumLock state
uz: NumLock holati

source: The remembered state of the NumLock LED.
uz: NumLock chiroqchasining eslab qolingan holati.

source: Mouse button orientation
uz: Sichqoncha tugmalarining yoʻnalishi

source: Swap left and right mouse buttons for left-handed mice.
uz: Chap qoʻllar uchun sichqonchaning chap va oʻng tugmalarining oʻrnini almashtirish.

source: Pointer speed for mice. Accepted values are in the [-1..1] range (from “unaccelerated” to “fast”). A value of 0 is the system default.
uz: Sichqonchalar uchun kursor tezligi. Qabul qilinadigan qiymatlar [-1..1] oraliqda ("unaccelerated" dan “fast”gacha). 0 qiymati tizimning standart tezligidir.

source: Set this to TRUE to enable natural (reverse) scrolling for mice.
uz: Sichqonchalar uchun teskari gʻildiratish funksiyasini faollashtirish uchun buni TRUE ga oʻzgartiring.

source: Acceleration profile used for connected mice. The acceleration profile can be set to either default (“default”) which uses the default acceleration profile for each device, flat (“flat”), which accelerates by a device specific constant factor derived from the configured pointer speed, or adaptive (“adaptive”) which adapts the acceleration depending on the mouse movement. If a mouse doesn’t support the configured profile, “default” will be used.
uz: Ulangan sichqonchalar uchun ishlatiladigan tezlanish profili. Tezlanish profilini quyidagi qiymatlarga oʻrnatish mumkin: “default” (har bir qurilma uchun standart tezlanish profilini ishlatadi), “flat” (sozlangan kursor tezligidan olingan qurilmaga xos doimiy koʻpaytuvchi bilan tezlashtiradi) yoki “adaptive” (sichqoncha harakatiga qarab tezlanishni moslashtiradi). Agar sichqoncha sozlangan profilni qoʻllab-quvvatlamasa, “default” ishlatiladi.

source: Double click time
uz: Ikki marta bosish vaqti

source: Length of a double click in milliseconds.
uz: Ikki marta bosishning uzunligi millisekundlarda.

source: Drag threshold
uz: Sudrab olib oʻtish chegarasi

source: Distance before a drag is started.
uz: Sudrash boshlanishidan oldingi masofa.

source: Drawing tablet mapping
uz: Rasm plansheti xaritasi

source: EDID information of the output the tablet is mapped to. Must be in the format [vendor, product, serial]. ["","",""] relies on automatic mapping.
uz: Planshet xaritalangan chiqishning EDID ma'lumotlari. [Ishlab chiqaruvchi, mahsulot, seriya raqami] formatida boʻlishi kerak. ["", "", ""] avtomatik xaritalashga tayanadi.

source: Tablet mapping
uz: Planshet xaritasi

source: How input affects the pointer on the screen
uz: Kiritilgan ma'lumotlar ekrandagi kursorni qanday boshqarishi

source: Tablet area
uz: Planshet sohasi

source: Dead area padding around the active area, in percentages. Respectively applied to left,right,top and bottom sides.
uz: Aktiv soha atrofidagi sezgir boʻlmagan (oʻlik) zonaning kengligi, foizlarda. Mos ravishda chap, oʻng, yuqori va pastki tomonlarga qoʻllaniladi.

source: Tablet aspect ratio
uz: Planshet tomonlari nisbati

source: Enable this to restrict the tablet area to match the aspect ratio of the output.
uz: Planshet sohasini chiqish qurilmasining tomonlar nisbatiga moslashtirish uchun buni yoqish.

source: Tablet left-handed mode
uz: Planshetning chap qoʻl rejimi

source: Enable this to allow physically rotating the tablet for left-handed setups
uz: Chap qoʻl uchun sozlashda planshetni fizik jihatdan aylantirishga ruxsat berish uchun buni yoqing

source: Stylus pressure curve
uz: Qalam bosimi egri chizigʻi

source: Set this to x1, y1 and x2, y2 of the pressure curve applied to the stylus.
uz: Stilusning bosim sezgirligi egri chizigʻi uchun x1, y1 va x2, y2 qiymatlarini belgilang.

source: Stylus pressure range
uz: Stilus bosim diapazoni

source: Set this to the percentage of the physical pressure range that should map to the logical range.
uz: Jismoniy bosim diapazonining mantiqiy diapazonga qancha foizi mos kelishini foizlarda koʻrsating.

source: Eraser pressure curve
uz: Oʻchirgʻich bosim egri chizigʻi

source: Set this to x1, y1 and x2, y2 of the pressure curve applied to the eraser.
uz: Oʻchirgʻichning bosim sezgirligi egri chizigʻi uchun x1, y1 va x2, y2 qiymatlarini belgilang.

source: Eraser pressure range
uz: Oʻchirgʻich bosim diapazoni

source: Button action
uz: Tugma vazifasi

source: Stylus button action, this button is located along the pen handle.
uz: Stilus tugmasining harakati, bu tugma qalam dastasi boʻylab joylashgan.

source: Secondary button action
uz: Ikkinchi darajali tugma vazifasi

source: Secondary stylus button action, this button is located along the pen handle on some styli like the Grip Pen. Other styli like the Airbrush Pen or the Inking Pen only have one button, this setting is ineffective on those.
uz: Stilusning ikkinchi yon tugmasining vazifasi, bu tugma Grip Pen kabi ayrim stiluslarning ushlagichi boʻylab joylashgan. Airbrush Pen yoki Inking Pen kabi boshqa stiluslarda faqat bitta tugma boʻlganligi sababli, bu sozlama ularga ta'sir qilmaydi.

source: Tertiary button action
uz: Uchinchi tugmaning vazifasi

source: Tertiary stylus button action, this button is located along the pen handle on some styli like the 3D Pen. Other styli like the Grip Pen only have two buttons, this setting is ineffective on those.
uz: Stilusning uchinchi yon tugmasining vazifasi, bu tugma 3D Pen kabi ayrim stiluslarning ushlagichi boʻylab joylashgan. Grip Pen kabi boshqa stiluslarda faqat ikkita tugma boʻlganligi sababli, bu sozlama ularga ta'sir qilmaydi.

source: Key combination for the primary button
uz: Asosiy tugma uchun klaviatura kombinatsiyasi

source: The keyboard shortcut generated when the button is pressed for custom actions.
uz: Tugma maxsus amallar uchun bosilganda yaratiladigan klaviatura kombinatsiyasi.

source: Key combination for the secondary button
uz: Ikkilamchi tugma uchun klaviatura kombinatsiyasi

source: Key combination for the tertiary button
uz: Uchinchi tugma uchun klaviatura kombinatsiyasi

source: Pad button action type
uz: Pad tugmasi vazifasining turi

source: The type of action triggered by the button being pressed.
uz: Tugma bosilganda ishga tushadigan harakatning turi.

source: Key combination for the custom action
uz: Maxsus amal uchun klaviatura kombinatsiyasi

source: Touchscreen output mapping
uz: Touchpadni chiqish qurilmasiga moslashuvi

source: EDID information of the output the touchscreen is mapped to. Must be in the format [vendor, product, serial]. ["","",""] relies on automatic mapping.
uz: Sensorli ekran ulangan chiqish qurilmasining EDID informatsiyasi. U shaklida boʻlishi kerak. Agar ["", "", ""] qiymati berilsa, avtomatik bogʻlash amalga oshiriladi.

source: Mouse wheel emulation button. 0 to disable the feature.
uz: Sichqoncha gʻildiragini taqlid qiluvchi tugma. Bu funksiyani oʻchirib qoʻyish uchun 0 raqamini qoʻllang.

source: Mouse wheel emulation button lock
uz: Sichqoncha gʻildiragini emulyatsiya qilish tugmasini qulflanishi

source: Set this to TRUE to enable button locking for the wheel emulation button. If enabled, the first click of the button enables scrolling, the second click disables scrolling again.
uz: Sichqoncha gʻildiragini taqlid qilish tugmasi uchun qulflash funksiyasini yoqish uchun buni TRUE ga oʻzgartiring. Agar bu funksiya ishga tushirilsa, tugmani birinchi marta bosish scroll rejimini yoqadi, ikkinchi marta bosish esa uni oʻchiradi.

source: Acceleration profile used for the trackball. The acceleration profile can be set to either default (“default”) which uses the default acceleration profile, flat (“flat”), which accelerates by a device specific constant factor derived from the configured speed, or adaptive (“adaptive”) which adapts the acceleration depending on the movement. If the trackball doesn’t support the configured profile, “default” will be used.
uz: Trekbol uchun qoʻllaniladigan tezlashuv profili. Bu profilni quyidagi koʻrinishlarda sozlash mumkin: “default” (oʻrnatilgan tezlashuv profilini ishlatadi), “flat” (sozlangan tezlikdan kelib chiqqan qurilmaga xos doimiy koeffitsientga koʻpaytirib tezlashtiradi) yoki “adaptive” (harakatga qarab tezlashuvni oʻzgartiradi). Agar trekbol sozlangan profilni qoʻllab-quvvatlamasa, “default” rejimi ishlatiladi.

source: Pointer speed for pointing sticks. Accepted values are in the [-1..1] range (from “unaccelerated” to “fast”). A value of 0 is the system default.
uz: Ishora tayoqchalari uchun kursor tezligi. Qabul qilinadigan qiymatlar [-1 dan 1 gacha] oraliqda (tezlanmaganidan “tez”gacha). 0 qiymati tizimning oʻrnatilgan tezligidir.

source: Acceleration profile used for the pointing stick. The acceleration profile can be set to either default (“default”) which uses the default acceleration profile, flat (“flat”), which accelerates by a device specific constant factor derived from the configured speed, or adaptive (“adaptive”) which adapts the acceleration depending on the movement. If the pointing stick doesn’t support the configured profile, “default” will be used.
uz: Ishora tayoqchasi uchun qoʻllaniladigan tezlashuv profili. Bu profilni quyidagi koʻrinishlarda sozlash mumkin: “default” (oʻrnatilgan tezlashuv profilini ishlatadi), “flat” (sozlangan tezlikdan kelib chiqqan qurilmaga xos doimiy koeffitsientga koʻpaytirib tezlashtiradi) yoki “adaptive” (harakatga qarab tezlashuvni oʻzgartiradi). Agar ishora tayoqchasi sozlangan profilni qoʻllab-quvvatlamasa, “default” rejimi ishlatiladi.

source: Scrolling method
uz: Gʻildiratish (scroll) usuli

source: Scrolling method used for pointing sticks. The scrolling method can be set to either default (“default”) which uses the default method, none (“none”), which disables scrolling, or middle-button (“on-button-down”) which enables scrolling whilst the middle button is held down.
uz: Ishora tayoqchalari uchun qoʻllaniladigan sahifani oʻtkazish usuli. Oʻtkazish usulini quyidagi koʻrinishlarda sozlash mumkin: “default” (oʻrnatilgan usulni ishlatadi), “none” (oʻtkazishni oʻchirib qoʻyadi) yoki “middle-button” (“on-button-down”) (oʻrta tugma bosib turilganda oʻtkazishni faollashtiradi).

source: Controls visibility of personal information
uz: Shaxsiy ma'lumotlarning koʻrinishini boshqaradi

source: If set to true, the system will make an effort to not divulge the user’s identity on screen or on the network.
uz: Agar bu parametr "true" qiymatiga oʻrnatilsa, tizim ekranda yoki internetda foydalanuvchining kimligini koʻrsatmaslik uchun choralar koʻradi.

source: Show full name in the user menu
uz: Foydalanuvchi menyusida toʻliq ismni koʻrsatish

source: Whether the users full name is shown in the user menu or not.
uz: Foydalanuvchi roʻyxatida toʻliq ism aks etadimi yoki yoʻqmi.

source: Whether to remove old files from the trash automatically
uz: Savatdagi eski fayllar avtomatik tarzda oʻchirilsinmi yoki yoʻqmi

source: If TRUE, automatically remove files from the trash when they are older than “old-files-age” days.
uz: Agar TRUE boʻlsa, fayllar “old-files-age” kunidan oshgan boʻlsa, savatdan avtomatik ravishda oʻchiriladi.

source: Whether to remove old temporary files automatically
uz: Eski vaqtinchalik fayllar avtomatik tarzda oʻchirilsinmi yoki yoʻqmi

source: If TRUE, automatically remove temporary files when they are older than “old-files-age” days.
uz: Agar TRUE boʻlsa, vaqtinchalik fayllar “old-files-age” kunidan oshgan boʻlsa, avtomatik ravishda oʻchiriladi.

source: Number of days to keep trash and temporary files
uz: Savatdagi va temp jildidagi fayllarni necha kun saqlash kerak

source: Consider trash and temporary files old after this many days.
uz: Savatdagi va temp papkadagi fayllar necha kundan keyin eski hisoblansin.

source: Whether to remember recently used files
uz: Yaqinda ishlatilgan fayllarni eslab qolinsinmi

source: If FALSE, applications will not remember recently used files.
uz: Agar FALSE boʻlsa, ilovalar yaqinda ishlatilgan fayllarni eslab qolmaydi.

source: Number of days to remember recently used files for
uz: Yaqinda ishlatilgan fayllarni eslab qolish muddati (kunlarda)

source: Recently used files will be remembered for this many days. If set to 0, recent files will not be remembered; if set to -1, they will be retained indefinitely.
uz: Yaqinda ishlatilgan fayllar shuncha kun davomida eslab qolinadi. Agar 0 ga oʻrnatilsa, yaqinda ishlatilgan fayllar esda saqlanmaydi; agar -1 ga oʻrnatilsa, ular cheksiz saqlanadi.

source: Whether to remember application usage
uz: Ilovalardan foydalanish tarixi saqlansinmi

source: If FALSE, application usage will not be monitored and recorded.
uz: Agar FALSE boʻlsa, dasturlardan foydalanish kuzatilmaydi va qayd etilmaydi.

source: Send statistics when applications are removed or installed
uz: Ilovalar oʻchirilganda yoki oʻrnatilganda statistika yuborilsin

source: If FALSE, no anonymous installation or removal information will be sent to the vendor.
uz: Agar FALSE boʻlsa, ishlab chiqaruvchiga oʻrnatish yoki olib tashlash haqida hech qanday ma'lumot joʻnatilmaydi.
