Repository: uzbek-net/dictionary
Catalog: gnome/49/gsettings-desktop-schemas.gnome-49.*.po
Languages: uz

source: The default, true, indicates that a window will be raised whenever its client area or its frame is clicked. Setting this to false means that a window will not be raised if it is clicked on the client area. To raise it, one can click anywhere in the window’s frame, or Super-click on any part of the window. This mode is useful if one uses many overlapping windows.
uz: Standart qiymat — true, bu oynaga (ichki qismiga yoki ramkasiga) bosilganda u yuqoriga koʻtarilishini anglatadi. Agar false qilib qoʻyilsa, oyna faqat ramkaga bosilgandagina yuqoriga koʻtariladi. Ichki qismga oddiy bosish bilan esa koʻtarilmaydi. Biroq istalgan joyga Super tugmasi bilan bosilsa, baribir koʻtariladi. Bu usul bir nechta ustma-ust derazalar bilan ishlaganda qulay.

source: Action on title bar double-click
uz: Sarlavha panelini ikki marta bosganda bajariladigan amal

source: This option determines the effects of double-clicking on the title bar. Current valid options are “toggle-maximize” which will maximize/unmaximize the window, “toggle-maximize-horizontally” and “toggle-maximize-vertically” which will maximize/unmaximize the window in that direction only, “minimize” which will minimize the window, “menu” which will display the window menu, “lower” which will put the window behind all the others, and “none” which will not do anything.
uz: Bu parametr sarlavha satrini ikki marta bosishning ta'sirini belgilaydi. Hozirgi yaroqli variantlar: oynani maksimalallashtirish/tiklash uchun “toggle-maximize”, oynani faqat shu yoʻnalishda maksimalallashtirish/tiklash uchun “toggle-maximize-horizontally” va “toggle-maximize-vertically”, oynani minimallashtirish uchun “minimize”, oyna menyusini koʻrsatish uchun “menu”, oynani boshqa barcha oynalar orqasiga qoʻyish uchun “lower” va hech narsa qilmaslik uchun “none”.

source: Action on title bar middle-click
uz: Sarlavha panelini oʻrta tugma bilan bosganda bajariladigan amal

source: This option determines the effects of middle-clicking on the title bar. Current valid options are “toggle-maximize” which will maximize/unmaximize the window, “toggle-maximize-horizontally” and “toggle-maximize-vertically” which will maximize/unmaximize the window in that direction only, “minimize” which will minimize the window, “menu” which will display the window menu, “lower” which will put the window behind all the others, and “none” which will not do anything.
uz: Bu parametr sarlavha satrini oʻrta tugma bilan bosishning ta'sirini belgilaydi. Hozirgi yaroqli variantlar: oynani maksimalallashtirish/tiklash uchun “toggle-maximize”, oynani faqat shu yoʻnalishda maksimalallashtirish/tiklash uchun “toggle-maximize-horizontally” va “toggle-maximize-vertically”, oynani minimallashtirish uchun “minimize”, oyna menyusini koʻrsatish uchun “menu”, oynani boshqa barcha oynalar orqasiga qoʻyish uchun “lower” va hech narsa qilmaslik uchun “none”.

source: Action on title bar right-click
uz: Sarlavha panelini oʻrta tugma bilan bosganda bajariladigan amal

source: This option determines the effects of right-clicking on the title bar. Current valid options are “toggle-maximize” which will maximize/unmaximize the window, “toggle-maximize-horizontally” and “toggle-maximize-vertically” which will maximize/unmaximize the window in that direction only, “minimize” which will minimize the window, “menu” which will display the window menu, “lower” which will put the window behind all the others, and “none” which will not do anything.
uz: Bu parametr sarlavha satrini oʻng tugma bilan bosishning ta'sirini belgilaydi. Hozirgi yaroqli variantlar: oynani maksimalallashtirish/tiklash uchun “toggle-maximize”, oynani faqat shu yoʻnalishda maksimalallashtirish/tiklash uchun “toggle-maximize-horizontally” va “toggle-maximize-vertically”, oynani minimallashtirish uchun “minimize”, oyna menyusini koʻrsatish uchun “menu”, oynani boshqa barcha oynalar orqasiga qoʻyish uchun “lower” va hech narsa qilmaslik uchun “none”.

source: Automatically raises the focused window
uz: Diqqat markazidagi oynani avtomatik ravishda oldinga chiqarish

source: If set to true, and the focus mode is either “sloppy” or “mouse” then the focused window will be automatically raised after a delay specified by the auto-raise-delay key. This is not related to clicking on a window to raise it, nor to entering a window during drag-and-drop.
uz: Agar bu sozlama "true" ga oʻrnatilgan boʻlsa va fokuslash usuli "sloppy" yoki "mouse" boʻlardan biri boʻlsa, diqqat markazidagi oyna "auto-raise-delay" sozlamasida koʻrsatilgan vaqtdan keyin oʻz-oʻzidan oldinga chiqadi. Bu oynani bosib koʻtarish yoki sudrab olib oʻtish jarayonida oynaga kirish bilan bogʻliq emas.

source: Delay in milliseconds for the auto raise option
uz: Avtimatik oldinga chiqarish opsiyasi uchun millisekundlardagi vaqt oraligʻi

source: The time delay before raising a window if auto-raise is set to true. The delay is given in thousandths of a second.
uz: Agar avtomatik ravishda oldinga chiqarish (auto-raise) funksiyasi yoqilgan boʻlsa, oynani koʻtarishdan oldingi vaqt oraligʻi. Bu vaqt soniyaning mingdan bir qismlarida koʻrsatiladi.

source: Current theme
uz: Joriy mavzu

source: The theme determines the appearance of window borders, titlebar, and so forth. DEPRECATED: This key is deprecated and ignored.
uz: Mavzu oyna chegaralari, sarlavha satri va boshqalarning koʻrinishini belgilaydi. ESKIRGAN: Bu kalit eskirgan va e'tiborga olinmaydi.

source: Use standard system font in window titles
uz: Oyna sarlavhalarida standart tizim shriftidan foydalanish

source: If true, ignore the titlebar-font option, and use the standard application font for window titles.
uz: Agar bu sozlama yoqilgan boʻlsa, "titlebar-font" sozlamasiga ahamiyat bermasdan va oyna nomlari uchun standart dastur shriftini ishlating.

source: Window title font
uz: Oyna sarlavhasi shrifti

source: A font description string describing a font for window titlebars. The size from the description will only be used if the titlebar-font-size option is set to 0. Also, this option is disabled if the titlebar-uses-desktop-font option is set to true.
uz: Oyna sarlavhalari uchun shriftni belgilovchi shrift ta'rifi matni. Ta'rifdagi shrift hajmi faqat "titlebar-font-size" sozlamasi 0 ga teng boʻlganda qoʻllaniladi. Bundan tashqari, agar "titlebar-uses-desktop-font" sozlamasi yoqilgan boʻlsa, bu sozlama ishlamaydi.

source: Number of workspaces
uz: Ish maydonlari soni

source: Number of workspaces. Must be more than zero, and has a fixed maximum to prevent making the desktop unusable by accidentally asking for too many workspaces.
uz: Ish maydonlari soni. U noldan katta boʻlishi shart va tasodifan juda koʻp ish maydoni soʻrab, ish stolini buzib qoʻymaslik uchun qat'iy maksimal miqdori belgilangan.

source: System Bell is Audible
uz: Tizim signal tovushi eshitiladi

source: Determines whether applications or the system can generate audible “beeps”; may be used in conjunction with “visual bell” to allow silent “beeps”.
uz: Dasturlar yoki operatsion tizim eshitiladigan "signal" tovushlarini chiqarishiga ruxsat berish yoki bermaslikni aniqlaydi; ovozsiz "signal"larni yaratish uchun "vizual qoʻngʻiroq" bilan birga ishlatilishi mumkin.

source: Enable Visual Bell
uz: Vizual Signal Turi

source: Turns on a visual indication when an application or the system issues a “bell” or “beep”; useful for the hard-of-hearing and for use in noisy environments.
uz: Ilova yoki tizim "qoʻngʻiroq" yoki "beep" signalini berganda vizual koʻrsatkichni yoqadi; bu eshitishida muammo boʻlgan foydalanuvchilar yoki shovqinli muhitda ishlayotganlar uchun foydali.

source: Visual Bell Type
uz: Vizual Signal Turi

source: Tells the WM how to implement the visual indication that the system bell or another application “bell” indicator has been rung. Currently there are two valid values, “fullscreen-flash”, which causes a fullscreen white-black flash, and “frame-flash” which causes the titlebar of the application which sent the bell signal to flash. If the application which sent the bell is unknown (as is usually the case for the default “system beep”), the currently focused window’s titlebar is flashed.
uz: WM (Window Manager) ga tizim signal ovozi yoki boshqa dastur signal berganda ekranda qanday koʻrinish koʻrsatishni belgilaydi. Hozirda ikkita amal qiluvchi qiymat mavjud: “fullscreen-flash” — butun ekran oq-qora miltillaydi, va “frame-flash” — signal yuborgan dastur oynasining sarlavha paneli miltillaydi. Agar signal yuborgan dastur noma’lum boʻlsa (odatda bu “tizim signal”ida shunday boʻladi), hozir faol oynaning sarlavha paneli miltillaydi.

source: Disable misfeatures that are required by old or broken applications
uz: Eski yoki buzilgan dasturlar talab qiladigan nosoz funksiyalarni oʻchirish

source: Some applications disregard specifications in ways that result in window manager misfeatures. This option puts the WM in a rigorously correct mode, which gives a more consistent user interface, provided one does not need to run any misbehaving applications.
uz: Ayrim dasturlar belgilangan qoidalarga rioya qilmasligi natijasida oyna boshqaruvchisida muammolar kelib chiqishi mumkin. Bu sozlama oyna boshqaruvchini qat'iy toʻgʻri ishlash rejimiga oʻrnatadi, bu esa notoʻgʻri ishlaydigan dasturlarni ishlatmasangiz, yanada bir xil va tushunarli interfeysni yaratadi.

source: The names of the workspaces
uz: Ish maydonlarining nomlari

source: Defines the names that should be assigned to workspaces. If the list is too long for the current number of workspaces, names in excess will be ignored. If the list is too short, or includes empty names, missing values will be replaced with the default (“Workspace N”).
uz: Ish maydonlariga berilishi kerak boʻlgan nomlarni belgilaydi. Agar roʻyxat hozirgi ish maydonlari soni uchun juda uzun boʻlsa, ortiqcha nomlar e’tiborga olinmaydi. Agar roʻyxat juda qisqa boʻlsa yoki boʻsh nomlarni oʻz ichiga olsa, yoʻq nomlar standart nomlar bilan almashtiriladi (“Workspace N”).

source: The locale to use for dates / numbers formats
uz: Sanalar va raqamlar formatlari uchun ishlatiladigan mintaqa

source: Specify the locale to be used for displaying dates, times and numbers formats.
uz: Sanalar, vaqtlar va raqamlar formatlarini koʻrsatish uchun ishlatiladigan mintaqani belgilash.

source: Geolocation services are enabled.
uz: Geolokatsiya xizmati yoqilgan.

source: If true, applications are allowed to access location information.
uz: Agar bu sozlama yoqilgan boʻlsa, dasturlarga joylashuv haqidagi ma'lumotlardan foydalanishga ruxsat beriladi.

source: The maximum accuracy level of location.
uz: Joylashuvning maksimal aniqlik darajasi.

source: Configures the maximum level of location accuracy applications are allowed to see. Valid options are “country”, “city”, “neighborhood”, “street”, and “exact” (typically requires GPS receiver). Please keep in mind that this only controls what GeoClue will allow applications to see and they can find user’s location on their own using network resources (albeit with street-level accuracy at best).
uz: Ilovalarga koʻrishga ruxsat etilgan joylashuv aniqligining maksimal darajasini sozlaydi. Mumkin boʻlgan qiymatlar: “mamlakat”, “shahar”, “mahalla”, “koʻcha” va “aniq” (odatda GPS qabul qiluvchini talab qiladi). Shuni yodda tutingki, bu faqat GeoClue ilovalarga koʻrishga ruxsat beradigan darajani nazorat qiladi, ular esa tarmoq resurslaridan foydalanib (eng yaxshi holatda koʻcha darajasidagi aniqlik bilan boʻlsa ham) foydalanuvchi joylashuvini mustaqil ravishda aniqlashlari mumkin.

source: Proxy configuration mode
uz: Proksi konfiguratsiya rejimi

source: Select the proxy configuration mode. Supported values are “none”, “manual”, “auto”. If this is “none”, then proxies are not used. If it is “auto”, the autoconfiguration URL described by the “autoconfig-url” key is used. If it is “manual”, then the proxies described by “/system/proxy/http”, “/system/proxy/https”, “/system/proxy/ftp” and “/system/proxy/socks” will be used. Each of the 4 proxy types is enabled if its “host” key is non-empty and its “port” key is non-0. If an http proxy is configured, but an https proxy is not, then the http proxy is also used for https. If a SOCKS proxy is configured, it is used for all protocols, except that the http, https, and ftp proxy settings override it for those protocols only.
uz: Proksi sozlamalari rejimini tanlang. Qoʻllab-quvvatlanadigan qiymatlar: “yoʻq”, “qoʻlda”, “avtomatik”. Agar “yoʻq” tanlansa, proksilar ishlatilmaydi. Agar “avtomatik” tanlansa, “autoconfig-url” kalitida koʻrsatilgan URL orqali barcha protokollar uchun proksi ma’lumotlari olinadi. Agar “qoʻlda” tanlansa, unda “/system/proxy/http”, “/system/proxy/https”, “/system/proxy/ftp” va “/system/proxy/socks” orqali belgilanadigan proksilar ishlatiladi. Har bir proksi turi faollashadi, agar uning “host” kaliti boʻsh boʻlmasa va “port” kaliti 0 dan farqli boʻlsa. Agar http proksi mavjud boʻlib, https proksi belgilanmagan boʻlsa, https uchun ham http proksi ishlatiladi. Agar SOCKS proksi belgilanayotgan boʻlsa, u barcha protokollar uchun ishlatiladi, biroq http, https va ftp uchun alohida proksi sozlamalari mavjud boʻlsa, ular ustun boʻladi.

source: Automatic proxy configuration URL
uz: Avtomatik proksi sozlamalari URL manzili

source: URL that provides proxy configuration values. When mode is “auto”, this URL is used to look up proxy information for all protocols.
uz: Proksi sozlamalarini ta'minlaydigan URL. “Avto” rejimda ushbu URL barcha protokollar uchun proksi ma’lumotlarini aniqlashda ishlatiladi.

source: Non-proxy hosts
uz: Proksi orqali oʻtmaydigan hostlar

source: This key contains a list of hosts which are connected to directly, rather than via the proxy (if it is active). The values can be hostnames, domains (using an initial wildcard like *.foo.com), IP host addresses (both IPv4 and IPv6) and network addresses with a netmask (something like 192.168.0.0/24).
uz: Bu sozlama, agar proksi ishlayotgan boʻlsa ham, unga emas, balki bevosita ulanadigan qurilmalar roʻyxatini saqlaydi. Bu roʻyxatdagi elementlar host nomlari, domenlar (masalan, *.foo.com), IP manzillar (ham IPv4, ham IPv6) va netmask bilan tarmoq manzillari (masalan, 192.168.0.0/24) koʻrinishida boʻlishi mumkin.

source: Use HTTP proxy for all protocols
uz: HTTP proksini barcha protocollar uchun foydalanish

source: Whether to use the HTTP proxy for all protocols or not.
uz: Barcha protokollar uchun HTTP proksidan foydalanilsinmi yoki yoʻqmi.

source: Unused; ignore
uz: Foydalanilmaydi; inkor qilish

source: This key is not used; HTTP proxying is enabled when the host key is non-empty and the port is non-0.
uz: Bu sozlama qoʻllanilmaydi; HTTP proksisi, agar xost nomi koʻrsatilgan boʻlsa va port raqami noldan katta boʻlsa, faollashadi.

source: HTTP proxy host name
uz: Xavfsiz HTTP proksi host nomi

source: The machine name to proxy HTTP through.
uz: HTTP orqali proksi qilish uchun ishlatiladigan qurilma nomi.

source: HTTP proxy port
uz: HTTP proksi porti

source: The port on the machine defined by “/system/proxy/http/host” that you proxy through.
uz: /system/proxy/http/host orqali belgilangan qurilmadagi siz proxy qilayotgan port.

source: Authenticate proxy server connections
uz: Proksi server ulanishlarini autentifikatsiya qilish

source: If true, then connections to the proxy server require authentication. The username/password combo is defined by “/system/proxy/http/authentication-user” and “/system/proxy/http/authentication-password”. This applies only to the http proxy; when using a separate https proxy, there is currently no way to specify that it should use authentication.
uz: Agar bu sozlama yoqilgan boʻlsa, proksi serverga ulanish uchun autentifikatsiya zarur boʻladi. Foydalanuvchi ismi va paroli (“/system/proxy/http/authentication-user” va “/system/proxy/http/authentication-password” sozlamalarida koʻrsatiladi). Bu faqat HTTP proksi uchun amal qiladi; agar alohida HTTPS proksi ishlatilsa, hozircha unga autentifikatsiya kerakligini koʻrsatishning usuli mavjud emas.

source: HTTP proxy username
uz: HTTP proksi foydalanuvchi nomi

source: User name to pass as authentication when doing HTTP proxying.
uz: HTTP orqali proksi ulanishda autentifikatsiya uchun yuboriladigan foydalanuvchi nomi.

source: HTTP proxy password
uz: HTTP proksi paroli

source: Password to pass as authentication when doing HTTP proxying.
uz: HTTP orqali proksi ulanishda autentifikatsiya uchun yuboriladigan parol.

source: Secure HTTP proxy host name
uz: Xavfsiz HTTP proksi host nomi

source: The machine name to proxy secure HTTP through.
uz: Xavfsiz HTTP proksi serveri sifatida foydalaniladigan qurilma nomi.

source: Secure HTTP proxy port
uz: Xavfsiz HTTP proksi porti

source: The port on the machine defined by “/system/proxy/https/host” that you proxy through.
uz: /system/proxy/https/host orqali belgilangan qurilmadagi siz proksi qilayotgan port.

source: FTP proxy host name
uz: FTP proksi host nomi

source: The machine name to proxy FTP through.
uz: FTP orqali proksi qilish uchun ishlatiladigan qurilma nomi.

source: FTP proxy port
uz: FTP proksi porti

source: The port on the machine defined by “/system/proxy/ftp/host” that you proxy through.
uz: Bu system/proxy/ftp/host manzili boʻyicha aniqlangan qurilmada siz ulanayotgan proksi porti.

source: SOCKS proxy host name
uz: SOCKS proksi host nomi

source: The machine name to use as a SOCKS proxy.
uz: SOCKS proksisi uchun ishlatiladigan qurilma nomi.

source: SOCKS proxy port
uz: SOCKS proksi porti

source: The port on the machine defined by “/system/proxy/socks/host” that you proxy through.
uz: /system/proxy/socks/host manzili boʻyicha aniqlangan qurilmada siz ulanayotgan proksi porti.
