Repository: uzbek-net/dictionary
Catalog: gnome/49/gsettings-desktop-schemas.gnome-49.*.po
Languages: uz

source: Send reports of technical problems to the vendor
uz: Texnik nosozliklar haqida hisobotni ishlab chiqaruvchiga joʻnatish

source: If TRUE, anonymized reports will be sent automatically to the vendor.
uz: Agar TRUE boʻlsa, anonimlashtirilgan hisobotlar avtomatik ravishda ishlab chiqaruvchiga yuboriladi.

source: Don’t allow applications to access the microphone
uz: Ilovalarga mikrofon foydalanishiga ruxsat berilmasin

source: If TRUE, applications should not use the microphone.
uz: Agar TRUE boʻlsa, ilovalar mikrofonni ishlatmasligi kerak.

source: Don’t allow applications to access the camera
uz: Ilovalarga kameradan foydalanishga ruxsat berilmasin

source: If TRUE, applications should not use the camera.
uz: Agar TRUE boʻlsa, ilovalar kamerani ishlatmasligi kerak.

source: Don’t allow applications to output sound
uz: Ilovalarga ovoz chiqarishga ruxsat bermang

source: If TRUE, applications should not make sound.
uz: Agar TRUE boʻlsa, ilovalar ovoz chiqarmasligi kerak.

source: Whether to protect USB devices
uz: USB qurilmalarini himoya qilish kerakmi

source: If the USBGuard service is present and this setting is enabled, USB devices will be protected as configured in the usb-protection-level setting.
uz: Agar USBGuard xizmati mavjud boʻlsa va bu sozlama yoqilgan boʻlsa, USB qurilmalari usb-protection-level sozlamasida koʻrsatilganidek himoyalanadi.

source: When USB devices should be rejected
uz: USB qurilmalari qachon rad etilishi kerak

source: If set to “lockscreen”, only when the lock screen is present new USB devices will be rejected; if set to “always”, all new USB devices will always be rejected.
uz: Agar “lockscreen” (qulf ekran) qilib oʻrnatilsa, faqat qulf ekrani mavjud boʻlganda yangi USB qurilmalari rad etiladi; agar “always” (doim) qilib oʻrnatilsa, barcha yangi USB qurilmalari har doim rad etiladi.

source: Whether the privacy screen is enabled
uz: Maxfiylik ekrani yoqilganmi

source: If the underlying hardware has privacy screen support and this setting is enabled, the panels supporting this technology will be obscured from lateral view.
uz: Agar qurilmaning asosiy apparat ta'minoti maxfiylik ekranini qoʻllab-quvvatlasa va bu sozlama yoqilgan boʻlsa, bu texnologiyani qoʻllab-quvvatlaydigan panellar yon tomondan qaraganda koʻrinmaydigan boʻladi.

source: Activate when idle
uz: Boʻsh turganda faollashsin

source: Set this to TRUE to activate the screensaver when the session is idle. DEPRECATED: This key is deprecated and ignored. Set org.gnome.desktop.session idle-delay to 0 if you do not want to activate the screensaver.
uz: Sessiya ishlamay qolganda ekran saqlagichni faollashtirish uchun buni TRUE qilib oʻrnating. ESKIRGAN: Bu kalit eskirgan va e'tiborga olinmaydi. Agar ekran saqlagichni faollashtirishni xohlamasangiz, org.gnome.desktop.session idle-delay ni 0 ga oʻrnating.

source: Lock on activation
uz: Ishga tushganda qulflash

source: Set this to TRUE to lock the screen when the screensaver goes active.
uz: Ekran saqlagich ishga tushganda ekranni qulflash uchun buni TRUE qilib oʻrnating.

source: Time before locking
uz: Qulflashdan oldingi vaqt

source: The number of seconds after screensaver activation before locking the screen.
uz: Ekran saqlagich faollashganidan keyin ekranni qulflash uchun soniyalar soni.

source: Show full name in the lock screen
uz: Bloklash ekranida toʻliq familiya ismini koʻrsatish

source: Whether the user’s full name is shown in the lock screen or not. This only affects the screen shield, the name is always shown in the unlock dialog.
uz: Foydalanuvchi roʻyxatidagi toʻliq ism qulflash ekranida aks etadimi yoki yoʻqmi. Bu faqat ekran himoyasiga ta'sir qiladi, ism qulfni ochish oynasida doim koʻrinadi.

source: Allow embedding a keyboard into the window
uz: Virtual klaviaturani oyna ichiga joylash imkoniyatini berilsin

source: Set this to TRUE to allow embedding a keyboard into the window when trying to unlock. The “keyboard_command” key must be set with the appropriate command. DEPRECATED: This key is deprecated and ignored.
uz: Qulfni ochishga urinayotganda klaviaturani oynaga joylashtirishga ruxsat berish uchun buni TRUE qilib oʻrnating. “keyboard_command” kaliti tegishli buyruq bilan oʻrnatilgan boʻlishi kerak. ESKIRGAN: Bu kalit eskirgan va e'tiborga olinmaydi.

source: Embedded keyboard command
uz: Oʻrnatilgan klaviatura buyrugʻi

source: The command that will be run, if the “embedded_keyboard_enabled” key is set to TRUE, to embed a keyboard widget into the window. This command should implement an XEMBED plug interface and output a window XID on the standard output. DEPRECATED: This key is deprecated and ignored.
uz: Agar “embedded_keyboard_enabled” kaliti TRUE (rost) qiymatiga oʻrnatilgan boʻlsa, oynaga klaviatura виджетини joylashtirish uchun bajariladigan buyruq. Bu buyruq XEMBED plagin interfeysini qoʻllab-quvvatlashi va standart chiqishga oyna XID-sini chop etishi zarur. ESKIRGAN: Bu kalit endi ishlatilmaydi va e'tiborga olinmaydi.

source: Allow logout
uz: Seansni yakunlash (logout)ga ruxsat berish

source: Set this to TRUE to offer an option in the unlock dialog to allow logging out after a delay. The delay is specified in the “logout_delay” key. DEPRECATED: This key is deprecated and ignored.
uz: Qulfni ochish oynasida kechikish bilan tizimdan chiqish imkoniyatini berish uchun buni TRUE ga oʻzgartiring. Kechikish vaqti “logout_delay” kalitida belgilangan. ESKIRGAN: Bu kalit endi ishlatilmaydi va e'tiborga olinmaydi.

source: Time before logout option
uz: Chiqish opsiyasi uchun belgilangan vaqt

source: The number of seconds after the screensaver activation before a logout option will appear in the unlock dialog. This key has effect only if the “logout_enable” key is set to TRUE. DEPRECATED: This key is deprecated and ignored
uz: Ekran saqlagich ishga tushganidan keyin qulfni ochish oynasida tizimdan chiqish imkoniyati paydo boʻlishi uchun soniyalar soni. Bu kalit faqat “logout_enable” kaliti TRUE (rost) boʻlgandagina ishlaydi. ESKIRGAN: Bu kalit endi ishlatilmaydi va e'tiborga olinmaydi

source: Logout command
uz: Tizimdan chiqish (logout) komandasi.

source: The command to invoke when the logout button is clicked. This command should simply log the user out without any interaction. This key has effect only if the “logout_enable” key is set to TRUE. DEPRECATED: This key is deprecated and ignored.
uz: Chiqish tugmasi bosilganda bajariladigan buyruq. Bu buyruq foydalanuvchini hech qanday soʻrovsiz shunchaki tizimdan chiqarishi kerak. Bu kalit faqat “logout_enable” kaliti TRUE (rost) boʻlgandagina ishlaydi. ESKIRGAN: Bu kalit endi ishlatilmaydi va e'tiborga olinmaydi.

source: Allow user switching
uz: Foydalanuvchini hisoblarini almashtirishga ruxsat berish

source: Set this to TRUE to offer an option in the unlock dialog to switch to a different user account.
uz: Qulfni ochish oynasida boshqa foydalanuvchi hisobiga oʻtish imkoniyatini berish uchun buni TRUE ga oʻzgartiring.

source: Allow the session status message to be displayed
uz: Seans holati xabarining koʻrsatilishiga ruxsat berish

source: Allow the session status message to be displayed when the screen is locked. DEPRECATED: This key is deprecated and ignored.
uz: Ekran qulflangan paytda seans holati haqidagi xabarning koʻrinishiga imkoniyat berish. ESKIRGAN: Bu kalit endi ishlatilmaydi va e'tiborga olinmaydi.

source: Enable screen time history
uz: Ekran foydalanish vaqti tarixini faollashtirish

source: Enable basic screen time functionality, recording usage data for viewing history.
uz: Ekran foydalanish vaqti funksiyasining asosiy ishini faollashtirish, tarixni koʻrish uchun foydalanish ma'lumotlarini qayd etish.

source: Enable daily screen time limit
uz: Kunlik foydalanish vaqti limitini faollashtirish

source: Enable imposing a screen time limit on the user, as set in daily-limit-seconds.
uz: Foydalanuvchiga kunlik-limit-soniyalarda belgilangan ekran vaqti limitini qoʻllash.

source: Daily screen time limit
uz: Kunlik foydalanish vaqti limiti

source: The limit on the amount of daily screen time the user is allowed, in seconds.
uz: Foydalanuvchi bir kun davomida ekran bilan oʻtkazishi mumkin boʻlgan maksimal vaqt, soniyalarda.

source: Grayscale once limit is reached
uz: Limitga yetganda kulrang rangga oʻtish

source: Whether to make the screen grayscale once the user’s screen time limit is reached.
uz: Foydalanuvchining ekran vaqti limiti tugagandan soʻng ekranni kulrang qilish kerakmi.

source: Disable all external search providers
uz: Barcha tashqi qidiruv provayderlarini oʻchirish

source: Set to true to disable all external search provider programs, whether or not they are independently disabled or enabled. External search providers are installed by applications in $XDG_DATA_DIR/gnome-shell/search-providers.
uz: Barcha tashqi qidiruv provayderi dasturlarini, ular mustaqil ravishda oʻchirilgan yoki yoqilganligidan qat'i nazar, oʻchirish uchun buni TRUE qilib oʻrnating. Tashqi qidiruv provayderlari $XDG_DATA_DIR/gnome-shell/search-providers jildidagi ilovalar tomonidan oʻrnatiladi.

source: List of desktop file IDs for which the associated default-enabled search provider should be disabled
uz: Standart ravishda yoqilgan va oʻchirilishi lozim boʻlgan qidiruv xizmatiga ega desktop fayllarining ID'lari roʻyxati

source: Results for applications contained in this list will not be displayed when searching.
uz: Qidiruv vaqtida bu roʻyxatdagi ilovalar uchun natijalar koʻrsatilmaydi.

source: List of desktop file IDs for which the associated default-disabled search provider should be enabled
uz: Standart ravishda oʻchirilgan va yoqilishi lozim boʻlgan qidiruv xizmatiga ega desktop fayllarining ID'lari roʻyxati

source: Results for applications contained in this list will be displayed when searching.
uz: Qidiruv vaqtida bu roʻyxatdagi dasturlar uchun natijalar koʻrsatiladi.

source: List of desktop file IDs for search providers sort order
uz: Qidiruv xizmatlarining saralash tartibi uchun desktop fayllarining ID'lari roʻyxati

source: Results for applications contained in this list will be displayed in the specified order. Results for applications not specified in this list will be displayed last, sorted alphabetically.
uz: Bu roʻyxatdagi ilovalar uchun natijalar koʻrsatilgan tartibda namoyish etiladi. Bu roʻyxatda koʻrsatilmagan ilovalar uchun natijalar oxirida, alifbo tartibida saralanib koʻrsatiladi.

source: Time before session is considered idle
uz: Sessiya harakatsiz deb hisoblanishidan oldingi muddat

source: The number of seconds of inactivity before the session is considered idle.
uz: Sessiya harakatsiz deb hisoblangunga qadar oʻtishi kerak boʻlgan soniyalari.

source: Session type
uz: Sessiya turi

source: The name of the session to use. Known value is “gnome”.
uz: Ishlatiladigan sessiya nomi. Ma'lum qiymat "gnome".

source: Sounds for events
uz: Hodisalar uchun ovozlar

source: Whether to play sounds on user events.
uz: Foydalanuvchi hodisalarida tovushlarni ijro etish kerakmi.

source: Sound theme name
uz: Ovoz mavzusining nomi

source: The XDG sound theme to use for event sounds.
uz: Hodisa tovushlari uchun ishlatiladigan XDG ovoz mavzusi.

source: Input feedback sounds
uz: Kiritish signallari

source: Whether to play sounds on input events.
uz: Kiritish hodisalarida tovushlarni ijro etish kerakmi.

source: Allow volume above 100%
uz: Ovoz balandligini 100 foizdan oshirishga ruxsat berish

source: Whether volume can be set above 100%, using software amplification.
uz: Dasturiy amplifikatsiya yordamida tovushni 100% dan yuqori sozlash imkoniyati bormi.

source: Maximum age for thumbnails in the cache, in days. Set to -1 to disable cleaning.
uz: Keshdagi thumbnail'larning maksimal saqlanish muddati, kunlarda. Tozalashni oʻchirish uchun -1 ga oʻrnating.

source: Maximum size of the thumbnail cache, in megabytes. Set to -1 to disable cleaning.
uz: Thumbnail'lar keshining maksimal hajmi, megabaytlarda. Tozalashni oʻchirish uchun -1 ga oʻrnating.

source: Disable all external thumbnailers
uz: Barcha tashqi thumbnail'larni oʻchirish

source: Set to true to disable all external thumbnailer programs, independent on whether they are independently disabled/enabled.
uz: Barcha tashqi thumbnailer dasturlarini, ular mustaqil ravishda oʻchirilgan yoki yoqilganligidan qat'i nazar, oʻchirish uchun buni TRUE qilib oʻrnating.

source: List of mime-types for which external thumbnailer programs will be disabled
uz: Tashqi thumbnailer dasturlari oʻchiriladigan MIME-tiplar roʻyxati

source: Thumbnails will not be created for files whose mime-type is contained in the list.
uz: Roʻyxatda MIME-tipi koʻrsatilgan fayllar uchun thumbnail'lar yaratilmaydi.

source: Switch to workspace 1
uz: 1-ish maydoniga oʻtish

source: Switch to workspace 2
uz: 2-ish maydoniga oʻtish

source: Switch to workspace 3
uz: 3-ish maydoniga oʻtish

source: Switch to workspace 4
uz: 4-ish maydoniga oʻtish

source: Switch to workspace 5
uz: 5-ish maydoniga oʻtish

source: Switch to workspace 6
uz: 6-ish maydoniga oʻtish

source: Switch to workspace 7
uz: 7-ish maydoniga oʻtish

source: Switch to workspace 8
uz: 8-ish maydoniga oʻtish

source: Switch to workspace 9
uz: 9-ish maydoniga oʻtish

source: Switch to workspace 10
uz: 10-ish maydoniga oʻtish

source: Switch to workspace 11
uz: 11-ish maydoniga oʻtish

source: Switch to workspace 12
uz: 12-ish maydoniga oʻtish

source: Switch to workspace left
uz: Chap tarafdagi ish maydoniga oʻtish

source: Switch to workspace right
uz: Oʻng tarafdagi ish maydoniga oʻtish

source: Switch to workspace above
uz: Yuqoridagi ish maydoniga oʻtish

source: Switch to workspace below
uz: Pastdagi ish maydoniga oʻtish

source: Switch to last workspace
uz: Oxirgi ish maydoniga oʻtish

source: Switch windows of an application
uz: Ilova oynalarini almashtirish

source: Reverse switch windows of an application
uz: Ilova oynalarini teskari tartibda almashtirish

source: Switch applications
uz: Ilovalarni almashtirish

source: Reverse switch applications
uz: Ilovalarni teskari tartibda almashtirish

source: Switch windows
uz: Oynalarni almashtirish

source: Reverse switch windows
uz: Oynalarni teskari tartibda almashtirish

source: Switch system controls
uz: Tizim boshqaruv elementlarini almashtirish

source: Reverse switch system controls
uz: Tizim boshqaruv elementlarini teskari tartibda almashtirish

source: Switch windows of an app directly
uz: Ilova oynalarini toʻgʻridan-toʻgʻri almashtirish

source: Reverse switch windows of an app directly
uz: Teskari yoʻnalishda ilova oynalarini toʻgʻridan-toʻgʻri almashtirish

source: Switch windows directly
uz: Oynalarni toʻgʻridan-toʻgʻri almashtirish

source: Reverse switch windows directly
uz: Teskari tartibda oynalarni toʻgʻridan-toʻgʻri almashtirish

source: Switch system controls directly
uz: Tizim boshqaruvlarini bevosita almashtirish

source: Reverse switch system controls directly
uz: Tizim boshqaruvlarini bevosita teskari tartibda almashtirish

source: Hide all normal windows
uz: Barcha normal oynalarni yashirish

source: DEPRECATED: This key is deprecated and ignored.
uz: QOʻLLANILMAYDI: Bu kalit eskirgan va inkor qilingan.

source: Show the run command prompt
uz: Buyruq satrini chiqarish

source: Don’t use
uz: Foydalanmaslik

source: Activate the window menu
uz: Oyna menyusini faollashtirish

source: Toggle fullscreen mode
uz: Oynani toʻliq ekran rejimiga oʻtkazish yoki chiqarish

source: Toggle maximization state
uz: Oynaning maksimal holatini yoqish yoki oʻchirish

source: Toggle window always appearing on top
uz: Oynani doimo yuqorida koʻrinishini yoqish yoki oʻchirish

source: Maximize window
uz: Oynani kattalashtirish

source: Restore window
uz: Oynani tiklash

source: Minimize window
uz: Oynani kichraytirish

source: Close window
uz: Oynani yopish

source: Move window
uz: Oynani surish

source: Resize window
uz: Oyna oʻlchamini oʻzgartirish

source: Toggle window on all workspaces or one
uz: Oynani barcha ish maydonlarida koʻrsatish yoki faqat bittasida koʻrsatishga oʻtish

source: Move window to workspace 1
uz: Oynani 1-ish maydoniga oʻtkazish

source: Move window to workspace 2
uz: Oynani 2-ish maydoniga oʻtkazish

source: Move window to workspace 3
uz: Oynani 3-ish maydoniga oʻtkazish

source: Move window to workspace 4
uz: Oynani 4-ish maydoniga oʻtkazish

source: Move window to workspace 5
uz: Oynani 5-ish maydoniga oʻtkazish

source: Move window to workspace 6
uz: Oynani 6-ish maydoniga oʻtkazish

source: Move window to workspace 7
uz: Oynani 7-ish maydoniga oʻtkazish

source: Move window to workspace 8
uz: Oynani 8-ish maydoniga oʻtkazish

source: Move window to workspace 9
uz: Oynani 9-ish maydoniga oʻtkazish

source: Move window to workspace 10
uz: Oynani 10-ish maydoniga oʻtkazish

source: Move window to workspace 11
uz: Oynani 11-ish maydoniga oʻtkazish

source: Move window to workspace 12
uz: Oynani 12-ish maydoniga oʻtkazish

source: Move window to last workspace
uz: Oynani oxirgi ish maydoniga oʻtkazish

source: Move window one workspace to the left
uz: Oynani bir ish maydoni chapga oʻtkazish

source: Move window one workspace to the right
uz: Oynani bir ish maydoni oʻngga oʻtkazish

source: Move window one workspace up
uz: Oynani bir ishchi maydon yuqoriga koʻchirish

source: Move window one workspace down
uz: Oynani bir ishchi maydon pastga koʻchirish

source: Move window to the next monitor on the left
uz: Oynani chapdagi keyingi monitorga koʻchirish

source: Move window to the next monitor on the right
uz: Oynani oʻngdagi keyingi monitorga koʻchirish

source: Move window to the next monitor above
uz: Oynani tepadagi keyingi monitorga koʻchirish

source: Move window to the next monitor below
uz: Oynani pastdagi keyingi monitorga koʻchirish

source: Raise window if covered, otherwise lower it
uz: Agar oyna boshqa oynalar bilan yopilgan boʻlsa oldinga olib chiqiladi, aks holda orqaga suriladi

source: Raise window above other windows
uz: Oynani boshqa barcha oynalarning ustiga olib chiqish

source: Lower window below other windows
uz: Oynani boshqa oynalar orqasiga oʻtkazish

source: Maximize window vertically
uz: Oynani vertikal yoʻnalishda toʻliq ekran qilish

source: Maximize window horizontally
uz: Oynani gorizontal yoʻnalishda toʻliq ekran qilish

source: Move window to top left corner
uz: Oynani yuqori chap burchakka koʻchirish

source: Move window to top right corner
uz: Oynani yuqori oʻng burchakka koʻchirish

source: Move window to bottom left corner
uz: Oynani pastki chap burchakka koʻchirish

source: Move window to bottom right corner
uz: Oynani pastki oʻng burchakka koʻchirish

source: Move window to top edge of screen
uz: Oynani ekranning yuqori chetiga koʻchirish

source: Move window to bottom edge of screen
uz: Oynani ekranning pastki chetiga koʻchirish

source: Move window to right side of screen
uz: Oynani ekranning oʻng tarafiga koʻchirish

source: Move window to left side of screen
uz: Oynani ekranning chap tarafiga koʻchirish

source: Move window to center of screen
uz: Oynani ekranning markaziga koʻchirish

source: Switch input source
uz: Kiritish manbaini almashtirish

source: Binding to select the next input source
uz: Keyingi kirish manbasini tanlash uchun bogʻlash

source: Switch input source backward
uz: Kiritish manbasini orqaga almashtirish

source: Binding to select the previous input source
uz: Avvalgi kirish manbasini tanlash uchun bogʻlash

source: Toggle window to be always on top
uz: Derazani doimo eng yuqorida qilishni yoqish/oʻchirish

source: Set or unset window to appear always on top
uz: Derazani doimo eng yuqorida koʻrinadigan qilib sozlash yoki sozlamani bekor qilish

source: Modifier to use for modified window click actions
uz: Oʻzgartirilgan deraza ustida bosish amallari uchun ishlatiladigan modifier

source: Clicking a window while holding down this modifier key will move the window (left click), resize the window (middle click), or show the window menu (right click). The middle and right click operations may be swapped using the “resize-with-right-button” key. Modifier is expressed as “<Alt>” or “<Super>” for example.
uz: Agar ushbu modifikator tugmasi bosib turilgan holatda oyna sichqonchaning chap tugmasi bilan bosilsa, oyna siljiydi, oʻrta tugma bilan bosilsa, oʻlchami oʻzgaradi, oʻng tugma bilan bosilsa esa oyna menyusi ochiladi. Oʻrta va oʻng tugmalarning bu harakatlari “resize-with-right-button” sozlamasi orqali oʻzgartirilishi mumkin. Modifikator tugmasi “<Alt>” yoki “<Super>” kabi koʻrsatiladi.

source: Whether to resize with the right button
uz: Oʻng tugmani bosib turib oynaning oʻlchamini oʻzgartirishga ruxsat berilsinmi

source: Set this to true to resize with the right button and show a menu with the middle button while holding down the key given in “mouse-button-modifier”; set it to false to make it work the opposite way around.
uz: Agar “mouse-button-modifier” sozlamasida belgilangan tugma bosib turilganida oʻng tugma orqali oynaning oʻlchamini oʻzgartirish va oʻrta tugma orqali menyuni ochishni xohlasangiz, bu sozlamani "true" ga oʻrnating; agar aksincha boʻlishini istasangiz ("false" ga oʻrnating).

source: Arrangement of buttons on the titlebar
uz: Sarlavha panelidagi tugmalarn joylashuvi

source: Arrangement of buttons on the titlebar. The value should be a string, such as “menu:minimize,maximize,spacer,close”; the colon separates the left corner of the window from the right corner, and the button names are comma-separated. Duplicate buttons are not allowed. Unknown button names are silently ignored so that buttons can be added in future metacity versions without breaking older versions. A special spacer tag can be used to insert some space between two adjacent buttons.
uz: Sarlavha satridagi tugmalarning joylashuvi. Qiymat satr boʻlishi kerak, masalan, “menu:minimize,maximize,spacer,close”; ikki nuqta oynaning chap burchagini oʻng burchagidan ajratadi, tugma nomlari esa vergul bilan ajratiladi. Takroriy tugmalarga ruxsat etilmaydi. Noma'lum tugma nomlari e'tiborsiz qoldiriladi, shunda kelajakdagi metacity versiyalarida tugmalar qoʻshilganda eski versiyalar buzilmaydi. Ikki qoʻshni tugma orasiga boʻsh joy qoʻshish uchun maxsus spacer tegidan foydalanish mumkin.

source: Window focus mode
uz: Oynaga e'tibor qaratish tartibi

source: The window focus mode indicates how windows are activated. It has three possible values; “click” means windows must be clicked in order to focus them, “sloppy” means windows are focused when the mouse enters the window, and “mouse” means windows are focused when the mouse enters the window and unfocused when the mouse leaves the window.
uz: Oyna fokuslash rejimi oynalar qanday aktivlashtirilishini koʻrsatadi. Uning uchta mumkin boʻlgan qiymati bor; “click” (bosish) oynalarni fokuslash uchun ularni bosish kerakligini anglatadi, “sloppy” (ehtiyotsiz) sichqoncha oyna ichiga kirganda oynalar fokuslanishini anglatadi, va “mouse” (sichqoncha) sichqoncha oyna ichiga kirganda oynalar fokuslanishini va sichqoncha oyna tashqarisiga chiqqanda fokusni yoʻqotishini anglatadi.

source: Control how new windows get focus
uz: Yangi oynalarning aktiv holatga oʻtishini boshqarish

source: This option provides additional control over how newly created windows get focus. It has two possible values; “smart” applies the user’s normal focus mode, and “strict” results in new windows not being given focus automatically.
uz: Bu sozlama yangi ochilgan oynalar qanday qilib diqqat markaziga tushishini yanada yaxshiroq sozlash imkonini beradi. Ikki xil qiymat mavjud: “smart” (aqlli) foydalanuvchining standart fokuslash usulini ishlatadi, “strict” (qat'iy) esa yangi oynalarning oʻz-oʻzidan aktivlashishiga yoʻl qoʻymaydi.

source: Whether windows should be raised when their client area is clicked
uz: Oynaning mijoz sohasi bosilganda oyna ustki qatlamga koʻtarilsinmi
