Repository: uzbek-net/dictionary
Catalog: gnome/49/Manuals.gnome-49.*.po
Languages: uz

source: Manuals
uz: Qoʻllanmalar

source: Install, Browse, and Search Documentation
uz: Oʻrnatish, koʻrish va hujjatlarni qidirish

source: documentation;manuals;api;reference;docs;developer;
uz: dokumentatsiya;qoʻllanmalar;api;ma’lumotnoma;hujjatlar;dasturchi;

source: New Window
uz: Yangi oyna

source: Width of sidebar in application pixels
uz: Ilova yon paneli kengligi piksellarda

source: Window dimensions
uz: Oyna oʻlchamlari

source: Window is Maximized
uz: Oyna maksimallashtirilgan

source: Read developer documentation
uz: Dasturchi dokumentatsiyasini oʻqish

source: Manuals indexes your developer manuals and provides robust browsing and searching capabilities.
uz: Ilova dasturchilar uchun qoʻllanmalaringizni indekslaydi hamda keng qamrovli koʻrish va qidirish imkoniyatlarini taqdim etadi.

source: It supports the devhelp documentation format used by many libraries integrating with the GTK platform.
uz: GTK platformasi bilan birlashtirilgan koʻplab kutubxonalar tomonidan ishlatiladigan devhelp hujjat formatini qoʻllab-quvvatlaydi.

source: Browse Documentation by SDK
uz: SDK dokumentatsiyasini koʻrish

source: Free Form Search
uz: Erkin shakldagi qidiruv

source: Install SDK Documentation
uz: SDK dokumentatsiyasini oʻrnatish

source: Integrated Dark Mode
uz: Integratsiyalashgan qorongʻi rejim

source: Mobile Search
uz: Mobil qidiruv

source: Adaptable Documentation
uz: Moslashuvchan qoʻllanma

source: translator-credits
uz: saidkamol Jamolov <imsdkl@outlook.com>\ Baxrom Raxmatov

source: Create GNOME Applications
uz: GNOME uchun ilovalar yaratish

source: Open a new Manuals window
uz: Yangi qoʻllanmalar oynasini ochish

source: Install
uz: Oʻrnatish

source: Documentation
uz: Dokumentatsiya

source: Loading SDKs…
uz: SDK yuklanmoqda…

source: Please wait while we locate the SDKs on your system
uz: Iltimos, tizimingizdagi SDKlarni topgunimizcha kuting

source: No SDKs Available
uz: SDK mavjud emas

source: Your system is not configured to access any SDKs.
uz: Tizim SDK xizmatlaridan foydalanishga sozlanmagan.

source: Installed SDKs
uz: Oʻrnatilgan SDKlar

source: Available SDKs
uz: Mavjud SDK xizmatlari

source: Installing Documentation
uz: Dokumentatsiya oʻrnatish

source: _Install
uz: Oʻrnatish

source: _Cancel
uz: Bekor qilish

source: %u of %u
uz: %u dan %u

source: Search
uz: Izlash

source: Open Link in New Tab
uz: Havolani yangi tabda ochish

source: Open Link in New Window
uz: Havolani yangi oynada ochish

source: Empty Page
uz: Boʻsh sahifa

source: Loading…
uz: Yuklanmoqda…

source: One moment please while we locate your documentation
uz: Iltimos, hujjatlaringizni topgunimizcha biroz kuting

source: Browse Documentation
uz: Hujjatlarni koʻrib chiqish

source: • Press Ctrl+K to search for classes and more • Press Ctrl+T to open a new tab Or, press Ctrl+W to close the window
uz: • Klasslar va boshqalarni topish uchun Ctrl+K tugmalarini bosing • Yangi tabni ochish uchun Ctrl+T tugmalarini bosing Yoki, oynani yopish uchun Ctrl+W tugmalarini bosing

source: Install Documentation…
uz: Dokumentatsiyani oʻrnatish…

source: Filter…
uz: Filtrlash…

source: Toggle Sidebar
uz: Yon panelni almashtirish

source: Main Menu
uz: Asosiy menyu

source: New _Tab
uz: Yangi tab

source: New _Window
uz: Yangi oyna

source: _Install Documentation…
uz: Dokumentatsiyani oʻrnatish…

source: _About Manuals
uz: Qoʻllanma haqida
