Repository: uzbek-net/dictionary
Catalog: gnome/49/mutter.gnome-49.*.po
Languages: uz

source: Navigation
uz: Navigatsiya

source: Move window to workspace 1
uz: Oynani ish maydoniga oʻtkazing 1

source: Move window to workspace 2
uz: Oynani ish maydoniga oʻtkazing 2

source: Move window to workspace 3
uz: Oynani ish maydoniga oʻtkazing 3

source: Move window to workspace 4
uz: Oynani ish maydoniga oʻtkazing 4

source: Move window to last workspace
uz: Oynani oxirgi ish maydoniga oʻtkazing

source: Move window one workspace to the left
uz: Oynani bitta ish joyini chapga siljiting

source: Move window one workspace to the right
uz: Oynani bitta ish joyini oʻngga oʻtkazing

source: Move window one workspace up
uz: Oynani bir ish joyiga yuqoriga siljiting

source: Move window one workspace down
uz: Oynani bir ish maydoni pastga siljiting

source: Move window one monitor to the left
uz: Oynani bitta monitorni chapga siljiting

source: Move window one monitor to the right
uz: Oynani bitta monitorni oʻngga siljiting

source: Move window one monitor up
uz: Oynani bitta monitorni yuqoriga siljiting

source: Move window one monitor down
uz: Oynani bitta monitorni pastga siljiting

source: Switch applications
uz: Ilovalarni almashtirish

source: Switch to previous application
uz: Oldingi ilovaga oʻtish

source: Switch windows
uz: Derazalarni almashtirish

source: Switch to previous window
uz: Oldingi oynaga oʻtish

source: Switch windows of an application
uz: Ilova oynalarini almashtirish

source: Switch to previous window of an application
uz: Ilovaning oldingi oynasiga oʻtish

source: Switch system controls
uz: Tizim boshqaruvlarini almashtirish

source: Switch to previous system control
uz: Oldingi tizim boshqaruviga oʻting

source: Switch windows directly
uz: Derazalarni toʻgʻridan-toʻgʻri almashtiring

source: Switch directly to previous window
uz: Toʻgʻridan-toʻgʻri oldingi oynaga oʻtish

source: Switch windows of an app directly
uz: Ilova oynalarini toʻgʻridan-toʻgʻri almashtiring

source: Switch directly to previous window of an app
uz: Toʻgʻridan-toʻgʻri ilovaning oldingi oynasiga oʻtish

source: Switch system controls directly
uz: Tizim boshqaruvlarini toʻgʻridan-toʻgʻri almashtiring

source: Switch directly to previous system control
uz: Toʻgʻridan-toʻgʻri oldingi tizim boshqaruviga oʻting

source: Hide all normal windows
uz: Barcha oddiy oynalarni yashiring

source: Switch to workspace 1
uz: Ish joyiga oʻtish 1

source: Switch to workspace 2
uz: Ish joyiga oʻtish 2

source: Switch to workspace 3
uz: Ish joyiga oʻtish 3

source: Switch to workspace 4
uz: Ish joyiga oʻtish 4

source: Switch to last workspace
uz: Oxirgi ish joyiga oʻtish

source: Switch to workspace on the left
uz: Chapdagi ish maydoniga oʻting

source: Switch to workspace on the right
uz: Oʻng tarafdagi ish maydoniga oʻting

source: Switch to workspace above
uz: Yuqoridagi ish maydoniga oʻting

source: Switch to workspace below
uz: Quyidagi ish maydoniga oʻting

source: System
uz: Sistema

source: Show the run command prompt
uz: Ishga tushirish buyruq satrini koʻrsating

source: Restore the keyboard shortcuts
uz: Klaviatura yorliqlarini tiklang

source: Activate the window menu
uz: Oyna menyusini faollashtiring

source: Toggle fullscreen mode
uz: Toʻliq ekran

source: Toggle maximization state
uz: Maksimallashtirish holatini almashtirish

source: Maximize window
uz: Oynani kattalashtirish

source: Restore window
uz: Qayta tiklash oynasi

source: Close window
uz: Oynani yopish

source: Hide window
uz: Oynani yashirish

source: Move window
uz: Oynani siljitish

source: Resize window
uz: Oyna hajmini oʻzgartirish

source: Toggle window on all workspaces or one
uz: Barcha ish joylarida yoki birida oynani almashtirish

source: Raise window if covered, otherwise lower it
uz: Agar oyna yopiq boʻlsa, uni koʻtaring, aks holda uni pastga tushiring

source: Raise window above other windows
uz: Oynani boshqa derazalar ustiga koʻtaring

source: Lower window below other windows
uz: Boshqa oynalar ostidagi oynani pastga tushiring

source: Maximize window vertically
uz: Oynani vertikal ravishda kattalashtirish

source: Maximize window horizontally
uz: Oynani gorizontal ravishda kattalashtirish

source: View split on left
uz: Chapdagi boʻlinishni koʻring

source: View split on right
uz: Oʻngdagi boʻlinishni koʻring

source: Modifier to use for extended window management operations
uz: Kengaytirilgan oyna boshqaruvi operatsiyalari uchun moʻljallangan modifikator

source: This key will initiate the “overlay”, which is a combination window overview and application launching system. The default is intended to be the “Windows key” on PC hardware. It’s expected that this binding either the default or set to the empty string.
uz: Ushbu kalit "qoplamani" ishga tushiradi, bu oynaning umumiy koʻrinishi va ilovalarni ishga tushirish tizimidir. Standart kompyuter uskunasida "Windows kaliti" boʻlishi uchun moʻljallangan. Bu bogʻlanish standart boʻlishi yoki boʻsh qatorga oʻrnatilishi kutilmoqda.

source: Attach modal dialogs
uz: Modal dialoglarni biriktiring

source: When true, instead of having independent titlebars, modal dialogs appear attached to the titlebar of the parent window and are moved together with the parent window.
uz: Qachon rost boʻlsa, mustaqil sarlavhalar oʻrniga modal dialoglar asosiy oynaning sarlavha satriga biriktirilgan holda paydo boʻladi va ota-oyna bilan birga koʻchiriladi.

source: Enable edge tiling when dropping windows on screen edges
uz: Derazalarni ekran chekkalariga tushirishda chekka plitkalarni yoqing

source: If enabled, dropping windows on vertical screen edges maximizes them vertically and resizes them horizontally to cover half of the available area. Dropping windows on the top screen edge maximizes them completely.
uz: Agar yoqilgan boʻlsa, oynalarni ekranning vertikal chetlariga tushirish ularni vertikal ravishda kattalashtiradi va mavjud maydonning yarmini qoplash uchun gorizontal oʻlchamini oʻzgartiradi. Derazalarni ekranning yuqori chetiga tushirish ularni butunlay kattalashtiradi.

source: Workspaces are managed dynamically
uz: Ish joylari dinamik ravishda boshqariladi

source: Determines whether workspaces are managed dynamically or whether there’s a static number of workspaces (determined by the num-workspaces key in org.gnome.desktop.wm.preferences).
uz: Ish joylari dinamik ravishda boshqariladimi yoki ish joylarining statik soni bor-yoʻqligini aniqlaydi (org.gnome.desktop.wm.preferences-dagi ish joylari soni kaliti bilan aniqlanadi).

source: Workspaces only on primary
uz: Ish joylari faqat birlamchida

source: Determines whether workspace switching should happen for windows on all monitors or only for windows on the primary monitor.
uz: Ish joyini almashtirish barcha monitorlardagi oynalar uchun yoki faqat asosiy monitordagi oynalar uchun amalga oshirilishi kerakligini aniqlaydi.

source: Delay focus changes until the pointer stops moving
uz: Koʻrsatkich harakatini toʻxtatmaguncha fokusni kechiktirish oʻzgaradi

source: If set to true, and the focus mode is either “sloppy” or “mouse” then the focus will not be changed immediately when entering a window, but only after the pointer stops moving.
uz: Agar "true" ga oʻrnatilgan boʻlsa va fokus rejimi "beqaror" yoki "sichqoncha" boʻlsa, fokus oynaga kirganda darhol oʻzgartirilmaydi, faqat kursor harakatlanishni toʻxtatgandan keyingina oʻzgartiriladi.

source: Draggable border width
uz: Chiqib olinadigan chegara kengligi

source: The amount of total draggable borders. If the theme’s visible borders are not enough, invisible borders will be added to meet this value.
uz: Jami tortiladigan chegaralar miqdori. Agar mavzuning koʻrinadigan chegaralari etarli boʻlmasa, bu qiymatni qondirish uchun koʻrinmas chegaralar qoʻshiladi.

source: Auto maximize nearly monitor sized windows
uz: Deyarli monitor oʻlchamidagi oynalarni avtomatik kattalashtirish

source: If enabled, new windows that are initially the size of the monitor automatically get maximized.
uz: Agar yoqilgan boʻlsa, dastlab monitor oʻlchamiga ega boʻlgan yangi oynalar avtomatik ravishda kattalashtiriladi.

source: Place new windows in the center
uz: Yangi oynalarni markazga joylashtiring

source: When true, the new windows will always be put in the center of the active screen of the monitor.
uz: Toʻgʻri boʻlsa, yangi oynalar har doim monitorning faol ekranining markaziga joylashtiriladi.

source: Enable experimental features
uz: Eksperimental xususiyatlarni yoqing

source: To enable experimental features, add the feature keyword to the list. Whether the feature requires restarting the compositor depends on the given feature. Any experimental feature is not required to still be available, or configurable. Don’t expect adding anything in this setting to be future proof. Currently possible keywords: • “scale-monitor-framebuffer” — makes mutter default to layout logical monitors in a logical pixel coordinate space, while scaling monitor framebuffers instead of window content, to manage HiDPI monitors. Does not require a restart. • “kms-modifiers” — makes mutter always allocate scanout buffers with explicit modifiers, if supported by the driver. Requires a restart. • “autoclose-xwayland” — automatically terminates Xwayland if all relevant X11 clients are gone. Requires a restart. • “variable-refresh-rate” — makes mutter dynamically adjust the refresh rate of the monitor when applicable if supported by the monitor, GPU and DRM driver. Configurable in Settings. Requires a restart. • “xwayland-native-scaling” — lets Xwayland clients use their native scaling support. If scaling is not supported by client, the client will be unscaled. Setting only takes effect when “scale-monitor-framebuffer” is enabled as well.
uz: Tajribaviy funksiyalarni yoqish uchun roʻyxatga xususiyat kalit soʻzini qoʻshing. Xususiyat kompozitorni qayta ishga tushirishni talab qiladimi yoki yoʻqmi, berilgan xususiyatga bogʻliq. Har qanday eksperimental xususiyat mavjud boʻlishi yoki sozlanishi shart emas. Bu sozlamaga biror narsa qoʻshish kelajakda isbot boʻlishini kutmang. Hozirda mumkin boʻlgan kalit soʻzlar: • “scale-monitor-framebuffer” — HiDPI monitorlarini boshqarish uchun oyna mazmuni oʻrniga monitor freymbuferlarini masshtablashtirganda mantiqiy piksellar koordinatali boʻshliqda mantiqiy monitorlar joylashishini sukut boʻyicha qiladi. Qayta ishga tushirishni talab qilmaydi. • “kms-modifiers” — agar haydovchi tomonidan qoʻllab-quvvatlansa, har doim aniq modifikatorlar bilan skanerlash buferlarini ajratishga majbur qiladi. Qayta ishga tushirishni talab qiladi. • “autoclose-xwayland” — barcha tegishli X11 mijozlari yoʻqolgan boʻlsa, Xwaylandni avtomatik ravishda tugatadi. Qayta ishga tushirishni talab qiladi. • “variable-refresh-rate” — agar monitor, GPU va DRM drayveri tomonidan qoʻllab-quvvatlansa, agar kerak boʻlsa, monitorning yangilanish tezligini dinamik ravishda sozlash imkonini beradi. Sozlamalarda sozlanishi mumkin. Qayta ishga tushirishni talab qiladi. • “xwayland-native-scaling” — Xwayland mijozlariga mahalliy miqyoslash yordamidan foydalanish imkonini beradi. Agar miqyoslash mijoz tomonidan qoʻllab-quvvatlanmasa, mijoz oʻchiriladi. Sozlama faqat “miqyosi-monitor-framebufer” ham yoqilganda kuchga kiradi.

source: Modifier to use to locate the pointer
uz: Koʻrsatkichni aniqlash uchun moʻljallangan modifikator

source: This key will initiate the “locate pointer” action.
uz: Ushbu kalit "koʻrsatkichni aniqlash" harakatini boshlaydi.

source: Timeout for check-alive ping
uz: Pingni tekshirish uchun vaqt tugashi

source: Number of milliseconds a client has to respond to a ping request in order to not be detected as frozen. Using 0 will disable the alive check completely.
uz: Muzlatilgan deb topilmasligi uchun mijoz ping soʻroviga javob berishi kerak boʻlgan millisekundlar soni. 0 dan foydalanish tirik chekni butunlay oʻchirib qoʻyadi.

source: Per output luminance settings
uz: Har bir chiqish yorqinligi sozlamalari

source: Per output and color mode luminance setting. Each entry consists of a tuple with connector, vendor, product, serial, and a color mode, as well as an associated floating point value representing the output luminance in percent (%). The default when not specified is 100%.
uz: Chiqish va rang rejimining yorugʻlik sozlamalari boʻyicha. Har bir yozuv konnektor, sotuvchi, mahsulot, seriyali va rang rejimiga ega kortejdan, shuningdek, chiqish yorqinligini foizda (%) ifodalovchi tegishli suzuvchi nuqta qiymatidan iborat. Belgilanmagan boʻlsa, sukut boʻyicha 100%.

source: Switch monitor configurations
uz: Monitor konfiguratsiyasini almashtiring

source: Rotates the built-in monitor configuration
uz: Oʻrnatilgan monitor konfiguratsiyasini aylantiradi

source: Cancel any active input capture session
uz: Har qanday faol kiritish seansini bekor qiling

source: Switch to VT 1
uz: VT 1 ga oʻtish

source: Switch to VT 2
uz: VT 2 ga oʻtish

source: Switch to VT 3
uz: VT 3 ga oʻtish

source: Switch to VT 4
uz: VT 4 ga oʻtish

source: Switch to VT 5
uz: VT 5 ga oʻtish

source: Switch to VT 6
uz: VT 6 ga oʻtish

source: Switch to VT 7
uz: VT 7 ga oʻtish

source: Switch to VT 8
uz: VT 8 ga oʻtish

source: Switch to VT 9
uz: VT 9 ga oʻtish

source: Switch to VT 10
uz: VT 10 ga oʻtish

source: Switch to VT 11
uz: VT 11 ga oʻtish

source: Switch to VT 12
uz: VT 12 ga oʻtish

source: Re-enable shortcuts
uz: Yorliqlarni qayta yoqing

source: Allow X11 grabs to lock keyboard focus with Xwayland
uz: Xwayland bilan klaviatura fokusini bloklash uchun X11 tutqichlariga ruxsat bering

source: Allow all keyboard events to be routed to X11 “override redirect” windows with a grab when running in Xwayland. This option is to support X11 clients which map an “override redirect” window (which do not receive keyboard focus) and issue a keyboard grab to force all keyboard events to that window. This option is seldom used and has no effect on regular X11 windows which can receive keyboard focus under normal circumstances. For a X11 grab to be taken into account under Wayland, the client must also either send a specific X11 ClientMessage to the root window or be among the applications allowed in key “xwayland-grab-access-rules”.
uz: Xwaylandda ishlayotganda barcha klaviatura hodisalarini X11 “override redirect” oynalariga yoʻnaltirishga ruxsat bering. Bu parametr “qayta yoʻnaltirishni bekor qilish” oynasini xaritalashtirgan (klaviatura fokusini qabul qilmaydigan) va barcha klaviatura hodisalarini ushbu oynaga majburlash uchun klaviaturani ushlab turuvchi X11 mijozlarini qoʻllab-quvvatlashdir. Ushbu parametr kamdan-kam qoʻllaniladi va oddiy holatlarda klaviatura fokusini oladigan oddiy X11 oynalariga ta'sir qilmaydi. Wayland boʻyicha X11 grabini hisobga olish uchun mijoz ildiz oynasiga ma'lum bir X11 ClientMessage yuborishi yoki "xwayland-grab-access-rules" kalitida ruxsat etilgan ilovalar qatoriga kirishi kerak.

source: Xwayland applications allowed to issue keyboard grabs
uz: Xwayland ilovalari klaviatura tutqichlarini chiqarishga ruxsat berdi

source: List the resource names or resource class of X11 windows either allowed or not allowed to issue X11 keyboard grabs under Xwayland. The resource name or resource class of a given X11 window can be obtained using the command “xprop WM_CLASS”. Wildcards “*” and jokers “?” in the values are supported. Values starting with “!” are denied, which has precedence over the list of values allowed, to revoke applications from the default system list. The default system list includes the following applications: “@XWAYLAND_GRAB_DEFAULT_ACCESS_RULES@” Users can break an existing grab by using the specific keyboard shortcut defined by the keybinding key “restore-shortcuts”.
uz: Xwayland ostida X11 klaviatura tutqichlarini chiqarishga ruxsat berilgan yoki ruxsat etilmagan X11 oynalarining manba nomlari yoki resurs sinfini sanab oʻting. Berilgan X11 oynasining resurs nomi yoki resurs sinfini “xprop WM_CLASS” buyrugʻi yordamida olish mumkin. Joker belgilar “*” va jokerlar “?” qiymatlarda qoʻllab-quvvatlanadi. “!” bilan boshlanadigan qiymatlar ilovalarni standart tizim roʻyxatidan bekor qilish uchun ruxsat etilgan qiymatlar roʻyxatidan ustunlikka ega boʻlgan rad etiladi. Odatiy tizim roʻyxati quyidagi ilovalarni oʻz ichiga oladi: “@XWAYLAND_GRAB_DEFAULT_ACCESS_RULES@” Foydalanuvchilar “qayta tiklash-yorliqlar” tugmalar birikmasi tugmasi bilan belgilangan maxsus klaviatura yorliqlari yordamida mavjud tutqichni buzishi mumkin.

source: Disable selected X extensions in Xwayland
uz: Xwayland-da tanlangan X kengaytmalarini oʻchirib qoʻying

source: This option disables the selected X extensions in Xwayland if Xwayland was built with support for those X extensions. This option has no effect if Xwayland was built without support for the selected extensions. Xwayland needs to be restarted for this setting to take effect.
uz: Agar Xwayland oʻsha X kengaytmalarini qoʻllab-quvvatlagan holda qurilgan boʻlsa, ushbu parametr Xwaylandʼda tanlangan X kengaytmalarini oʻchirib qoʻyadi. Xwayland tanlangan kengaytmalarni qoʻllab-quvvatlamasdan qurilgan boʻlsa, bu parametr ta'sir qilmaydi. Bu sozlama kuchga kirishi uchun Xwayland qayta ishga tushirilishi kerak.

source: Allow X11 clients with a different endianness to connect to Xwayland
uz: Xwayland-ga boshqa turdagi X11 mijozlariga ulanishga ruxsat bering

source: Allow connections from clients with an endianness different to that of Xwayland. The X server byte-swapping code is a huge attack surface, much of that code in Xwayland is prone to security issues. The use-case of byte-swapped clients is very niche, and disabled by default in Xwayland. Enable this option to instruct Xwayland to accept connections from X11 clients with a different endianness. This option has no effect if Xwayland does not support the command line option +byteswappedclients/-byteswappedclients to control that setting. Xwayland needs to be restarted for this setting to take effect.
uz: Xwaylandnikidan farqli boʻlgan mijozlardan ulanishga ruxsat bering. X server bayt almashish kodi katta hujum yuzasi boʻlib, Xwaylanddagi ushbu kodning aksariyati xavfsizlik muammolariga moyil. Bayt almashtirilgan mijozlardan foydalanish juda qulay va Xwaylandda sukut boʻyicha oʻchirib qoʻyilgan. Xwayland-ga X11 mijozlaridan ulanishlarni qabul qilishni koʻrsatish uchun ushbu parametrni yoqing. Xwayland ushbu sozlamani boshqarish uchun +byteswappedclients/-byteswappedclients buyruq qatori opsiyasini qoʻllab-quvvatlamasa, bu parametr ta'sir qilmaydi. Bu sozlama kuchga kirishi uchun Xwayland qayta ishga tushirilishi kerak.

source: Built-in display
uz: Oʻrnatilgan displey

source: Unknown
uz: Nomaʼlum

source: Unknown Display
uz: Noma'lum displey

source: Bell event
uz: Qoʻngʻiroq hodisasi

source: Privacy Screen Enabled
uz: Maxfiylik ekrani yoqilgan

source: Privacy Screen Disabled
uz: Maxfiylik ekrani oʻchirilgan

source: Replace the running window manager
uz: Ishlayotgan oyna boshqaruvchisini almashtiring

source: X Display to use
uz: Foydalanish uchun X displey

source: Make X calls synchronous
uz: X qoʻngʻiroqlarini sinxronlashtiring

source: Run as a wayland compositor
uz: Wayland kompozitori sifatida ishga tushiring

source: Run as a nested compositor
uz: Ichki kompozitor sifatida ishga tushirish

source: Run wayland compositor without starting Xwayland
uz: Xwaylandni ishga tushirmasdan wayland kompozitorini ishga tushiring

source: Specify Wayland display name to use
uz: Foydalanish uchun Wayland displey nomini belgilang

source: Run as a full display server, rather than nested
uz: Oʻrnatilgan emas, balki toʻliq displey serveri sifatida ishga tushiring

source: Run as a headless display server
uz: Boshsiz displey serveri sifatida ishga tushirish

source: Add persistent virtual monitor (WxH or WxH@R)
uz: Doimiy virtual monitor qoʻshing (WxH yoki WxH@R)

source: Run with X11 backend
uz: X11 backend bilan ishga tushirish

source: Profile performance using trace instrumentation
uz: Izlanish asboblari yordamida profilning ishlashi

source: Enable debug control D-Bus interface
uz: Nosozliklarni tuzatish boshqaruvi D-Bus interfeysini yoqish

source: Mode Switch (Group %d)
uz: Tartibni almashtirish (%d-guruh)

source: Mode Switch
uz: Rejimni almashtirish

source: Switch monitor
uz: Monitorni almashtirish

source: Show on-screen help
uz: Ekrandagi yordamni koʻrsatish

source: Compositor
uz: Kompozitor

source: Print version
uz: Chop etish versiyasi

source: Mutter plugin to use
uz: Foydalanish uchun Mutter plagini

source: Workspace %d
uz: Ish maydoni %d

source: Mutter was compiled without support for verbose mode
uz: Mutter batafsil rejimni qoʻllab-quvvatlamasdan tuzilgan

source: Workspace switched
uz: Ish joyi almashtirildi

source: Mode Switch: Mode %d
uz: Tartibni almashtirish: %d-rejim

source: Display “%s” already has a window manager; try using the --replace option to replace the current window manager.
uz: Displey “%s” allaqachon oyna boshqaruvchisiga ega; joriy oyna boshqaruvchisini almashtirish uchun --replace opsiyasidan foydalaning.

source: Failed to open X Window System display “%s”
uz: X Window System displeyi “%s” ochilmadi

source: Format %s not supported
uz: %s formati qoʻllab-quvvatlanmaydi
