Repository: uzbek-net/dictionary
Catalog: gnome/infra/ui.main.*.po
Languages: uz

source: All information about the Vala programming language for users, its syntax, tooling, and many code examples
uz: Foydalanuvchilar uchun Vala dasturlash tili haqidagi barcha ma'lumotlar, uning sintaksisi, asboblari va koʻplab kod misollari

source: All participants are expected to follow this Code of Conduct
uz: Barcha ishtirokchilar ushbu Xulq-atvor kodeksiga amal qilishlari kerak

source: App name…
uz: Ilova nomi…

source: Apps for GNOME
uz: GNOME uchun ilovalar

source: As a Core app, it is also pre-installed on [GNOME OS Nightly](https://os.gnome.org/) which you can install as a virtual machine.
uz: Yadro ilovasi sifatida u [GNOME OS Nightly](https://os.gnome.org/) da oldindan oʻrnatilgan boʻlib, uni virtual mashina sifatida oʻrnatishingiz mumkin.

source: Brand Book
uz: Brend kitobi

source: Building blocks for modern GNOME apps
uz: Zamonaviy GNOME ilovalari uchun qurilish bloklari

source: Chat for discussing websites
uz: Veb-saytlarni muhokama qilish uchun chat

source: Clone Repository
uz: Repositoriyni klon qilish

source: Clone Repository…
uz: Repositoriyni klon qilish…

source: Close Language Selection
uz: Til tanlashni yoping

source: Code Repository
uz: Kod Repositoriysi

source: Code of Conduct
uz: Odob-axloq qoidalari

source: Contact
uz: Kontakt

source: Contrast
uz: Kontrast

source: Design
uz: Dizayn

source: Design Team on GitLab
uz: GitLab-da dizayn jamoasi

source: Design team issue tracking and work archive
uz: Dizayn jamoasi muammolarni kuzatish va ish arxivi

source: Design user interfaces, user experience, and visuals
uz: Foydalanuvchi interfeyslarini, foydalanuvchi tajribasini va ingl

source: Developer Center
uz: Dasturchilar markazi

source: Development Platform
uz: Rivojlanish platformasi

source: Documentation
uz: Hujjatlar

source: Edit this Page
uz: Ushbu Sahifani tahrirlang

source: Engage
uz: Ishtirok etish

source: Explore all the GNOME-related chat rooms in our Matrix space
uz: Matrix makonimizdagi GNOME bilan bogʻliq barcha chat xonalarini oʻrganing

source: Explore which languages can be used to write GNOME apps
uz: GNOME ilovalarini yozish uchun qaysi tillardan foydalanish mumkinligini oʻrganing

source: Feedback
uz: Fikr-mulohaza

source: First, you can fork *{2}* via the [{1} page]({0}). You only need to do this once for every project you work on.
uz: Birinchidan, siz [{1} sahifa]({0}) orqali *{2}* tugmachasini bosishingiz mumkin. Siz ishlayotgan har bir loyiha uchun buni faqat bir marta qilishingiz kerak.

source: Foundation News
uz: Jamgʻarma yangiliklari

source: GNOME Circle
uz: GNOME doirasi

source: GNOME Code of Conduct
uz: GNOME axloq kodeksi

source: GNOME Development Center
uz: GNOME rivojlantirish markazi

source: GNOME Foundation
uz: GNOME fondi

source: GNOME Handbook
uz: GNOME qoʻllanma

source: GNOME Nightly
uz: GNOME kechasi

source: GSoC is an online mentoring program focused on introducing new contributors to open source software development.
uz: GSoC - bu ochiq kodli dasturiy ta'minotni ishlab chiqishda yangi hissa qoʻshuvchilarni tanishtirishga qaratilgan onlayn murabbiylik dasturi.

source: GTK is built on libraries like GLib and GIO
uz: GTK GLib va GIO kabi kutubxonalarda qurilgan

source: GTK is the underlying library for the user interface
uz: GTK foydalanuvchi interfeysi uchun asosiy kutubxona hisoblanadi

source: GTK&nbsp;4 Docs
uz: GTK 4 Hujjatlar

source: GTK&nbsp;4 docs
uz: GTK 4 hujjatlari

source: Get help in the matrix channel of the translation project
uz: Tarjima loyihasining matritsa kanalida yordam oling

source: Home of the Websites Team on GitLab
uz: GitLab-dagi veb-saytlar jamoasining uyi

source: How to use GTK, the underlying library for user interfaces, and other libraries
uz: GTK, foydalanuvchi interfeyslari uchun asosiy kutubxona va boshqa kutubxonalardan qanday foydalanish kerak

source: If you are overwhelmed by working on an existing GNOME app, you can also look into [building your own app]({0}) for learning purposes first.
uz: Mavjud GNOME ilovasi ustida ishlayotgan boʻlsangiz, avval oʻrganish maqsadida [oʻz ilovangizni yaratish]({0}) ni ham koʻrib chiqishingiz mumkin.

source: If you found an issue or want to propose a change you should try to make sure you have tried out the latest version of {0}. You can check the current version in the app’s “About” section.
uz: Agar muammo topsangiz yoki oʻzgartirishni taklif qilmoqchi boʻlsangiz, {0} ilovasining soʻnggi versiyasini sinab koʻrganingizga ishonch hosil qiling. Joriy versiyani ilovaning "Haqida" boʻlimida tekshirishingiz mumkin.

source: Install Builder
uz: Builder-ni oʻrnating

source: Install Nightly
uz: Nightly-ni oʻrnating

source: Install from Flathub
uz: Flathub-dan oʻrnating

source: Install latest build of the app
uz: Ilovaning soʻnggi versiyasini oʻrnating

source: Install latest version of the app from Flathub
uz: Flathub-dan ilovaning soʻnggi versiyasini oʻrnating

source: Install the Builder app from Flathub
uz: Flathub-dan Builder ilovasini oʻrnating

source: Issue Tracker
uz: Muammo kuzatuvchisi

source: JavaScript Bindings Reference
uz: JavaScript ulanishlari uchun havola

source: Latest Release
uz: Oxirgi nashr

source: Learn how you can contribute to the GNOME project
uz: GNOME loyihasiga qanday hissa qoʻshishingiz mumkinligini bilib oling

source: Learn how you can publish your app on Flathub
uz: Ilovangizni Flathub-da qanday nashr etishingiz mumkinligini bilib oling

source: Learn more about GNOME nightly apps.
uz: GNOME tungi ilovalari haqida koʻproq bilib oling.

source: Learn more about how to translate this app
uz: Ushbu ilovani qanday tarjima qilish haqida koʻproq bilib oling

source: Learn more about this app on apps.gnome.org
uz: Apps.gnome.org saytida ushbu ilova haqida batafsil maʼlumot oling

source: Libadwaita Docs
uz: Libadwaita hujjatlari

source: Libadwaita docs
uz: Libadwaita hujjatlari

source: Main development repository of the Vala language and compiler, issue tracker and contribution platform
uz: Vala tilining asosiy rivojlanish ombori va kompilyator, emissiya kuzatuvchisi va hissa platformasi

source: Maintain websites and create content
uz: Veb-saytlarni saqlang va kontent yarating

source: Mastodon Account
uz: Mastodon hisobi

source: Matrix Community
uz: Matritsa hamjamiyati

source: Matrix channel for all Vala related questions
uz: Vala bilan bogʻliq barcha savollar uchun matritsa kanali

source: Matrix channel for all questions related to JavaScript in GNOME
uz: GNOME'da JavaScript bilan bogʻliq barcha savollar uchun matritsali kanal

source: Matrix channel for all questions related to Python in GNOME
uz: GNOME-da Python bilan bogʻliq barcha savollar uchun matritsali kanal

source: Merch
uz: Tovar

source: More API References
uz: Koʻproq API havolalari

source: More about the translation project in GNOME
uz: GNOME-da tarjima loyihasi haqida koʻproq

source: More documentation for GObject libraries
uz: GObject kutubxonalari uchun qoʻshimcha hujjatlar

source: News
uz: Yangiliklar

source: Next, we want to make sure that git on your computer can also use your {0} account. For this, you need an SSH key. If you don't have an SSH key yet you can [generate a new one](https://docs.gitlab.com/ee/user/ssh.html#generate-an-ssh-key-pair) using [Console](https://apps.gnome.org/Console/). Alternatively, you can generate one using the [Passwords and Keys](https://flathub.org/apps/org.gnome.seahorse.Application) app.
uz: Keyinchalik, kompyuteringizdagi git sizning {0} hisobingizdan ham foydalanishi mumkinligiga ishonch hosil qilmoqchimiz. Buning uchun sizga SSH kaliti kerak boʻladi. Agar sizda hali SSH kaliti boʻlmasa, [Console](https://apps.gnome.org/Console/) yordamida [yangisini yaratishingiz](https://docs.gitlab.com/ee/user/ssh.html#generate-an-ssh-key-pair) mumkin. Shu bilan bir qatorda, siz [Parollar va kalitlar](https://flathub.org/apps/org.gnome.seahorse.Application) ilovasidan foydalanib yaratishingiz mumkin.

source: No apps matching the given search found.
uz: Berilgan qidiruvga mos keladigan ilovalar topilmadi.

source: Now, we have to let git in your local project know of your personal copy on {0} via this URL. For this we need to go back to the command line. First, you have to change ([`cd`](https://www.gnu.org/software/bash/manual/bash.html#index-cd)) into the project you have been working on. Afterwards you can use the command
uz: Endi biz mahalliy loyihangizdagi git-ga ushbu URL orqali {0} saytidagi shaxsiy nusxangiz haqida xabar berishimiz kerak. Buning uchun biz buyruq satriga qaytishimiz kerak. Avval siz ishlayotgan loyihaga ([`cd`](https://www.gnu.org/software/bash/manual/bash.html#index-cd)) oʻzgartirishingiz kerak. Shundan soʻng siz buyruqdan foydalanishingiz mumkin

source: Official Vala Documentation
uz: Rasmiy Vala hujjatlari

source: On this page you can learn how to contribute to *{0}*. If you are interested in general information about this app, please visit the [Apps for GNOME page]({1}).
uz: Ushbu sahifada siz *{0}* ga qanday hissa qoʻshishni oʻrganishingiz mumkin. Agar siz ushbu ilova haqida umumiy maʼlumotga qiziqsangiz, [GNOME uchun ilovalar sahifasiga]({1}) tashrif buyuring.

source: Outreachy
uz: Aloqa

source: Outreachy provides internships to people subject to systemic bias and impacted by underrepresentation in the technical industry where they are living.
uz: Autreachy tizimli tarafkashlikka duchor boʻlgan va ular yashayotgan texnik sohada kam vakillik ta'siriga uchragan odamlarga amaliyot oʻtashini ta'minlaydi.

source: Overview
uz: Umumiy nuqtai

source: Overview of many important development resources for GNOME
uz: GNOME uchun koʻplab muhim rivojlanish resurslariga umumiy nuqtai

source: Page generated {0}
uz: Sahifa yaratildi: {0}

source: Palette
uz: Palitra

source: Planet GNOME
uz: GNOME sayyorasi

source: Privacy Policy
uz: Maxfiylik siyosati

source: Programming
uz: Dasturlash

source: Programming Languages
uz: Dasturlash tillari

source: Programming language…
uz: Dasturlash tili…

source: Project translation on Weblate hosting
uz: Weblate xostingida loyiha tarjimasi

source: Publish on Flathub
uz: Flathub-da nashr qilish

source: Random suggestions out of available apps.
uz: Mavjud ilovalardan tasodifiy takliflar.

source: Repository URL
uz: Repozitoriy URL

source: Resources
uz: Resurslar

source: Rust GTK Core docs
uz: Rust GTK Core hujjatlari

source: Rust GTK&nbsp;4 docs
uz: Rust GTK 4 hujjatlari

source: Select Language
uz: Tilni tanlang

source: Some of our websites are translated into different languages. You can find the translations in the [*Infrastructure* category]({0}).
uz: Ba'zi veb-saytlarimiz turli tillarga tarjima qilingan. Tarjimalarni [*Infratuzilma* turkumi]({0})da topishingiz mumkin.

source: Style guide for designing print material and websites for GNOME
uz: GNOME uchun bosma materiallar va veb-saytlarni loyihalash uchun uslublar qoʻllanmasi

source: The URL is available next to the “HTTPS” and “SSH” buttons after clicking the “SSH” button.
uz: URL "SSH" tugmasini bosgandan soʻng "HTTPS" va "SSH" tugmalari yonida mavjud.

source: The URL is available under the button “Code” below “SSH.”
uz: URL manzili “SSH” ostidagi “Kod” tugmasi ostida mavjud.

source: The app’s Matrix chat for project specific questions
uz: Loyihaga oid savollar uchun ilovaning Matrix suhbati

source: The app’s translation status on GNOME’s localization system
uz: GNOME mahalliylashtirish tizimida ilovaning tarjima holati

source: The first step is to create a [new {0} account]({1}) if you don’t own one already. You just have to use the linked webform for that.
uz: Birinchi qadam, agar sizda hali boʻlmasa, [yangi {0} hisob]({1}) yaratish. Buning uchun faqat bogʻlangan veb-shakldan foydalanishingiz kerak.

source: The latest released version on Flathub is version {0}.
uz: Flathub-da eng soʻnggi chiqarilgan versiya {0}.

source: The main channel for GNOME design discussions
uz: GNOME dizayn muhokamalari uchun asosiy kanal

source: The project’s home, keeping the source code and more information
uz: Loyihaning uyi, manba kodini va qoʻshimcha ma'lumotlarni saqlaydi

source: The “GNOME Newcomers” chat can help you get started
uz: “GNOME yangi kelganlar” suhbati sizga boshlashingizga yordam beradi

source: The “Rust ❤️ GNOME” Matrix channel: All about using Rust in GNOME
uz: "Rust ❤️ GNOME" Matrix kanali: GNOME-da Rustdan foydalanish haqida hamma narsa

source: This Week in GNOME
uz: Bu hafta GNOME-da

source: This app is built with the *{0}* programming language.
uz: Bu ilova *{0}* dasturlash tili bilan yaratilgan.

source: This page
uz: Bu sahifa

source: To suggest changes to a project, you first have to create your own copy of the project on {0}. Creating this copy is also referred to as *forking*. You will need your own copy – or *fork* – of the project to upload your changes to this copy.
uz: Loyihaga oʻzgartirish taklif qilish uchun avvalo loyihaning oʻz nusxasini {0} da yaratishingiz kerak. Ushbu nusxani yaratish *forking* deb ham ataladi. Ushbu nusxaga oʻzgartirishlaringizni yuklash uchun sizga loyihaning shaxsiy nusxasi yoki *vilka* kerak boʻladi.

source: Translate on Weblate
uz: Weblate orqali tarjima qiling

source: Translate this app
uz: Ushbu ilovani tarjima qiling

source: Translation
uz: Tarjima

source: Translation Project
uz: Tarjima loyihasi

source: Translation on Damned Lies
uz: Damned Lies haqida tarjima

source: Typography
uz: Tipografiya

source: Use GNOME’s infrastructure to host your project
uz: Loyihangizni joylashtirish uchun GNOME infratuzilmasidan foydalaning

source: Vala Bindings API References
uz: Vala Bindings API havolalari

source: View all GNOME Teams
uz: Barcha GNOME jamoalarini koʻring

source: View existing issues and feature requests or add new ones
uz: Mavjud muammolar va xususiyat soʻrovlarini koʻring yoki yangilarini qoʻshing

source: View issues labeled “Newcomer” in the issue tracker
uz: Muammo kuzatuvchisida “Yangi kelgan” deb nomlangan muammolarni koʻring

source: We begin with some preparations on {0}, where the project is hosted. This process might look quite involved if you are going through it for the first time, but you will become much more accustomed to it over time.
uz: Biz loyihaga mezbonlik qilgan {0} da ba'zi tayyorgarliklarni boshlaymiz. Agar siz buni birinchi marta boshdan kechirayotgan boʻlsangiz, bu jarayon juda murakkab koʻrinishi mumkin, ammo vaqt oʻtishi bilan siz bunga koʻproq oʻrganib qolasiz.

source: We now have to find out the SSH URL for your fork. You can find it on the page you are redirected to after creating the fork. The page of the fork will also be listed on your profile.
uz: Endi vilkangiz uchun SSH URL manzilini topishimiz kerak. Siz uni vilkalar yaratgandan soʻng yoʻnaltirilgan sahifada topishingiz mumkin. Vilkaning sahifasi ham profilingizda koʻrsatiladi.

source: Websites
uz: Veb-saytlar

source: Websites Team
uz: Veb-saytlar jamoasi

source: Welcome to GNOME
uz: GNOME ga xush kelibsiz

source: Write code and engineer technical solutions
uz: Kodni yozing va texnik echimlarni ishlab chiqing

source: Write documentation, help pages, and manuals
uz: Hujjatlarni, yordam sahifalarini va qoʻllanmalarni yozing

source: You can do this by [manually building the app](#getting-the-app-to-build) and trying it out.
uz: Buni [ilovani qoʻlda yaratish](#getting-the-app-to-build) va uni sinab koʻrish orqali qilishingiz mumkin.

source: You now have to add your public SSH key to the [“SSH Keys” setting]({0}) on {1}. Public SSH keys are stored in the `.ssh` folder in your home directory as files with the ending `.pub`. You can print all your public SSH keys via the command `cat ~/.ssh/*.pub`. You can also view the public SSH keys using the *Passwords and Keys* app.
uz: Endi siz umumiy SSH kalitingizni {1} da [“SSH kalitlari” sozlamasiga]({0}) qoʻshishingiz kerak. Umumiy SSH kalitlari uy katalogingizdagi “.ssh” jildida “.pub” tugaydigan fayllar sifatida saqlanadi. Siz barcha ochiq SSH kalitlaringizni `cat ~/.ssh/*.pub` buyrugʻi orqali chop etishingiz mumkin. Shuningdek, siz *Parollar va kalitlar* ilovasi yordamida umumiy SSH kalitlarini koʻrishingiz mumkin.

source: YouTube Channel
uz: YouTube kanali

source: © 2022–{} The “Welcome to GNOME” contributors
uz: © 2022–{} “GNOME’ga xush kelibsiz” mualliflari

source: “Newcomer” issues
uz: "Yangi kelganlar" muammolari

source: Translating the app
uz: Ilova tarjima qilinmoqda

source: The original text in apps is usually written in American English. The translation into other languages can be added by translators separately. The translation usually encompasses the apps’ user interface as well as the metadata shown in places like [Software](https://apps.gnome.org/app/org.gnome.Software/) or [apps.gnome.org](https://apps.gnome.org). Common abbreviations used in this context are *l10n* (localization) and *i18n* (internationalization).
uz: Ilovalardagi asl matn odatda amerikacha ingliz tilida yoziladi. Boshqa tillarga tarjima tarjimonlar tomonidan alohida qoʻshilishi mumkin. Tarjima odatda ilovalarning foydalanuvchi interfeysini hamda [Software](https://apps.gnome.org/app/org.gnome.Software/) yoki [apps.gnome.org](https://apps.gnome.org) kabi joylarda koʻrsatilgan metamaʼlumotlarni oʻz ichiga oladi. Ushbu kontekstda ishlatiladigan umumiy qisqartmalar *l10n* (lokalizatsiya) va *i18n* (xalqarolashtirish).

source: It looks like this app does not provide a way to be translated, yet. Feel free to file an issue against the project to ask for a way to translate this app.
uz: Bu ilova hali tarjima qilish usulini taqdim etmaganga oʻxshaydi. Ushbu ilovani tarjima qilish yoʻlini soʻrash uchun loyihaga qarshi muammo qoʻyishingiz mumkin.

source: The translation of this project is managed via Weblate hosting. This platform is not part of the GNOME project.
uz: Ushbu loyihaning tarjimasi Weblate hosting orqali boshqariladi. Ushbu platforma GNOME loyihasining bir qismi emas.

source: This app is translated via the [GNOME translation system](https://l10n.gnome.org) called *Damned Lies*.
uz: Bu ilova [GNOME tarjima tizimi](https://l10n.gnome.org) orqali *La'nati yolgʻon* deb tarjima qilingan.

source: Trying the latest version
uz: Eng soʻnggi versiya sinab koʻrilmoqda

source: When reporting an issue or suggesting a feature, it can be helpful to base the report on the latest version of the app. To this end, you can check the installation methods below.
uz: Muammo haqida xabar berayotganda yoki biror xususiyatni taklif qilganda, hisobotni ilovaning soʻnggi versiyasiga asoslash foydali boʻlishi mumkin. Shu maqsadda siz quyidagi oʻrnatish usullarini tekshirishingiz mumkin.

source: Installation from Flathub
uz: Flathub-dan oʻrnatish

source: For technical reasons, the latest version of this app cannot be easily tested. This is the case for very few apps that need tight integration with the system.
uz: Texnik sabablarga koʻra, ushbu ilovaning soʻnggi versiyasini osongina sinab koʻrish mumkin emas. Bu tizim bilan qattiq integratsiyaga muhtoj boʻlgan juda kam sonli ilovalarga tegishli.

source: Installing a nightly build
uz: Kecha qurilishini oʻrnatish

source: Quality testing
uz: Sifat sinovi

source: Catching issues and regressions before they land in a stable release is very valuable for a project. You can help with this by trying out an upcoming release.
uz: Muammolar va regressiyalarni barqaror nashrga tushishidan oldin ushlash loyiha uchun juda qimmatlidir. Kelgusi versiyani sinab koʻrish orqali bunga yordam berishingiz mumkin.

source: This app allows to install a version of its current development status. Such installations were traditionally generated each night, giving them the name “nightly builds.” Nowadays, they are usually regenerated whenever the main development version changes.
uz: Ushbu ilova uning joriy rivojlanish holatining versiyasini oʻrnatish imkonini beradi. Bunday oʻrnatishlar an'anaviy ravishda har kecha ishlab chiqarilgan va ularga "tungi inshootlar" nomini bergan. Hozirgi vaqtda ular odatda asosiy ishlab chiqish versiyasi oʻzgarganda qayta tiklanadi.

source: Chasing issues
uz: Muammolarni ta'qib qilish

source: For many apps, the issue tracker is a central place for coordination of app development. It is not only used to track all existing problems but also to plan new features and other miscellaneous tasks.
uz: Koʻpgina ilovalar uchun muammolarni kuzatuvchisi ilovalarni ishlab chiqishni muvofiqlashtirish uchun markaziy joydir. U nafaqat barcha mavjud muammolarni kuzatish, balki yangi xususiyatlar va boshqa turli vazifalarni rejalashtirish uchun ham qoʻllaniladi.

source: This app does not currently provide information on where to inspect issues.
uz: Bu ilova hozirda muammolarni qayerda tekshirish kerakligi haqida maʼlumot bermaydi.

source: **Warning:** Nightly builds of apps should only be used for testing and not for actual tasks. You can identify nightly builds of the app on your system via the stripes in the app’s icon and the stripes in the app’s headerbar. They usually use a different configuration than other installations of this app. However, there is no guarantee that the installation of these apps will work as intended. Never work on data with nightly builds of apps without having backups available.
uz: **Ogohlantirish:** Ilovalarning tungi tuzilmalari haqiqiy vazifalar uchun emas, balki faqat sinov uchun ishlatilishi kerak. Siz ilovaning piktogrammasidagi chiziqlar va ilovaning sarlavhasidagi chiziqlar orqali tizimingizdagi ilovaning tungi tuzilishini aniqlashingiz mumkin. Ular odatda ushbu ilovaning boshqa oʻrnatishlaridan farqli konfiguratsiyadan foydalanadilar. Biroq, ushbu ilovalarning oʻrnatilishi moʻljallangan tarzda ishlashiga kafolat yoʻq. Hech qachon zaxira nusxalari mavjud boʻlmasdan, tungi ilovalar bilan ma'lumotlar ustida ishlamang.

source: Reporting found issues
uz: Topilgan muammolar haqida xabar berish

source: Reporting issues you found when using the app can be of high value for app maintainers. However, processing issue reports can also take considerable amount of time. You can take on some of the work by trying the following steps:
uz: Ilovadan foydalanishda topilgan muammolar haqida xabar berish ilova ta’minotchilari uchun katta ahamiyatga ega boʻlishi mumkin. Biroq, muammo hisobotlarini qayta ishlash ham ancha vaqt talab qilishi mumkin. Quyidagi amallarni bajarib, ba'zi ishlarni bajarishingiz mumkin:

source: Search the issue tracker to find out if the issue has already been reported.
uz: Muammo allaqachon xabar qilingan yoki yoʻqligini bilish uchun muammo kuzatuvchisini qidiring.

source: Check if the issue also exists in the [latest version of the app](#trying-the-latest-version).
uz: Muammo [ilovaning soʻnggi versiyasida](#trying-the-latest-version) ham bor yoki yoʻqligini tekshiring (#eng soʻnggi versiyada sinab koʻring).

source: If applicable, try to find out under which exact circumstances the problem occurs.
uz: Agar mavjud boʻlsa, muammo aynan qaysi holatlarda yuzaga kelganini aniqlashga harakat qiling.

source: Report all potentially relevant information, like the version of the app that expose the behavior.
uz: Ilovaning xatti-harakatini koʻrsatadigan versiyasi kabi barcha potentsial tegishli ma’lumotlar haqida xabar bering.

source: Diagnosing listed issues
uz: Roʻyxatdagi muammolarni diagnostika qilish

source: The issue tracker can also help you find open tasks you could tackle. Before implementing a new feature, it is usually a good idea to check in with the maintainers if merge requests for this feature would be accepted.
uz: Muammoni kuzatuvchisi, shuningdek, hal qilishingiz mumkin boʻlgan ochiq vazifalarni topishga yordam beradi. Yangi xususiyatni amalga oshirishdan oldin, odatda, ushbu xususiyat uchun birlashma soʻrovlari qabul qilinadimi yoki yoʻqligini ta'minlovchilar bilan tekshirish yaxshi boʻladi.
