Repository: uzbek-net/dictionary
Catalog: gnome/infra/ui.main.*.po
Languages: uz

source: New user experience designs are stored and tracked in the team’s public mockup repositories, which can also be found in GitLab.
uz: Yangi foydalanuvchi tajribasi dizaynlari GitLab-da ham topilishi mumkin boʻlgan jamoaning umumiy maket omborlarida saqlanadi va kuzatiladi.

source: Getting up to speed
uz: Tezlikni oshirish

source: Everyone who works on GNOME user experience and design should be familiar with:
uz: GNOME foydalanuvchi tajribasi va dizayni ustida ishlaydigan har bir kishi quyidagilarni bilishi kerak:

source: GNOME’s design guidelines, called the [GNOME Human Interface Guidelines](https://developer.gnome.org/hig/).
uz: GNOME dizayn koʻrsatmalari [GNOME Inson interfeysi boʻyicha koʻrsatmalar](https://developer.gnome.org/hig/).

source: Existing GNOME design work, including the current state of GNOME itself, as well as our latest design work.
uz: Mavjud GNOME dizayn ishlari, shu jumladan GNOME ning hozirgi holati, shuningdek, bizning soʻnggi dizayn ishimiz.

source: The posts in the design team’s [recommended reading list](https://hedgedoc.gnome.org/design-reading?view#), particularly those by Havoc Pennington (for some insight into the history behind GNOME design work).
uz: Dizayn jamoasining [tavsiya etilgan oʻqish roʻyxatidagi](https://hedgedoc.gnome.org/design-reading?view#) yozuvlari, xususan, Xavoc Penningtonning (GNOME dizayn ishlari ortidagi tarixni tushunish uchun).

source: Participating in GNOME design does not entail any other requirements for experience or training. However, the role that you are able to play in GNOME design will depend on your existing level of expertise: experienced designers may be able to take on design initiatives relatively quickly, but if you are new to design work, you may need to gain experience on smaller tasks to begin with.
uz: GNOME dizaynida ishtirok etish tajriba yoki trening uchun boshqa hech qanday talablarni talab qilmaydi. Biroq, GNOME dizaynida oʻynashingiz mumkin boʻlgan rol sizning mavjud tajriba darajangizga bogʻliq boʻladi: tajribali dizaynerlar dizayn tashabbuslarini nisbatan tez oʻz zimmalariga olishlari mumkin, ammo agar siz dizayn ishida yangi boʻlsangiz, boshlash uchun kichikroq vazifalarda tajriba orttirishingiz kerak boʻlishi mumkin.

source: Joining the team
uz: Jamoaga qoʻshilish

source: Other ways to help
uz: Yordam berishning boshqa usullari

source: There are many ways to contribute to GNOME user experience. If you are new and want to help out, here are some great ways to get started:
uz: GNOME foydalanuvchi tajribasiga hissa qoʻshishning koʻplab usullari mavjud. Agar siz yangi boʻlsangiz va yordam berishni istasangiz, bu erda boshlashning ajoyib usullari mavjud:

source: Try contributing user experience changes directly to GNOME modules. This can include even simple changes such as icon or text label changes.
uz: Foydalanuvchi tajribasidagi oʻzgarishlarni bevosita GNOME modullariga qoʻshishga harakat qiling. Bu hatto oddiy oʻzgarishlarni ham oʻz ichiga olishi mumkin, masalan, piktogramma yoki matn yorligʻi oʻzgarishi.

source: Report user experience problems in GNOME’s issue trackers.
uz: GNOME muammolarini kuzatuvchilarida foydalanuvchi tajribasi muammolari haqida xabar bering.

source: Help out in the issue trackers of GNOME modules, to review reports and help to find solutions to design problems.
uz: Hisobotlarni koʻrib chiqish va dizayn muammolarini hal qilishda yordam berish uchun GNOME modullari muammolarini izlashda yordam bering.

source: These activities will often require you to work with the design team to come up with solutions to design problems.
uz: Ushbu tadbirlar koʻpincha dizayn muammolarini hal qilish uchun dizayn jamoasi bilan ishlashingizni talab qiladi.

source: Useful apps
uz: Foydali ilovalar

source: Reporting issues
uz: Xabar berish muammolari

source: The Websites Team maintains pages like [This Week in GNOME](https://thisweek.gnome.org/), [Apps for GNOME](https://apps.gnome.org/), and many more. You can find an overview of all websites on our [team page](https://gitlab.gnome.org/Teams/Websites/). The websites team is supported by the work of the design and infrastructure teams.
uz: Veb-saytlar jamoasi [Bu hafta GNOME-da](https://thisweek.gnome.org/), [GNOME uchun ilovalar](https://apps.gnome.org/) va boshqa koʻplab sahifalarni yuritadi. Barcha veb-saytlar haqida umumiy ma’lumotni [jamoa sahifamiz](https://gitlab.gnome.org/Teams/Websites/) orqali topishingiz mumkin. Veb-saytlar jamoasi dizayn va infratuzilma guruhlari tomonidan qoʻllab-quvvatlanadi.

source: Translating websites
uz: Veb-saytlarni tarjima qilish

source: Oftentimes a website has a link to its repository at the bottom of the page. If you can’t figure out the correct place to report an issue you can check the [Website Team’s page](https://gitlab.gnome.org/Teams/Websites/) for the respective website. This page also gives you a place to report issues without knowing the correct website or for more general issues.
uz: Koʻpincha veb-sayt sahifaning pastki qismida oʻz omboriga havolaga ega. Agar muammo haqida xabar berish uchun toʻgʻri joyni topa olmasangiz, tegishli veb-sayt uchun [Veb-sayt jamoasi sahifasini](https://gitlab.gnome.org/Teams/Websites/) tekshiring. Bu sahifa, shuningdek, sizga toʻgʻri veb-saytni bilmasdan yoki umumiy muammolar haqida xabar berish uchun joy beradi.

source: Working on websites
uz: Veb-saytlarda ishlash

source: The work on websites highly differs from website to website. For getting started it is a good idea to resist the temptation to redesign a whole website or even the whole of all websites. Instead, you can check the [team’s issue tracker](https://gitlab.gnome.org/groups/Teams/Websites/-/issues/) for open issues. You can also check what website suits you technology wise: While some websites are written in Sphinx, Jekyll, or plain HTML, others are based on more complex Rust code.
uz: Veb-saytlardagi ish veb-saytdan veb-saytga juda farq qiladi. Boshlash uchun butun veb-saytni yoki hatto butun veb-saytlarni qayta loyihalash vasvasasiga qarshi turish yaxshi fikrdir. Buning oʻrniga, ochiq muammolar mavjudligini [jamoaning muammolarni kuzatuvchisi](https://gitlab.gnome.org/groups/Teams/Websites/-/issues/) orqali tekshirishingiz mumkin. Shuningdek, qaysi veb-sayt sizga texnologiya nuqtai nazaridan mos kelishini tekshirishingiz mumkin: Ba'zi veb-saytlar Sphinx, Jekyll yoki oddiy HTML-da yozilgan boʻlsa, boshqalari murakkabroq Rust kodiga asoslangan.
