Repository: uzbek-net/dictionary
Catalog: gnome/infra/ui.main.*.po
Languages: uz

source: The nightly version can also be installed via [Console](https://apps.gnome.org/app/org.gnome.Console/) if the nightly repository is already [configured](http://nightly.gnome.org).
uz: Tungi versiyani [Console](https://apps.gnome.org/app/org.gnome.Console/) orqali ham oʻrnatish mumkin, agar tungi ombor allaqachon [konfiguratsiya qilingan](http://nightly.gnome.org).

source: Tracking down the exact cause of an issue can be a very important task. Especially for issues tagged with labels like “Needs Diagnosis” or “Needs Information.” If you can reproduce, that is, trigger the reported problem yourself, you can try to dig deeper. This can go from finding out under which exact conditions the issue appears, over running the app with [debug output enabled](https://developer-old.gnome.org/glib/unstable/glib-running.html), to adding debug outputs to the code that narrow down the problem.
uz: Muammoning aniq sababini kuzatish juda muhim vazifa boʻlishi mumkin. Ayniqsa, "Tashxisga muhtoj" yoki "Ma'lumot kerak" kabi yorliqlar bilan belgilangan muammolar uchun. Agar siz koʻpaytira olsangiz, ya'ni xabar qilingan muammoni oʻzingiz qoʻzgʻatsangiz, chuqurroq qazishga harakat qilishingiz mumkin. Bu muammo aynan qaysi sharoitlarda paydo boʻlishini aniqlashdan, ilovani [debug output enabled](https://developer-old.gnome.org/glib/unstable/glib-running.html) bilan ishga tushirishdan tortib, muammoni toraytiruvchi kodga disk raskadrovka natijalarini qoʻshishgacha borishi mumkin.

source: Suggesting features
uz: Xususiyatlarni taklif qilish

source: Most apps handle feature requests via the issue tracker as well. Note that implementing features and maintaining them as part of the codebase in the future can require a significant amount of additional work. Therefore, you should consider whether a new feature could even be relevant enough to be part of this app.
uz: Aksariyat ilovalar xususiyat soʻrovlarini muammo kuzatuvchisi orqali ham bajaradi. E'tibor bering, funktsiyalarni amalga oshirish va ularni kelajakda kodlar bazasining bir qismi sifatida saqlash katta hajmdagi qoʻshimcha ishlarni talab qilishi mumkin. Shuning uchun, yangi xususiyat hatto ushbu ilovaning bir qismi boʻlish uchun etarli boʻlishi mumkinligini oʻylab koʻrishingiz kerak.

source: Working on the code
uz: Kod ustida ishlash

source: When suggesting a new feature, it is helpful to focus on the question of what practical problem the feature should solve. Not on how the app should solve the problem or how exactly an implementation would look like. Preferably, you can also give a practical example where you needed the feature.
uz: Yangi xususiyatni taklif qilganda, bu xususiyat qanday amaliy muammoni hal qilishi kerakligi haqidagi savolga e'tibor qaratish foydali boʻladi. Ilova muammoni qanday hal qilishi yoki dastur qanday koʻrinishi haqida emas. Afzal, siz xususiyat kerak boʻlgan joyda amaliy misol ham keltirishingiz mumkin.

source: Whether you want to fix a typo, change the user interface, or work on the code of the app, the following information can help you get started. The first step will be to get the app built on your computer, allowing you to play around with your changes. Afterward, you can check the provided documentation on how to get respective tasks done. The subsequent section will show you how to submit your changes.
uz: Yozuv xatosini tuzatmoqchimisiz, foydalanuvchi interfeysini oʻzgartirmoqchimisiz yoki ilova kodi ustida ishlashni xohlaysizmi, quyidagi ma’lumotlar ishga kirishishda yordam beradi. Birinchi qadam, oʻzgartirishlaringiz bilan oʻynashga imkon beruvchi ilovani kompyuteringizga oʻrnatish boʻladi. Shundan soʻng, siz tegishli topshiriqlarni qanday bajarish haqida taqdim etilgan hujjatlarni tekshirishingiz mumkin. Keyingi boʻlim sizga oʻzgartirishlaringizni qanday yuborishni koʻrsatib beradi.

source: Finding a task
uz: Vazifani topish

source: If you are planning a somewhat larger change or addition to the app, it is often a good idea to check in with the maintainers of the app to find out if that change would be accepted. For this, you should first convince yourself that you can tackle the task at hand by doing the very first implementation steps and then check in with the maintainers via the issue tracker. This is also a good way to check if the project has an active maintainer who can accept your contribution. Despite our best efforts, not all projects are always continuously maintained.
uz: Agar siz ilovaga biroz kattaroq oʻzgartirish yoki qoʻshimcha kiritishni rejalashtirmoqchi boʻlsangiz, ushbu oʻzgarish qabul qilinadimi yoki yoʻqligini bilish uchun ilovaning xizmat koʻrsatuvchilari bilan bogʻlanish yaxshi boʻladi. Buning uchun siz birinchi amalga oshirish bosqichlarini bajarib, vazifani engishingiz mumkinligiga oʻzingizni ishontirishingiz kerak, soʻngra muammolarni kuzatuvchisi orqali ta'minotchilarga murojaat qiling. Bu, shuningdek, loyihada sizning hissangizni qabul qila oladigan faol xizmat koʻrsatuvchisi mavjudligini tekshirishning yaxshi usuli. Bizning barcha sa'y-harakatlarimizga qaramay, barcha loyihalar doimo doimiy ravishda davom etavermaydi.

source: Note that while many community members are happy to help you out when you are stuck, maintainers oftentimes might not have the resources to guide you through a contribution.
uz: Shuni esda tutingki, koʻplab hamjamiyat a'zolari tiqilib qolganingizda sizga yordam berishdan xursand boʻlishsa-da, xizmat koʻrsatuvchilar koʻpincha sizga hissa qoʻshishda sizga yordam berish uchun resurslarga ega boʻlmasligi mumkin.

source: You can do this by trying out the nightly build of the app.
uz: Buni ilovaning tungi tuzilishini sinab koʻrish orqali qilishingiz mumkin.

source: Catching issues and regressions before they land in a stable release is very valuable for a project. You can help with this by trying out an upcoming release. You can do this by trying out the nightly build of the app.
uz: Muammolar va regressiyalarni barqaror versiyaga tushishidan oldin ushlash loyiha uchun juda qimmatlidir. Kelgusi versiyani sinab koʻrish orqali bunga yordam berishingiz mumkin. Buni ilovaning tungi tuzilishini sinab koʻrish orqali qilishingiz mumkin.

source: Getting the app to build
uz: Ilova yaratish uchun olinmoqda

source: When making changes to an app you will usually want to build and test the app with its changes on your computer. For most apps this process can be simplified a lot by using the Builder app.
uz: Ilovaga oʻzgartirishlar kiritishda siz odatda dasturni oʻz kompyuteringizda oʻzgartirishlari bilan tuzib, sinab koʻrishni xohlaysiz. Aksariyat ilovalar uchun bu jarayonni Builder ilovasi yordamida ancha soddalashtirish mumkin.

source: After starting Builder, you can choose to *clone* a project. This will download the app to your computer.
uz: Builder-ni ishga tushirgandan soʻng, siz loyihani *klonlashni* tanlashingiz mumkin. Bu ilovani kompyuteringizga yuklab oladi.

source: You have to enter the repository location. The correct URL can be copied from below.
uz: Siz saqlash joyini kiritishingiz kerak. Toʻgʻri URLni pastdan nusxalash mumkin.

source: This app also has tasks which are labeled with the “Newcomer” tag. Those tasks usually require less prior knowledge or are less complex.
uz: Ushbu ilovada "Yangi kelganlar" yorligʻi bilan belgilangan vazifalar ham mavjud. Bu vazifalar odatda kamroq bilim talab qiladi yoki kamroq murakkabdir.

source: Depending on your internet connection and the size of the project, cloning the project might take a while. After Builder has completed this step, the project window should open. You might have to confirm the installation of some required dependencies. To try if you can successfully build and start the app, you can now press the “Run Project” button.
uz: Internetga ulanishingiz va loyiha hajmiga qarab, loyihani klonlash biroz vaqt talab qilishi mumkin. Builder ushbu bosqichni tugatgandan soʻng, loyiha oynasi ochilishi kerak. Ba'zi kerakli bogʻliqliklarni oʻrnatishni tasdiqlashingiz kerak boʻlishi mumkin. Ilovani muvaffaqiyatli yaratib, ishga tushirishga harakat qilish uchun endi “Loyihani ishga tushirish” tugmasini bosishingiz mumkin.

source: If everything goes right, the app should be built. After the build has been completed, the built app should start automatically.
uz: Agar hamma narsa toʻgʻri boʻlsa, dasturni yaratish kerak. Qurilish tugallangandan soʻng, qurilgan ilova avtomatik ravishda ishga tushishi kerak.

source: JavaScript language
uz: JavaScript tili

source: There is no information available on how to build this app.
uz: Ushbu ilovani qanday yaratish haqida hech qanday ma'lumot yoʻq.

source: Python language
uz: Python tili

source: Rust language
uz: Zang tili

source: Submitting your work
uz: Ishingizni topshirish

source: After making changes to a project, you can submit them for review. Our goal is to create what’s called a *merge request* or *pull request*. That means suggesting a change to a project’s code and data.
uz: Loyihaga oʻzgartirish kiritganingizdan soʻng ularni koʻrib chiqish uchun yuborishingiz mumkin. Bizning maqsadimiz * birlashtirish soʻrovi * yoki * tortish soʻrovi * deb nomlangan narsani yaratishdir. Bu loyiha kodi va ma'lumotlarini oʻzgartirishni taklif qilishni anglatadi.

source: Setting up GitHub
uz: GitHub-ni sozlash

source: C language
uz: C tili

source: Vala language
uz: Vala tili

source: Creating your own project copy
uz: Oʻzingizning loyiha nusxangizni yaratish

source: where `<ssh-fork-url>` has to be replaced with the SSH URL you looked up in the previous step.
uz: qayerda `<ssh-fork-url> ` oldingi bosqichda qidirgan SSH URL bilan almashtirilishi kerak.

source: Creating a merge request
uz: Birlashtirish soʻrovi yaratilmoqda

source: We now arrive at what are more regular tasks when working with git.
uz: Endi biz git bilan ishlashda qanday oddiy vazifalarga erishamiz.

source: First, we want to switch to what’s called a different *branch*. Branches are variants of the original code where you can, for example, develop a feature, until it is ready to go into the actually used code. To do this you can call
uz: Birinchidan, biz boshqa * filial * deb ataladigan narsaga oʻtmoqchimiz. Filiallar asl kodning variantlari boʻlib, unda siz, masalan, amalda foydalanilgan kodga oʻtishga tayyor boʻlgunga qadar xususiyatni ishlab chiqishingiz mumkin. Buning uchun siz qoʻngʻiroq qilishingiz mumkin

source: Setting up GitLab
uz: GitLab oʻrnatilmoqda

source: where `my-changes` is a short description of what you are working on, without spaces.
uz: bu yerda “mening oʻzgarishlarim” boʻsh joysiz, nima ustida ishlayotganingizning qisqacha tavsifi.

source: Next, we want to save the changes you made with git. That’s usually referred to as creating a *commit*. You can do this with the command
uz: Keyinchalik, biz git yordamida kiritilgan oʻzgarishlarni saqlamoqchimiz. Bu odatda * majburiyat * yaratish deb ataladi. Buni buyruq bilan qilishingiz mumkin

source: The commit messages should describe your changes. You can learn more about [choosing a fitting commit message](https://handbook.gnome.org/development/commit-messages.html).
uz: Qabul qilish xabarlari sizning oʻzgarishlaringizni tasvirlashi kerak. Siz [toʻgʻri kelishilgan xabarni tanlash](https://handbook.gnome.org/development/commit-messages.html) haqida koʻproq bilib olishingiz mumkin.

source: Now, we have to get your saved changes onto GitLab. Luckily, we have already done all the setup with using `git remote add` in the previous section. All that’s left to do is now to call
uz: Endi biz saqlangan oʻzgarishlarni GitLab-ga olishimiz kerak. Yaxshiyamki, biz oldingi boʻlimda "git remote add" dan foydalanib, barcha sozlashlarni amalga oshirdik. Endi faqat qoʻngʻiroq qilish qoldi

source: We are finally at the last step. If you check the output in Console after our previous `git push` command, you will probably already see a website link showing you the way to create a *pull* or *merge request*. You can open it by pressing the *Ctrl* key while clicking on it. All that is left is to follow the website to finalize submitting your changes.
uz: Biz nihoyat oxirgi bosqichdamiz. Oldingi `git push` buyrugʻimizdan soʻng Console-da chiqishni tekshirsangiz, sizda *tortish* yoki *birlashtirish soʻrovini* yaratish yoʻlini koʻrsatadigan veb-sayt havolasini koʻrasiz. Uni bosish paytida * Ctrl * tugmachasini bosib ochishingiz mumkin. Oʻzgarishlarni topshirishni yakunlash uchun veb-saytga rioya qilish qoladi.

source: Contribute to existing apps
uz: Mavjud ilovalarga hissa qoʻshing

source: Our community
uz: Bizning jamoamiz

source: A very warm welcome to the GNOME project. We want everyone to have an enjoyable and fulfilling experience. For this, the GNOME community prioritizes marginalized people’s safety over privileged people’s comfort. To learn more about how you can find support and what is expected from contributors, please have a look at our [GNOME Code of Conduct](https://conduct.gnome.org).
uz: GNOME loyihasiga juda samimiy xush kelibsiz. Biz hammaga yoqimli va qoniqarli tajribaga ega boʻlishini xohlaymiz. Buning uchun GNOME hamjamiyati imtiyozli odamlarning qulayligidan koʻra marginal odamlarning xavfsizligini birinchi oʻringa qoʻyadi. Qanday qilib yordam topishingiz mumkinligi va hissa qoʻshuvchilardan nima kutilishi haqida koʻproq bilish uchun bizning [GNOME oʻzini tutish kodeksi](https://conduct.gnome.org) ni koʻrib chiqing.

source: Below, you can find instructions on how to build and work on specific apps. If you are not sure where to contribute, consider choosing an app that you use yourself or select a programming language with which you are already familiar. Try to solve a problem or implement a feature that is important to you or where you feel an inner motivation.
uz: Quyida ma'lum ilovalarni yaratish va ular ustida ishlash boʻyicha koʻrsatmalarni topishingiz mumkin. Qaerga hissa qoʻshishni bilmasangiz, oʻzingiz foydalanadigan ilovani yoki oʻzingizga tanish boʻlgan dasturlash tilini tanlang. Muammoni hal qilishga harakat qiling yoki siz uchun muhim boʻlgan yoki ichki motivatsiyani his qiladigan xususiyatni amalga oshirishga harakat qiling.

source: Creating a new app
uz: Yangi ilova yaratish

source: Creating your own app will not only allow you to implement your own ideas at will. It is also an opportunity to understand how all the pieces in the GNOME ecosystem fit together.
uz: Oʻz ilovangizni yaratish nafaqat oʻz gʻoyalaringizni oʻz xohishingizga koʻra amalga oshirish imkonini beradi. Bu, shuningdek, GNOME ekotizimidagi barcha qismlar bir-biriga qanday mos kelishini tushunish imkoniyatidir.

source: It is possible to write apps for GNOME in several different programming languages. You can check our list of the [most frequently used languages](https://developer.gnome.org/documentation/introduction/languages.html).
uz: GNOME uchun ilovalarni turli xil dasturlash tillarida yozish mumkin. Siz bizning [eng tez-tez ishlatiladigan tillar](https://developer.gnome.org/documentation/introduction/languages.html) roʻyxatini tekshirishingiz mumkin.

source: You can publish your app on [Flathub](https://docs.flathub.org/docs/for-app-authors/submission/) to make it easily available to many people. If your app is polished and ready for everyday usage, you can consider submitting it to [GNOME Circle](https://circle.gnome.org). The Circle membership makes your project eligible for support through the GNOME Foundation.
uz: Ilovangizni [Flathub](https://docs.flathub.org/docs/for-app-authors/submission/) da chop etishingiz mumkin, bu uni koʻpchilikka osonlik bilan taqdim etadi. Agar ilovangiz jilolangan va kundalik foydalanishga tayyor boʻlsa, uni [GNOME Circle](https://circle.gnome.org) ga yuborishingiz mumkin. Circle a'zoligi sizning loyihangizni GNOME fondi orqali qoʻllab-quvvatlash huquqini beradi.

source: Where to contribute
uz: Qaerda hissa qoʻshish kerak

source: Within GNOME there are many areas where you can contribute and a plethora of skills that are appreciated.
uz: GNOME ichida siz oʻz hissangizni qoʻshishingiz mumkin boʻlgan koʻplab sohalar va koʻplab koʻnikmalar mavjud.

source: Programming languages
uz: Dasturlash tillari

source: Below, you can find an overview of the most popular languages for writing GNOME apps.
uz: Quyida GNOME ilovalarini yozish uchun eng mashhur tillar haqida umumiy ma’lumotni topishingiz mumkin.

source: Contribute to an app
uz: Ilovaga hissa qoʻshing

source: Below, you can find specific contribution guides for all GNOME apps. If you are not sure where to contribute, consider choosing an app that you use yourself. Try to solve something that is important to you or where you feel an inner motivation.
uz: Quyida siz barcha GNOME ilovalari uchun maxsus hissa qoʻllanmalarini topishingiz mumkin. Qaerga hissa qoʻshishni bilmasangiz, oʻzingiz foydalanadigan ilovani tanlashni oʻylab koʻring. Siz uchun muhim boʻlgan yoki ichki motivatsiyani his qiladigan narsani hal qilishga harakat qiling.

source: To get started with developing GNOME apps with C we recommend the [Beginners Tutorial](https://developer.gnome.org/documentation/tutorials/beginners/getting_started.html) that also covers the C language. You can find other important resources below.
uz: GNOME ilovalarini C bilan ishlab chiqishni boshlash uchun biz C tilini ham qamrab olgan [Beginners Tutorial](https://developer.gnome.org/documentation/tutorials/beginners/getting_started.html) ni tavsiya qilamiz. Quyida boshqa muhim manbalarni topishingiz mumkin.

source: Internships
uz: Amaliyot

source: You can begin or continue your journey with GNOME with a remote internship including mentoring and a stipend. You can both choose from suggested projects or suggest your own.
uz: GNOME bilan sayohatingizni masofaviy stajirovka, jumladan, murabbiylik va stipendiya bilan boshlashingiz yoki davom ettirishingiz mumkin. Siz taklif qilingan loyihalardan birini tanlashingiz yoki oʻzingiznikini taklif qilishingiz mumkin.

source: We recommend the [GJS Developer Guide](https://gjs.guide/guides/) to get started with JavaScript in GNOME. You can find other important resources below.
uz: GNOME’da JavaScript bilan ishlashni boshlash uchun [GJS Developer Guide](https://gjs.guide/guides/) ni tavsiya qilamiz. Boshqa muhim manbalarni quyida topishingiz mumkin.

source: Something missing?
uz: Nimadir etishmayaptimi?

source: The *Welcome to GNOME* pages are new. [Let us know](https://gitlab.gnome.org/Teams/Websites/welcome.gnome.org/-/issues) if you couldn’t find what you were hoping to find on this website.
uz: *GNOME ga xush kelibsiz* sahifalari yangi. Agar siz ushbu veb-saytda qidirayotgan narsangizni topa olmasangiz, [Bizga xabar bering](https://gitlab.gnome.org/Teams/Websites/welcome.gnome.org/-/issues).

source: If you are familiar with the basics of the [Python language](https://www.python.org/), we recommend the [Beginners Tutorial](https://developer.gnome.org/documentation/tutorials/beginners/getting_started.html) which also covers the Python language. You can find other important resources below.
uz: Agar siz [Python tili](https://www.python.org/) asoslari bilan tanish boʻlsangiz, Python tilini ham oʻz ichiga olgan [Beginners Tutorial](https://developer.gnome.org/documentation/tutorials/beginners/getting_started.html)ni tavsiya qilamiz. Quyida boshqa muhim manbalarni topishingiz mumkin.

source: If you are familiar with the basics of the [Rust language](https://www.rust-lang.org), we recommend the online book [GUI development with Rust and GTK 4](https://gtk-rs.org/gtk4-rs/stable/latest/book/). This book explains how Rust can be used to create apps in the GNOME ecosystem. You can find other important resources below.
uz: Agar siz [Rust language](https://www.rust-lang.org) asoslari bilan tanish boʻlsangiz, onlayn kitobni [Rust va GTK 4 bilan GUI ishlab chiqish](https://gtk-rs.org/gtk4-rs/stable/latest/book/)ni tavsiya qilamiz. Ushbu kitob Rust-dan GNOME ekotizimida ilovalar yaratish uchun qanday foydalanish mumkinligini tushuntiradi. Quyida boshqa muhim manbalarni topishingiz mumkin.

source: For getting started with the [Vala language](https://vala.dev/), we recommend the [Vala Tutorial](https://docs.vala.dev/tutorials/programming-language/main.html) or the [Beginners Tutorial](https://developer.gnome.org/documentation/tutorials/beginners/getting_started.html), which also covers Vala. You can find other important resources below.
uz: [Vala tilini](https://vala.dev/) bilan boshlash uchun biz [Vala oʻquv qoʻllanmasi](https://docs.vala.dev/tutorials/programming-language/main.html) yoki [Yangi boshlanuvchilar uchun qoʻllanma](https://developer.gnome.org/documentation/tutorials/beginners/getting_started.html), tavsiya qilamiz. Vala. Quyida boshqa muhim manbalarni topishingiz mumkin.

source: The following apps are worth trying out to get started with development within GNOME. For more apps you can check the [Development Tools section](https://apps.gnome.org/#development) on *Apps for GNOME*.
uz: GNOME ichida ishlab chiqishni boshlash uchun quyidagi ilovalarni sinab koʻrishga arziydi. Koʻproq ilovalar uchun *GNOME uchun ilovalar* boʻlimidagi [Ishlab chiqish vositalari boʻlimi](https://apps.gnome.org/#development) boʻlimini tekshirishingiz mumkin.

source: The GNOME design team is responsible for GNOME user experience and visual design. This includes:
uz: GNOME dizayn jamoasi GNOME foydalanuvchi tajribasi va vizual dizayn uchun javobgardir. Bunga quyidagilar kiradi:

source: the design of the GNOME desktop, core apps, and app toolkit components
uz: GNOME ish stoli dizayni, asosiy ilovalari va ilovalar toʻplami komponentlari

source: icon and wallpaper design
uz: ikonka va fon rasmi dizayni

source: interface styling
uz: interfeys uslubi

source: maintaining GNOME’s design guidelines
uz: GNOME-ning dizayn koʻrsatmalariga rioya qilish

source: usability testing and research
uz: yaroqlilik sinovi va tadqiqot

source: Help is needed in all of these areas, and contributions are welcome.
uz: Ushbu sohalarning barchasida yordam kerak va hissalar mamnuniyat bilan qabul qilinadi.

source: Get involved
uz: Ishtirok eting

source: New contributors should join the GNOME design chat channel and see the GNOME design team GitLab space.
uz: Yangi ishtirokchilar GNOME dizayn chat kanaliga qoʻshilishlari va GNOME dizayn jamoasi GitLab maydonini koʻrishlari kerak.

source: GNOME design work happens in a variety of places, depending on the type of contribution:
uz: GNOME dizayn ishi hissa turiga qarab turli joylarda amalga oshiriladi:

source: To contribute directly to the design of an app or module, use its project in GitLab or its Matrix chat channel.
uz: Ilova yoki modul dizayniga bevosita hissa qoʻshish uchun uning loyihasidan GitLab yoki Matrix chat kanalida foydalaning.

source: Many contributions happen through discussion with other designers and developers, often in chat on Matrix.
uz: Koʻpgina hissalar boshqa dizaynerlar va ishlab chiquvchilar bilan, koʻpincha Matrix-dagi chatda muhokama qilish orqali amalga oshiriladi.

source: Contributions to icons and wallpapers happen in dedicated GitLab projects, whose details can be found in [GNOME design team GitLab space](https://gitlab.gnome.org/Teams/Design).
uz: Belgilar va fon rasmlariga hissalar GitLab maxsus loyihalarida amalga oshiriladi, ularning tafsilotlarini [GNOME dizayn jamoasi GitLab maydoni](https://gitlab.gnome.org/Teams/Design) da topish mumkin.

source: Ideas for design changes can be suggested in the [design team’s whiteboard project](https://gitlab.gnome.org/Teams/Design/whiteboards).
uz: Dizaynni oʻzgartirish gʻoyalarini [dizayn jamoasining doska loyihasida](https://gitlab.gnome.org/Teams/Design/whiteboards) taklif qilish mumkin.
